{"items":[{"type":"Class","id":"21W.730","course":"21W","label":"Writing on Contemporary Issues","shortLabel":"Writing on Contemporary Issues","units":"3-0-9","total-units":12,"description":"Focuses on forms of exposition, including narration, critique, argument, and persuasion, to develop students' ability to write clear and effective prose. Students write frequently, receive feedback on work in progress, improve their work by revising, read the work of accomplished writers, and participate actively in class discussions and workshops. Short oral presentations also required. Readings and assignments vary by section and focus on themes such as contemporary social problems, the cultural influence of film, the culture of food, the environment, and others. See subject website for complete section descriptions. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Writing","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.731","course":"21W","label":"Writing and Experience","shortLabel":"Writing and Experience","units":"3-0-9","total-units":12,"description":"Focuses on the ways writers transform experience into finished and polished writing in the forms of memoir, autobiography, and essay. Frequent writing assignments, regular revisions, and short oral presentations required. Readings and specific writing assignments vary by section. See subject website for enhanced section descriptions. Emphasizes developing students' ability to write clear and effective prose. Students write frequently, give and receive response to work in progress, improve their writing by revising, read the work of accomplished writers, and participate actively in class discussions and workshops. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Writing","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.732","course":"21W","label":"Introduction to Scientific and Technical Communication","shortLabel":"Introduction to Scientific and Technical Communication","units":"3-0-9","total-units":12,"description":"Focuses on forms of technical and scientific writing, including special problems in organizing and presenting technical information and writing for different audiences and purposes. Students write frequently, give and receive feedback to work in progress, improve their writing by revising, read the work of accomplished writers, and participate actively in class discussions and workshops. Short oral presentations also required. Readings and specific writing assignments vary by section. See subject website for enhanced section descriptions. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Writing","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.734","course":"21W","label":"Writing About Literature","shortLabel":"Writing About Literature","units":"3-0-9","total-units":12,"description":"Intensive focus on the reading and writing skills used to analyze literary texts such as poems by Emily Dickinson, Shakespeare or Langston Hughes; short stories by Chekhov, Joyce, or Alice Walker; and a short novel by Melville or Toni Morrison. Designed not only to prepare students for further work in writing and literary and media study, but also to provide increased confidence and pleasure in their reading, writing, and analytical skills. Students write or revise essays weekly. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Writing","gir":"HASS Elective","joint":"21L.000J","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.764","course":"21W","label":"The Word Made Digital","shortLabel":"The Word Made Digital","units":"3-0-9","total-units":12,"description":"Video games, digital art and literature, online texts, and source code are analyzed in the contexts of history, culture, and computing platforms. Approaches from poetics and computer science are used to understand the non-narrative digital uses of text. Students undertake critical writing and creative computer projects to encounter digital writing through practice. This involves reading and modifying computer programs; therefore previous programming experience, although not required, will be helpful. The graduate section includes additional assignments. Maximum of 18 students.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"CMS.609J","equivalent":"","offering":"N","semester":['Spring'],"in-charge":"N. Montfort"},{"type":"Class","id":"21W.765","course":"21W","label":"Interactive and Non-Linear Narrative: Theory and Practice","shortLabel":"Interactive and Non-Linear Narrative: Theory and Practice","units":"3-0-9","total-units":12,"description":"Techniques of creating narratives that take advantage of the flexibility of form offered by the computer. Study of the structural properties of book-based narratives that experiment with digression, multiple points of view, disruptions of time and of storyline. Analysis of the structure and evaluation of the literary qualities of computer-based narratives including hypertexts, adventure games, and classic artificial intelligence programs like <I>Eliza</I>. With this base, students use authoring systems to model a variety of narrative techniques and to create their own fictions. Knowledge of programming helpful but not necessary.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"21L.489J","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"N. Montfort"},{"type":"Class","id":"21W.766","course":"21W","label":"Contemporary US Women of Color: Writing and Reading Short Stories","shortLabel":"Contemporary US Women of Color: Writing and Reading Short Stories","units":"3-0-9","total-units":12,"description":"Students read short stories by Native American, Latina, African-American, and Asian-American women writers and write their own stories and descriptive sketches. Writing assignments and discussions focus on these themes: reclaiming, reconstructing, and preserving culture; cultural heritage as a source of power and resistance; storytelling as a means of celebration and survival; shifting, contending, and multiple identities; the costs and advantages of breaking silence; and tensions between assimilation and maintaining cultural practices.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"SP.574J","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"H. Lee"},{"type":"Class","id":"21W.769","course":"21W","label":"Playwrights' Workshop","shortLabel":"Playwrights' Workshop","units":"3-2-7","total-units":12,"description":"Continues work in the development of play scripts for the theater. Writers work on sustained pieces in weekly workshop meetings, individual consultation with the instructor, and in collaboration with student actors, directors, and designers. Fully developed scripts eligible for inclusion in the Playwrights' Workshop production.","level":"Undergraduate","prereqs":"21M.604, 21W.754 or permission of instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"21M.785J","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"A. Brody"},{"type":"Class","id":"21W.770","course":"21W","label":"Advanced Fiction Workshop","shortLabel":"Advanced Fiction Workshop","units":"3-0-9","total-units":12,"description":"For students with some experience in writing fiction. Write longer works of fiction and short stories which are related or interconnected. Read short story collections by individual writers, such as Sandra Cisneros, Raymond Carver, Edward P. Jones, and Tillie Olsen, and discuss them critically and analytically, with attention to the ways in which the writers' choices about component parts contribute to meaning. In-class exercises and weekly workshops of student work focus on sources of story material, characterization, structure, narrative voice, point of view and concrete detail. Concentration on revision.","level":"Undergraduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"H. Lee"},{"type":"Class","id":"21W.771","course":"21W","label":"Advanced Poetry Workshop","shortLabel":"Advanced Poetry Workshop","units":"3-0-9","total-units":12,"description":"For students experienced in writing poems. Regular reading of published contemporary poets and weekly submission of manuscripts for class review and criticism. Students expected to do a substantial amount of rewriting and revision. Classwork supplemented with individual conferences.","level":"Undergraduate","prereqs":"Prior manuscript submission required","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.772","course":"21W","label":"Digital Poetry","shortLabel":"Digital Poetry","units":"3-0-9","total-units":12,"description":"Digital forms of poetry, including hypertext poems, Flash-animated poems, poems within short digital videos and interactive forms of poetry and games. Readings in early hypertext theory and creative writing. Experiment with creating poetry for wireless access on hand held devices. Test the assumptions of these early theorists through practice of creating digital poetry. Students discuss online examples of each of these kinds of digital poetry and then compose their own work, to present in class for critique and revision. The final project allows students to build upon their experience throughout the term with these forms.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"E. Barrett"},{"type":"Class","id":"21W.820","course":"21W","label":"Writing: Science, Technology, and Society","shortLabel":"Writing: Science, Technology, and Society","units":"3-0-9","total-units":12,"description":"Examination of different "voices" used to consider issues of scientific, technological, and social concern. Students write frequently and choose among a variety of non-fiction forms: historical writing, social analysis, political criticism, and policy reports. Instruction in expressing ideas clearly and in organizing a thesis-length work. Reading and writing on three case studies drawn from the history of science; the cultural study of technology and science; and policy issues.","level":"High Graduate","prereqs":"STS.210J/21H.991J","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"STS.477J","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"K. Manning"},{"type":"Class","id":"21W.749","course":"21W","label":"Documentary Photography and Photojournalism: Still Images of a World in Motion","shortLabel":"Documentary Photography and Photojournalism: Still Images of a World in Motion","units":"3-0-9","total-units":12,"description":"Designed to increase students' understanding of, appreciation for, and ability to do documentary photography and photojournalism. Each three-hour class is divided between a discussion of issues and readings, and a group critique of students' projects. Students must have their own photographic equipment and be responsible for processing and printing: either by student or commercial lab. Students must show basic proficiency with their equipment. Readings include Susan Sontag, Robert Coles, Ken Light, Eugene Richards, and others. Previous photographic experience required. Enrollment limited to 15.","level":"Undergraduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"B. D. Colen"},{"type":"Class","id":"21W.754","course":"21W","label":"Playwriting I","shortLabel":"Playwriting I","units":"3-0-9","total-units":12,"description":"Introduces the craft of writing for the theater. Through weekly assignments, in class writing exercises, and work on a sustained piece, students explore scene structure, action, events, voice, and dialogue. Examine produced playscripts and  discuss student work. Emphasis on process, risk-taking, and finding one's own voice and vision.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"21M.604J","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"L. Harrington"},{"type":"Class","id":"21W.755","course":"21W","label":"Writing and Reading Short Stories","shortLabel":"Writing and Reading Short Stories","units":"3-0-9","total-units":12,"description":"Introduction to the short story. Students write stories and short descriptive sketches. Readings from European and American stories from the 18th, 19th, and 20th centuries. Class discussion of students' writing and of the assigned stories in their historical and social contexts.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"R. Lombreglia, S. Lewitt"},{"type":"Class","id":"21W.756","course":"21W","label":"Writing and Reading Poems","shortLabel":"Writing and Reading Poems","units":"3-0-9","total-units":12,"description":"Examination of the formal structural and textual variety in poetry. Extensive practice in the making of poems and the analysis of both students' manuscripts and texts from 16th- through 20th-century literature. Attempts to make relevant the traditional elements of poetry and their contemporary alternatives. Weekly writing assignments, including some exercises in prosody.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"W. Corbett"},{"type":"Class","id":"21W.757","course":"21W","label":"Fiction Workshop","shortLabel":"Fiction Workshop","units":"3-0-9","total-units":12,"description":"For students interested in developing their understanding of the craft of fiction. Weekly workshop discussions of students' work focus on analysis of structure, style, and characterization. Emphasis on editing and revision. Reading and discussion of 19th- and 20th-century authors, such as Babel, Carver, Chekhov, Faulkner, Kafka, Orwell, Marquez, and Woolf.","level":"Undergraduate","prereqs":"21W.755","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"H. Lee, A. Castillo"},{"type":"Class","id":"21W.758","course":"21W","label":"Genre Fiction Workshop","shortLabel":"Genre Fiction Workshop","units":"3-0-9","total-units":12,"description":"Students read stories from various genres about catastrophes, natural and human-made, and write stories in specific genres, although not necessarily about the reading topic. Readings include <i>The Last Days of Pompeii</i> (historical  fiction), <i>The Tin Roof Blowdown</i> (suspense), <i>Road</i> (fantasy), and the science fiction novels <i>No Blade of Grass</i> and <i>A Canticle for Leibowitz</i>. Students consider genre protocols and how to write within the restrictions and freedoms associated with each genre. Students write a short reaction to each novel, and one short story within a genre or between genres for round-table workshopping. Enrollment limited to 15 students.","level":"Undergraduate","prereqs":"A subject in writing short fiction or comparable writing experience","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"J. Haldeman"},{"type":"Class","id":"21W.759","course":"21W","label":"Writing Science Fiction","shortLabel":"Writing Science Fiction","units":"3-0-9","total-units":12,"description":"Students write and read science fiction and analyze and discuss stories written for the class. For the first eight weeks, readings in contemporary science fiction accompany lectures and formal writing assignments intended to illuminate various aspects of writing craft as well as the particular problems of writing science fiction. The rest of the term is given to roundtable workshops on students' stories.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"J. Haldeman"},{"type":"Class","id":"21W.762","course":"21W","label":"Poetry Workshop","shortLabel":"Poetry Workshop","units":"3-0-9","total-units":12,"description":"For students with some previous experience in poetry writing. Frequent assignments stress use of language, diction, word choice, line breaks, imagery, mood, and tone. Considers the functions of memory, imagination, dreams, poetic impulses. Throughout the term, students examine the work of published poets. Revision stressed.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"Staff"},{"type":"Class","id":"21W.763","course":"21W","label":"Transmedia Storytelling: Modern Science Fiction","shortLabel":"Transmedia Storytelling: Modern Science Fiction","units":"3-0-9","total-units":12,"description":"Students investigate the genre of science fiction across different media that include the short story, the screenplay, moving image, and games. Students write critical essays and their own works of science fiction, and submit critical analyses of each other's efforts in a roundtable workshop environment.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"CMS.309J","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"B. Coleman"},{"type":"Class","id":"21W.784","course":"21W","label":"Becoming Digital: Writing about Media Change","shortLabel":"Becoming Digital: Writing about Media Change","units":"3-0-9","total-units":12,"description":"Compares pre-digital to digital media to explore the unique problems that arise in this transition, including the manipulability of digital images, the ethics of anonymity on the Internet, the social repercussions of the computer, and the allure of computer gaming. Readings include subject-specific texts, augmented by philosophical articles relevant to the course themes, and some film. Frequent writing and revision, an oral presentation, and intensive class participation are required. Enrollment limited to 18.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 4","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"B. Miller"},{"type":"Class","id":"21W.785","course":"21W","label":"Communicating with Web-Based Media","shortLabel":"Communicating with Web-Based Media","units":"3-0-9","total-units":12,"description":"Analysis, design, implementation, and testing of various forms of digital communication through group collaboration. Students are encouraged to think about the Web and other new digital interactive media not just in terms of technology but also broader issues such as language (verbal and visual), design, information architecture, communication and community. Students work in small groups on a term-long project of their choice. Various written and oral presentations document project development.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"E. Barrett"},{"type":"Class","id":"21W.786","course":"21W","label":"The Social Documentary: Analysis and Production","shortLabel":"The Social Documentary: Analysis and Production","units":"3-0-9","total-units":12,"description":"An introduction to the history of the social documentary from the 1960s through the 1980s. Explores how social upheaval and the shift to smaller, more portable film cameras, and ultimately hand-held video, converged to bring about an upsurge of socially engaged documentary film production. Students screen and analyze a series of key films from the period and work in groups to produce their own short documentary using digital video and computer-based editing. Enrollment limited to 18.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"CMS.336J","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"V. Bald"},{"type":"Class","id":"21W.789","course":"21W","label":"Communicating with Mobile Technology","shortLabel":"Communicating with Mobile Technology","units":"3-0-9","total-units":12,"description":"Students work in small collaborative design teams to propose, build, and document a semester-long project focused on mobile applications for cell phones. Additional assignments include creating several small mobile applications such as context-aware mobile media capture and games. Students document their work through a series of written and oral proposals, progress reports, and final reports. Covers the basics of J2ME and explores mobile imaging and media creation, GPS location, user-centered design, usability testing, and prototyping. Java experience recommended.","level":"Undergraduate","prereqs":"1.00, 6.005, or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"E. Barrett"},{"type":"Class","id":"21W.792","course":"21W","label":"Science Writing Internship","shortLabel":"Science Writing Internship","units":"0-12-0","total-units":12,"description":"Part-time internships in Boston-area media and industries are arranged for students wishing to develop professional writing and publishing skills. Students planning to take this subject must contact the instructor by November of the previous term.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"J. Paradis"},{"type":"Class","id":"21W.794","course":"21W","label":"Graduate Technical Writing Workshop","shortLabel":"Graduate Technical Writing Workshop","units":"0-0-0","total-units":0,"description":"Draft a thesis proposal, thesis chapter, journal article, progress report, or specification, and review basics of engineering writing. Sessions cover the processes of organizing and drafting professional papers, improving writing style, and revising documents. Students determine own projects; each project increment receives instructor's editorial suggestions.","level":"Graduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['IAP', 'Spring'],"in-charge":"W. Haas"},{"type":"Class","id":"21W.797","course":"21W","label":"Communication Workshop for CME","shortLabel":"Communication Workshop for CME","units":"1-0-1","total-units":2,"description":"Communication intensive subject for MIT undergraduates participating in the Cambridge-MIT exchange. Intensive week-long workshop focuses on written communication, including discipline-specific material and library research,  and emphasizes argumentation skills.","level":"Undergraduate","prereqs":"Acceptance in the CME program","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"M. Poe"},{"type":"Class","id":"21W.798","course":"21W","label":"Special Topics in Writing","shortLabel":"Special Topics in Writing","units":"0-0-0","total-units":0,"description":"","level":"Undergraduate","prereqs":"","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":""},{"type":"Class","id":"21W.799","course":"21W","label":"Special Topics in Writing","shortLabel":"Special Topics in Writing","units":"0-0-0","total-units":0,"description":"Primarily for students pursuing advanced writing projects with the assistance of a member of the Writing Program. Students electing this subject must secure the approval of the director of the Writing Program and its Committee on Curriculum. HASS credit for Special Topics subjects awarded only by individual petitions to the Committee on Curricula. Normal maximum is 6 units; to count toward HASS Requirement, 9 units are required. Exceptional 9-unit projects occasionally approved. 21W.798 is P/D/F.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring', 'Summer'],"in-charge":"J. Paradis"},{"type":"Class","id":"21W.735","course":"21W","label":"Writing and Reading the Essay","shortLabel":"Writing and Reading the Essay","units":"3-0-9","total-units":12,"description":"Exploration of formal and informal modes of writing nonfiction prose. Extensive practice in composition, revision, and editing. Reading in the literature of the essay from the Renaissance to the present, with an emphasis on modern writers. Classes alternate between discussion of published readings and workshops on student work. Individual conferences.","level":"Undergraduate","prereqs":"21W.730, or excellent writing sample and permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 1","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"R. Faery"},{"type":"Class","id":"21W.736","course":"21W","label":"News Writing","shortLabel":"News Writing","units":"3-0-9","total-units":12,"description":"An introduction to the basics of print journalism, including an overview of journalistic ethics and life in the newsroom. Students learn basic reporting techniques, interviewing, and news writing, with an emphasis on accuracy, clarity, and brevity. Most writing done in class whereby students learn to write under time pressure, as well as in a distracting environment. Techniques of investigative reporting &#8212; including interviewing and research into public and private sources &#8212; are assigned on a weekly basis for outside classroom work.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"B. D. Colen"},{"type":"Class","id":"21W.739","course":"21W","label":"Darwin and Design","shortLabel":"Darwin and Design","units":"3-0-9","total-units":12,"description":"In <I>The Origin of Species</I>, Darwin provided a model for understanding the existence of objects and systems manifesting evidence of design without positing a designer, and of purpose and mechanism without intelligent agency. Texts deal with pre-Darwinian and later treatment of this topic within literature and speculative thought since the 18th century, with some attention to the modern study of feedback mechanism in artificial intelligence. Readings in Hume, Voltaire, Malthus, Darwin, Butler, Hardy, H. G. Wells, and Freud.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 2","joint":"21L.448J","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"A. Kibel, J. Paradis"},{"type":"Class","id":"21W.740","course":"21W","label":"Writing Autobiography and Biography","shortLabel":"Writing Autobiography and Biography","units":"3-0-9","total-units":12,"description":"Writing an autobiography is a vehicle for improving one's style while studying the nuances of the language. Literary works are read with an emphasis on different forms of autobiography. Students examine various stages of life, significant transitions, personal struggles, and memories translated into narrative prose, and discuss: what it means for autobiographer and biographer to develop a personal voice; and the problems of reality and fiction in autobiography and biography.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"K. Manning"},{"type":"Class","id":"21W.742","course":"21W","label":"Writing About Race","shortLabel":"Writing About Race","units":"3-0-9","total-units":12,"description":"The issue of race and racial identity have preoccupied many writers throughout the history of the US. Students read Toni Morrison, James Baldwin, Louise Erdrich, William Faulkner, Maxine Hong Kingston, Sandra Cisneros, and Judson Mitcham, and consider the story of race in its peculiarly American dimensions. The reading, along with the writing of members of the class, is the focus of class discussions. Oral presentations on subjects of individual interest are also part of the class activities. Students explore race and ethnicity in personal essays, pieces of cultural criticism or analysis, or (with permission of instructor) fiction. All written work is read and responded to in class workshops and subsequently revised. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 2","joint":"SP.575J","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.745","course":"21W","label":"Advanced Essay Workshop","shortLabel":"Advanced Essay Workshop","units":"3-0-9","total-units":12,"description":"For students with experience in writing essays and nonfiction prose. Focuses on negotiating and representing identities grounded in gender, race, class, nationality, and sexuality in prose that is expository, exploratory, investigative, persuasive, lyrical, or incantatory. Authors include James Baldwin, Minnie Bruce Pratt, Audre Lorde, Richard Rodriguez, Alice Walker, John Edgar Wideman, Diana Hume George, bell hooks, Margaret Atwood, Patricia J. Williams, and others. Designed to help students build upon their strengths as writers and to expand their repertoire of styles and approaches in essay writing.","level":"Undergraduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"R. Faery"},{"type":"Class","id":"21W.746","course":"21W","label":"Humanistic Perspectives on Medicine: From Ancient Greece to Modern America","shortLabel":"Humanistic Perspectives on Medicine: From Ancient Greece to Modern America","units":"3-0-9","total-units":12,"description":"For students with experience in nonfiction prose and interest in the non-science side of medicine. Advanced study of the art of essay (form, style, techniques of persuasion) and practice of that form. Students required to write substantial essays and revise their work. Students read and discuss the writings of distinguished physicians from antiquity to the late 20th century.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 5","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"W. Haas"},{"type":"Class","id":"21W.747","course":"21W","label":"Rhetoric","shortLabel":"Rhetoric","units":"3-0-9","total-units":12,"description":"For students with a special interest in learning how to make forceful arguments in written form. Studies the forms and structures of argumentation, including organization of ideas, awareness of audience, methods of persuasion, evidence, factual vs. emotional argument, figures of speech, and historical forms and uses of arguments.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 2","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"S. Strang, L. Perelman"},{"type":"Class","id":"21W.773","course":"21W","label":"Writing Longer Fiction","shortLabel":"Writing Longer Fiction","units":"3-0-9","total-units":12,"description":"Designed for students who have some experience in writing fiction and want to try longer forms like the novella and novel. Students interested in writing a novel are expected to produce at least two chapters and an outline of the complete work. Readings include several novels from Fitzgerald to the present, and novellas from Gogol's <I>The Overcoat</I> to current examples. Students discuss one another's writing in a roundtable workshop, with a strong emphasis on revision.","level":"Undergraduate","prereqs":"A fiction workshop or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"","equivalent":"","offering":"N","semester":['Fall'],"in-charge":"J. Haldeman"},{"type":"Class","id":"21W.774","course":"21W","label":"Invention and Ingenuity: Writing about Engineers and the Worlds They Make","shortLabel":"Invention and Ingenuity: Writing about Engineers and the Worlds They Make","units":"3-0-9","total-units":12,"description":"Introduction to science writing for general audiences, with a particular emphasis on engineers and their work.  Through structured writing assignments devoted to engineering as practiced today or in the past, students learn to tell nonfiction stories, explore the intellectual and creative puzzles engineers face, comment on engineering's social and cultural impact, and illuminate the human drama in engineering work. Students also read and critically discuss compelling examples of such writing in newspapers, magazines, and popular books. Maximum of 16 students.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"R. Kanigel"},{"type":"Class","id":"21W.775","course":"21W","label":"Writing about Nature and Environmental Issues","shortLabel":"Writing about Nature and Environmental Issues","units":"3-0-9","total-units":12,"description":"Focuses on traditional nature writing and the environmentalist essay. Students keep a web log as a journal. Writings are drawn from the tradition of nature writing and from contemporary forms of the environmentalist essay. Authors include Henry Thoreau, Loren Eiseley, Annie Dillard, Chet Raymo, Sue Hubbel, Rachel Carson, Bill McKibben, and Terry Tempest Williams.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS-D, Category 1","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"K. Boiko"},{"type":"Class","id":"21W.777","course":"21W","label":"The Science Essay","shortLabel":"The Science Essay","units":"3-0-9","total-units":12,"description":"Drawing in part from their own interests and ideas, students write about science within various cultural contexts. Students employ a broad repertoire of literary tools, such as narrative, scene-setting, and attention to larger issues of structure. Students study the work of science writers such as Alan Lightman, Oliver Sacks and Malcolm Gladwell to help them create essays of substance and grace that have science and technology as their subjects. Not a technical writing class.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"K. Boiko"},{"type":"Class","id":"21W.778","course":"21W","label":"Science Journalism","shortLabel":"Science Journalism","units":"3-0-9","total-units":12,"description":"An introduction to print daily journalism and news writing, focusing on science news writing in general, and medical writing in particular. Emphasis is on writing clearly and accurately under deadline pressure. Class discussions involve the realities of modern journalism, how newsrooms function, and the science news coverage in daily publications. Discussions of, and practice in, interviewing and various modes of reporting. In class, students write numerous science news stories on deadline. There are additional longer writing assignments outside of class. Enrollment limited.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"T. Levenson"},{"type":"Class","id":"21W.781","course":"21W","label":"Communicating About Technology:  Colossal Failures in Engineering","shortLabel":"Communicating About Technology:  Colossal Failures in Engineering","units":"3-0-9","total-units":12,"description":"Explores communication about technological subjects in the context of colossal engineering failures including Three Mile Island, Bhopal, the Columbia Shuttle, 9/11, and Katrina. Examines the basic engineering principles and the social context of several such failures in case studies from various engineering disciplines. Students see how problematic communications, sometimes subtly unrecognizable at the time, significantly contributed to the final failures. Students collaborate to produce a final written and oral research report that anticipates a potential failure and makes recommendations for avoiding it. Multiple sections, each limited to 18 students.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"1.588J, 3.070J, 22.002J, ESD.032J","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"T. Eagar, W. Haas, A. Kadak, P. Lagace, O. Buyukozturk"},{"type":"Class","id":"21W.782","course":"21W","label":"Principles and Practice of Science Communication","shortLabel":"Principles and Practice of Science Communication","units":"3-0-9","total-units":12,"description":"Develop skills as science communicators through projects and analysis of theoretical principles. Case studies explore the emergence of popular science communication over the past two centuries and the changing relationships among authors, audiences and media. Project topics are identified early in the term, and feature opportunities to work with the MIT Museum staff or participate in a city wide Cambridge Science Festival. Projects may involve physical exhibits, practical demonstrations, or scripts for public programs.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"HASS Elective","joint":"STS.014J","equivalent":"","offering":"N","semester":['Spring'],"in-charge":"J. Durant"},{"type":"Class","id":"21W.825","course":"21W","label":"Advanced Science Writing Seminar I","shortLabel":"Advanced Science Writing Seminar I","units":"6-0-18","total-units":24,"description":"First term of year-long graduate sequence in science writing offers students intensive workshops and critiques of their own writing, and that of published books, articles, and essays; discussions of ethical and professional issues; study of science and scientists in historical and social context; analysis of recent events in science and technology. Emphasis throughout on developing skills and habits of mind that enable the science writer to tackle scientifically formidable material and write about it for ordinary readers. Topics include the tools of research, conceived in its broadest sense- including interviewing, websites, archives, scientific journal articles; science journalism, including culture of the newsroom and magazine-style journalism; science essays. Considerable attention to science writing's audiences, markets, and publics and the special requirements of each.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall'],"in-charge":"R. Kanigel, M. Bartusiak, T. Levenson"},{"type":"Class","id":"21W.826","course":"21W","label":"Advanced Science Writing Seminar II","shortLabel":"Advanced Science Writing Seminar II","units":"6-0-18","total-units":24,"description":"Continuation of topics introduced in 21W.825, including research, science journalism, and essays; social and historical context of science and technology; workshops and critiques of student writing. Special emphasis on literary and imaginative science writing that employs traditionally fictional devices in nonfiction, including scene-setting and storytelling; exploration of the boundaries between nonfiction and fiction; relationships between word and image. Extension of science writing principles to non-print domains, such as websites, radio, television, museum exhibits, and multimedia.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Spring'],"in-charge":"R. Kanigel, T. Levenson, M. Bartusiak"},{"type":"Class","id":"21W.892","course":"21W","label":"Science Writing Internship","shortLabel":"Science Writing Internship","units":"0-12-0","total-units":12,"description":"Field placements tailored to the individual backgrounds of the students enrolled, involving varying degrees of faculty participation and supervision.","level":"High Graduate","prereqs":"Permission of instructor","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Summer'],"in-charge":"R. Kanigel"},{"type":"Class","id":"21W.898","course":"21W","label":"Special Graduate Elective in Science Writing","shortLabel":"Special Graduate Elective in Science Writing","units":"0-0-0","total-units":0,"description":"Elective choices and sequences arranged by staff to complement the enrolled students' program of research and study.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"R. Kanigel"},{"type":"Class","id":"21W.899","course":"21W","label":"Special Graduate Elective in Science Writing","shortLabel":"Special Graduate Elective in Science Writing","units":"0-0-0","total-units":0,"description":"Elective choices and sequences arranged by staff to complement the enrolled students' program of research and study.","level":"High Graduate","prereqs":"Permission of instructor","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"R. Kanigel"},{"type":"Class","id":"21W.NIV","course":"21W","label":"Visiting Student Research","shortLabel":"Visiting Student Research","units":"0-0-0","total-units":0,"description":"","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":""},{"type":"Class","id":"21W.THG","course":"21W","label":"Graduate Thesis","shortLabel":"Graduate Thesis","units":"6-0-18","total-units":24,"description":"Research and writing of thesis in consultation with faculty, including individual meetings and group seminars, undertaken over the course of one year.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"R. Kanigel"},{"type":"Class","id":"21W.THT","course":"21W","label":"Writing and Humanistic Studies Pre-Thesis Tutorial","shortLabel":"Writing and Humanistic Studies Pre-Thesis Tutorial","units":"1-0-5","total-units":6,"description":"Definition of and early stage work on a thesis project leading to 21W.ThU. Taken during the first term of a student's two-term commitment to the thesis project. Student works closely with an individual faculty tutor. Required of all students pursuing a full major in Course XXIW. Joint majors register for 21.ThT.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.THU","course":"21W","label":"Writing and Humanistic Studies Thesis","shortLabel":"Writing and Humanistic Studies Thesis","units":"0-0-0","total-units":0,"description":"Completion of work on the senior major thesis under the supervision of a faculty tutor. Includes oral presentation of the thesis progress early in the term, assembling and revising the final text, and a final meeting with a committee of faculty evaluators to discuss the successes and limitations of the project. Required of students pursuing a full major in Course XXIW. Joint majors register for 21.ThU.","level":"Undergraduate","prereqs":"21W.ThT","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"Communication Intensive Major","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"Staff"},{"type":"Class","id":"21W.UR","course":"21W","label":"Research in Writing and Humanistic Studies","shortLabel":"Research in Writing and Humanistic Studies","units":"0-0-0","total-units":0,"description":"","level":"Undergraduate","prereqs":"","grading":"P/D/F","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"J. Paradis"},{"type":"Class","id":"21W.URG","course":"21W","label":"Research in Writing and Humanistic Studies","shortLabel":"Research in Writing and Humanistic Studies","units":"0-0-0","total-units":0,"description":"Individual participation in an ongoing research project. For students in the Undergraduate Research Opportunities Program.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'Spring'],"in-charge":"J. Paradis"},{"type":"Class","id":"21W.URN","course":"21W","label":"Undergraduate Research","shortLabel":"Undergraduate Research","units":"0-1-0","total-units":1,"description":"","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","offering":"Y","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":""}]}