{
    "items": [
        {
            "type":        "Class",
            "label":       "11.301J - Introduction to Urban Design and Development",
            "id":          "11.301J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines both the structure of cities and ways they can be changed. Includes historical forces that have produced cities, models of urban analysis, contemporary theories of urban design, implementation strategies. Core lectures supplemented by discussion sessions focusing on student work and field trips.  Guest speakers present cases involving current projects illustrating the scope and methods of urban design practice.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.301J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "prereq":      "4.252J",
            "in-charge":   "Frenchman, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.302J - Urban Design Politics",
            "id":          "11.302J",
            "level":       "Grad",
            "units":       "3-0-6",
            "total-units": 9,
            "has-final":   false,
            "description": "Examines ways urban design contributes to distribution of political power and resources in cities. Investigates the nature of relations between built form and political purposes through close study of a wide variety of situations where public sector design commissions and planning processes have been clearly motivated by political pressures. Lectures and discussions focus on specific case studies of twentieth-century government-sponsored designs carried out under diverse regimes in the US, Europe, and elsewhere.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.302J",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.253J",
            "in-charge":   "Vale, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.303J - Real Estate Development II",
            "id":          "11.303J",
            "level":       "Grad",
            "units":       "6-0-9",
            "total-units": 15,
            "has-final":   false,
            "description": "Focuses on the process of programming projects for the real estate development industry including the integration of finance and marketing with physical planning and design.  Contemporary product prototypes for residential and commercial projects provide a foundation for two studio projects in which interdisciplinary student teams prepare professional development proposals.  Projects are interspersed with lectures, field trips, and short sketch exercises. Capstone subject integrating skills and knowledge in the MSRED program, also open to other students interested in real estate development.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.303J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.254J",
            "in-charge":   [
                "Frenchman, D.",
                "Roth, P."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.303J-1",
            "lecture-section-of": "11.303J",
            "timeAndPlace":       [
                "MW 14:30-17:30 10-485"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.304J - Site and Urban Systems Planning",
            "id":          "11.304J",
            "level":       "Grad",
            "units":       "2-2-8",
            "total-units": 12,
            "has-final":   false,
            "description": "Land inventory, analysis and the planning of sites and the infrastructure systems which serve them.  Spatial organization of uses, parcalization, design of roadways, grading, utility systems, stormwater runoff, parking, traffic and off-site impacts, landscaping.  Lectures on analytical techniques and examples of good site-planning practice.  Assignments and a client based project.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.304J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      "4.255J",
            "in-charge":   "Ben-Joseph, E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.304J-1",
            "lecture-section-of": "11.304J",
            "timeAndPlace":       [
                "MW 12:30-14:00 10-485"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.305 - Landscape Ecology and Urban Development",
            "id":          "11.305",
            "level":       "Grad",
            "units":       "3-0-9 [P/D/F]",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Presents a framework for current landscape ecological theory, structured to encourage application in physical planning of landscapes. Case studies link theory to practice, and include both urban and rural landscapes. Science and planning are examined as social practices which rely on situated knowledge. Past and present methods of ecological planning are reviewed and critiqued in a student project. Major topics include biodiversity, cyclical processes, assessment of landscape structures, and design for sustainability.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.305",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.306 - Planning Studio",
            "id":          "11.306",
            "level":       "Grad",
            "units":       "6-0-12",
            "total-units": 18,
            "has-final":   false,
            "description": "Provides experience in tackling city and regional planning problems in real world settings. Students work with local clients to define issues and synthesize approaches to change that enhances performance of the environment and improves the quality of life for users and residents. The focus of the studio changes each year; past problems have involved community development in  downtown Santiago, Chile, and sustainable residential development in Shanghai.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.306",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.306-1",
            "lecture-section-of": "11.306",
            "timeAndPlace":       [
                "TR 14:00-17:00 4-144"
            ]
        },
        {
            "type":           "LabSection",
            "label":          "s11.306-2",
            "lab-section-of": "11.306",
            "timeAndPlace":   [
                "TR 14:00-17:00 3-405"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.307 - Beijing Urban Design Studio",
            "id":          "11.307",
            "level":       "Grad",
            "units":       "0-18-0",
            "total-units": 18,
            "has-final":   false,
            "description": "A design and development studio involving architects and planners working in teams on a contemporary design project of importance in Beijing, China. Students analyze conditions, explore alternatives, and synthesize architectural, city design and implementation plans. Supplemented by lectures and brief study tours that expose students to history and contemporary issues of urbanism in China. Enrollment limited.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.307",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   [
                "Frenchman, D.",
                "Wampler, J.",
                "Chang, Y."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.308J - Advanced Seminar: Urban Nature and City Design",
            "id":          "11.308J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the urban environment as a natural phenomenon, human habitat, medium of expression, and forum for action. Subject has two related, major themes: how ideas of nature influence the way cities are perceived, designed, built, and managed; and how natural processes and urban form interact and the consequences of these for human health safety and welfare. Enrollment limited.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.308J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.213J",
            "in-charge":   "Spirn, A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.309J - Sites in Sight: Photographing the Urban Landscape",
            "id":          "11.309J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores photography as a disciplined way of seeing, or investigating urban landscapes and expressing ideas. Readings, observations, and photographs form the basis of discussions on light, detail, place, poetics, narrative, and how photography can inform design and planning. Enrollment limited.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.309J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "prereq":      "4.215J",
            "in-charge":   "Spirn, A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.310J - Media Technology and City Design and Development",
            "id":          "11.310J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores the potential of media technology and the Internet to enhance communication and transform city design and community development in inner-city neighborhoods. Introduces a variety of methods for describing or representing a place and its residents, for simulating actions and changes, for presenting visions of the future, and for engaging multiple actors in the process of envisioning change and guiding action. Working with local clients, students learn tools like digital storytelling to build media rich representations of urban environments.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.310J",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "prereq":      "4.243J",
            "in-charge":   [
                "Spirn, A.",
                "McDowell, C."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.311J - Ideal Forms of Contemporary Urbanism",
            "id":          "11.311J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Advanced seminar about an architectural approach to the problems of disurbanization. Focuses on texts and projects of a particular lineage of architects and planners, who are pursuing 'metropolitan urbanity' through a series of concrete, discrete, tangible interventions from 1944 to 1999. Studies the organization of flows and the articulation of public spaces within various projects seeking a definition of \"urbanity\" using analytical diagrams. Relates this architectural definition to more theoretical definitions in philosophy and anthropology.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.311J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "4.262J",
                "4.645",
                "4.241J",
                "11.330J"
            ],
            "in-charge":   "D'Hooghe, A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.328J - Urban Design Skills: Observing, Interpreting, and Representing the City",
            "id":          "11.328J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Introduction to the methods of recording, evaluating, and communicating about the urban environment. Through visual observation, field analysis, measurements, interviews, and other means, students learn to draw on their senses and develop their ability to deduce, conclude, question, and test conclusions about how the environment is used and valued. Through the use of representational tools such as drawing, photographing, computer modeling and desktop publishing, students communicate what is observed as well as their impressions and design ideas. Intended as a foundation for future studio work in urban design.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.328J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "prereq":      "4.240J",
            "in-charge":   "Ben-Joseph, E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.329 - Social Theory and the City",
            "id":          "11.329",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores how social theories of urban life can be related to the city's architecture and spaces. Classic or foundational writings about the city, addressing such topics as the public realm and public space; impersonality; crowds and density; surveillance and civility: imprinting time on space; spatial justice; and the segregation of difference. Aims to generate new ideas about the city by connecting the social and the physical, using Boston as a visual laboratory. Requires term paper mediating  what is read with what has been observed.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.329",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Sennett, R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.330J - Theory of City Form",
            "id":          "11.330J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Theories about the form that settlements should take. Attempts a distinction between descriptive and normative theory by examining examples of various theories of city form over time. Concentrates on the origins of the modern city and theories about its emerging form, including the transformation of the 19th century city and its organization. Analyzes current issues of city form in relation to city-making, social structure, and physical design.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.330J",
            "semester":    "Spring",
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "4.241J",
                "11.001J",
                "4.252J",
                "11.301J"
            ],
            "in-charge":   "Beinart, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.330J-1",
            "lecture-section-of": "11.330J",
            "timeAndPlace":       [
                "TR 12:30-14:00 3-133"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.331J - Advanced Seminar in City Form",
            "id":          "11.331J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Examines in greater depth themes from the basic subject in city form theory. Introduces new concepts from current research and practice for analysis by the seminar participants. Requirements include presentation to the seminar of a theoretical project undertaken by each student.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.331J",
            "semester":    "Fall",
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "4.242J",
                "4.241J",
                "11.330J"
            ],
            "in-charge":   "Beinart, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.332J - Urban Design Studio",
            "id":          "11.332J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "The design of urban environments. Strategies for change in large areas of cities, to be developed over time, involving different actors. Fitting forms into natural, man-made, historical, and cultural contexts; enabling desirable activity patterns; conceptualizing built form; providing infrastructure and service systems; guiding the sensory character of development. Involves architecture and planning students in joint work; requires individual designs or design and planning guidelines.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.332J",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.163J",
            "in-charge":   [
                "Beinart, J.",
                "Monchaux, J. P. de",
                "Dennis, M.",
                "D'Hooghe, A."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.333J - Urban Design Seminar",
            "id":          "11.333J",
            "level":       "Grad",
            "units":       "2-0-7",
            "total-units": 9,
            "has-final":   false,
            "description": "Core lectures and student research focus on defining the future forms and function of the city and directions in urban design. Examines case studies of cutting edge urban design themes and projects, and explores how such efforts may be evaluated. Invited urban design practitioners critique student work on individual topics. Required for Urban Design certificate students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.333J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      "4.244J",
            "in-charge":   [
                "Frenchman, D.",
                "Silberberg, S."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.333J-1",
            "lecture-section-of": "11.333J",
            "timeAndPlace":       [
                "W 9:00-11:00 10-485"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.335J - Cities of Tomorrow",
            "id":          "11.335J",
            "level":       "Grad",
            "units":       "3-0-6",
            "total-units": 9,
            "has-final":   false,
            "description": "Research seminar on the future of urban design, to focus on developing a realistic projection of the organization, function, and form of cities, based on an analysis of contemporary trends. Review of historical efforts in the tradition of predicting urban change. Analysis of contemporary urban design projects and proposals. Supplemented by readings and speakers in parallel fields likely to have impact on urban form, including information processing, communications, entertainment.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.335J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.245J",
            "in-charge":   "Frenchman, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.337J - Urban Design Policy and Action",
            "id":          "11.337J",
            "level":       "Grad",
            "units":       "2-0-7",
            "total-units": 9,
            "has-final":   false,
            "description": "Seminar on ways that governments influence the quality of urban design. Focuses on the success and failure of methods for achieving urban design objectives through various public policy mechanisms: incentives, standards and regulations, owning and operating, creation and enforcement of legal rights, and information-based strategies.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.337J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "4.247J",
                "11.301J"
            ],
            "in-charge":   "Schuster, J. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.337J-1",
            "lecture-section-of": "11.337J",
            "timeAndPlace":       [
                "M 10:00-12:00 3-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.339 - Downtown",
            "id":          "11.339",
            "level":       "Grad",
            "units":       "2-0-7",
            "total-units": 9,
            "has-final":   false,
            "description": "Seminar on downtown in US cities from the late 19th century to the late 20th. Emphasis on downtown as an idea, place, and cluster of interests, on the changing character of downtown, and on recent efforts to rebuild it. Considers subways, skyscrapers, highways, urban renewal, and retail centers. Focus on readings, discussions, and individual research projects. Meets with graduate subject 11.339, but assignments differ.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.339",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      [
                "11.026J",
                "21H.234J"
            ],
            "in-charge":   "Fogelson, R. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.339-1",
            "lecture-section-of": "11.339",
            "timeAndPlace":       [
                "R 14:00-16:00 3-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.340J - Legal Issues in the Development Process",
            "id":          "11.340J",
            "level":       "Grad",
            "units":       "3-0-3",
            "total-units": 6,
            "has-final":   false,
            "description": "Reviews the legal issues that arise in the course of acquiring, managing, and developing real estate. Topics covered include purchase and sale agreements, organization of the ownership entity, financing, contracting, federal income taxation of real estate, fiduciary relationships, leasing, and workouts.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.340J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "15.658J",
            "in-charge":   "Fisher, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.340J-1",
            "lecture-section-of": "11.340J",
            "timeAndPlace":       [
                "MW 8:30-10:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.341J - International Construction Finance",
            "id":          "11.341J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Examination of financing methods and structure, project financial evaluation, and financial management in the domestic and international construction industry. Analytical concepts and methodologies from modern finance theory and practice presented in lecture/discussions and applied to case analyses including problems in cash-flow analysis, corporate financial structure, project finance, and foreign exchange exposure. Innovative financial securities, such as options, and methods such as privatization and sale-leaseback are examined. Prior subjects in microeconomics, accounting, and/or corporate finance desirable but not required.  Half-term subject offered in the second half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.341J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.45J",
            "in-charge":   "Samii, M. V.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.341J-1",
            "lecture-section-of": "11.341J",
            "timeAndPlace":       [
                "T 9:00-12:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.342J - The Impact of Globalization on the Built Environment",
            "id":          "11.342J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Explores the challenges and risks managers of construction, engineering, and architecture companies face in entering global markets. Includes discussion of innovative approaches to marketing, partnering, risk management, finance, specialized delivery systems, privatization, and appropriate strategies for entering international markets. Half-term subject offered in first half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.342J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.463J",
            "in-charge":   "Wolff, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.343J - E-Commerce and the Internet in Real Estate and Construction",
            "id":          "11.343J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Examines long-term effects of information technology on business strategy in the real estate and construction industry. Considerations include: supply chain, allocation of risk, impact on contract obligations and security, trends toward consolidation, and the convergence of information transparency and personal effectiveness. Resources drawn from the world of dot-com entrepreneurship and \"old economy\" responses. Taught by case study method. Half-term subject offered in the first half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.343J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.464J",
            "in-charge":   "Macomber, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.344J - Innovative Project Delivery in the Public and Private Sectors",
            "id":          "11.344J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Examines the compatibility of various project delivery methods, consisting of organizations, contracts, and award methods, with certain types of projects and owners. Six methods examined: traditional general contracting; construction management; multiple primes; design-build; turnkey; and build-operate-transfer. Consists of lectures, case studies, guest speakers, and a team project to analyze a case example. Half-term subject offered in second half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.344J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.472J",
            "in-charge":   "Gordon, C. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.344J-1",
            "lecture-section-of": "11.344J",
            "timeAndPlace":       [
                "TR 16:00-17:30 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.345J - Entrepreneurship in Construction and Real Estate Development",
            "id":          "11.345J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Explains role of the entrepreneur in the construction industry using case studies to outline different steps in developing construction enterprises. Emphasis on strategic marketing component in the development of these businesses. Lectures address program, development, and construction management services. Guest lectures from entrepreneurs in their field. Team project identifying an opportunity and developing a strategic marketing/business plan for a company in the design/construct or related industries.  Half-term subject offered in second half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.345J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.462J",
            "in-charge":   "Kennedy, J. F.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.346 - Housing Markets",
            "id":          "11.346",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Explores basics of housing economics, including issues of affordability. Hedonic modeling introduced.  Focuses on helping students develop a research topic in this area.  Students write a term paper on a housing topic of their choice. Half-term subject offered in first half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.346",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Fisher, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.346-1",
            "lecture-section-of": "11.346",
            "timeAndPlace":       [
                "W 12:00-14:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.347 - Topics in Housing Finance",
            "id":          "11.347",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Focuses on housing finance in the private sector.  Designed for students familiar with basic financial concepts. Topics include the optimality of mortgage terms and covenants, the history and economics of the U.S. housing finance system and current products designed for affordable housing development.  Students write a term paper on a housing finance topic of their choice. Half-term subject offered in second half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.347",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "in-charge":   "Fisher, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.348J - Strategic Leadership in Real Estate and Construction",
            "id":          "11.348J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Examines the fundamental concepts of strategic planning and management in the context of the real estate, design, and construction industry. Basic business relationships among firms in the design and construction value chain. Topics include industry analysis, strategic planning models, information technology strategy, strategy in fragmented industries, negotiation, and macro trends shaping the industry as a whole. Case method of instruction is used, and supplemented by extensive readings. Half term subject taught in the first half of the term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.348J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.46J",
            "in-charge":   "Macomber, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.348J-1",
            "lecture-section-of": "11.348J",
            "timeAndPlace":       [
                "T 9:00-11:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.349J - Real Estate Development I",
            "id":          "11.349J",
            "level":       "Grad",
            "units":       "6-6-15",
            "total-units": 27,
            "has-final":   false,
            "description": "Two-term subject delivers the information, skills, and techniques necessary to create the physical products of real estate and manage the process of real estate development. Exposes students to the general skills, techniques and process associated with each of the functional areas involved in real estate development so that they may organize and lead the development process. Assesses the fundamental characteristics of the RED industry, its products, contracts, regulatory and legal context and its markets. Students work in teams to create a development proposal for a particular development opportunity. Enrollment in both terms is mandatory. Enrollment limited; priortiy given to MSRED students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.349J",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    "Currently Offered",
            "prereq":      "4.246J",
            "in-charge":   [
                "Ciochetti, T.",
                "Fisher, L."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.360 - Community Growth and Land Use Planning",
            "id":          "11.360",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Seminar and fieldwork on strategies of planning and control for growth and land use, chiefly at the municipal level. Growth and its local consequences; land use planning approaches; implementation tools including innovative zoning and regulatory techniques, physical design, and natural systems integration. Projects arranged with small teams serving municipal clients.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.360",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   [
                "Szold, T. S.",
                "Ben-Joseph, E."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.362 - Environmental Management Practicum",
            "id":          "11.362",
            "level":       "Grad",
            "units":       "3-6-3",
            "total-units": 12,
            "has-final":   false,
            "description": "An external, client-focused subject that addresses real environmental restoration projects. Students deal with pragmatic aspects of environmental planning with a particular emphasis on brownfield redevelopment. Stresses both the use of environmental planning tools in real-time learning, how to interface with regulatory agencies, NGOs and the private sector. A multidisciplinary review board is present to periodically review team progress and comment on the professional side of planning practice. The final deliverable is presented to the client for review and comment.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.362",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.370",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.363 - Civil Society and the Environment",
            "id":          "11.363",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the roles civil society actors play in national and international environmental policy and politics. Considers theories pertaining to the development and import of civil society, social movement development and mobilization, and collaboration between state and non-state actors. Case studies of civil society response to specific environmental issues illustrate theoretical issues and assess the impacts that these actors have on domestic, foreign, and international policy and planning outcomes.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.363",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Carmin, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.363-1",
            "lecture-section-of": "11.363",
            "timeAndPlace":       [
                "T 14:00-17:00 5-231"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.364 - International Environmental Negotiation",
            "id":          "11.364",
            "level":       "Grad",
            "units":       "3-0-6",
            "total-units": 9,
            "has-final":   false,
            "description": "Fourth subject in the Environmental Policy and Planning sequence. Seminar looks at problems of managing common resources, difficulties of achieving transboundary pollution control, and the dilemmas of regional harmonization of environmental protection standards (particularly in Europe). At the core of these problems are issues of how best to structure international negotiations. Focuses especially on problems of representation voting, linkage, and enforcement.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.364",
            "semester":    "Fall",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.601",
                "11.362",
                "11.255"
            ],
            "in-charge":   "Susskind, L. E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.365 - Disaster, Vulnerability, and Resilience",
            "id":          "11.365",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores vulnerabilities to natural and technological disasters and ways to promote resilience. Designed both for people interested in the societal dimensions of disaster from a research or policy perspective and for those who may be charged with responsibility for on-the-scene intervention. Topics addressed include social, technological, and environmental vulnerabilities; disaster institutions, agencies and policies; normative and operational issues in preparation, warning, and response; individual and group decision-making under stress.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.365",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Carmin, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.366J - Planning, Participation and Consensus Building for Sustainable Development",
            "id":          "11.366J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the political economy of development planning and implementation, with a focus on developing countries in Asia, Africa and Latin America.  Assesses the concept of sustainable development and its application in planning processes.  Asks when and how stakeholder participation, negotiation and consensus building help or hinder attempts to promote sustainability.  Emphasis on integration of theory and practice, using local, sectoral, national and global cases.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.366J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.817J",
            "in-charge":   "Fairman, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.367 - The Law and Politics of Land Use",
            "id":          "11.367",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   true,
            "description": "Analysis of local and state power to regulate land use and development. Particular emphasis on the evolution of planning and zoning regulations, and the perceived narrowing of the relationship between public improvements requirements and development impact. The ability of regulatory bodies to impose environmental performance standards and limit development activity is explored in relation to recent Supreme Court and State SJC decisions. Development decisions rendered by public agencies are reviewed, critiqued, and discussed.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.367",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Stearns, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.367-1",
            "lecture-section-of": "11.367",
            "timeAndPlace":       [
                "TR 14:30-16:00 10-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.368 - Environmental Justice",
            "id":          "11.368",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores the foundations of the environmental justice movement, current and emerging issues, and the application of environmental justice analysis to environmental policy and planning. Examines claims made by diverse groups along with the policy and civil society responses that address perceived inequity and injustice. International issues and perspectives also considered.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.368",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Carmin, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.369J - Energy Policy for a Sustainable Future",
            "id":          "11.369J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on a wide range of current energy and energy-related environmental policies that foster the development and mass deployment of sustainable energy technologies, fuels, and practices. Primary focus is US-based policies at the state, regional and federal level that impact the electricity, transportation and buildings and facilities sectors. Detailed case studies, diverse readings, and guest lectures by prominent policy makers and practitioners.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.369J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "17.398J",
            "in-charge":   "Raab, J. D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.369J-1",
            "lecture-section-of": "11.369J",
            "timeAndPlace":       [
                "MW 9:00-10:30 4-153"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.370 - Brownfields Policy and Practice",
            "id":          "11.370",
            "level":       "Grad",
            "units":       "4-0-8",
            "total-units": 12,
            "has-final":   false,
            "description": "There are several hundred thousand brownfield sites across the country. The large number of sites, combined with the fact that a majority of these properties are located in urban and historically underserved communities, dictate that redevelopment of these sites stands to be a common challenge to urban planners for the foreseeable future. Students develop a grounded understanding of the brownfield lifecycle: how and why they were created, their potential role in community revitalization, the role of community-based organizations in spurring their redevelopment, and the general processes governing their redevelopment. Using case studies, field projects, and guest speakers from the public, private and non-profit sectors, students develop and hone skills to effectively address the problems posed by these inactive sites.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.370",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.601",
            "in-charge":   "Hamilton, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.371J - Sustainable Energy",
            "id":          "11.371J",
            "level":       "Grad",
            "units":       "3-1-8",
            "total-units": 12,
            "has-final":   false,
            "description": "Assessment of current and potential energy systems, covering extraction, conversion and end-use, with emphasis on meeting regional and global energy needs in the 21st century in a sustainable manner. Examination of energy technologies in each fuel cycle stage for fossil (oil, gas, synthetic), nuclear (fission and fusion) and renewable (solar, biomass, wind, hydro, and geothermal) energy types, along with storage, transmission, and conservation issues. Focus on evaluation and analysis of energy technology systems in the context of political, social, economic, and environmental goals. Open to upper-class undergraduates.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.371J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.818J",
                "2.65J",
                "10.391J",
                "22.811J",
                "ESD.166J"
            ],
            "in-charge":   [
                "Golay, M. W.",
                "Tester, J. W.",
                "Freidberg, J. P."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.371J-1",
            "lecture-section-of": "11.371J",
            "timeAndPlace":       [
                "TR 15:00-17:00 56-114"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.372 - Environmental Planning Methods Modules",
            "id":          "11.372",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Five methods modules are offered covering a range of analytical tools and techniques used by practicing planners. Modules cover environmental impact assessment techniques, Brownfields assessment techniques, environmental and health risk assessment techniques, cost-benefit analysis techniques, and legal analysis litigation strategies. Modules are typically four weeks long.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.372",
            "semester":    [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":    "Currently Offered",
            "prereq":      "11.601",
            "in-charge":   "Staff, EPP",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.373 - Science, Politics and Environmental Policy",
            "id":          "11.373",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the role of science in the US environmental policy making process.  Investigates the methods by which scientists learn about the natural world; the treatment of science by experts, advocates, the media, and the public; and the way science is used in legislative, administrative and judicial decision making.  Concludes by taking up novel approaches to integrating science into politics, such as employing stakeholder collaboration, local knowledge, adaptive management, and the precautionary principle.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.373",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Layzer, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.374 - The Politics of Ecosystem Management",
            "id":          "11.374",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Investigates efforts to restore and maintain the health of ecosystems, including forest, watershed, and marine ecosystems.  Traces the evolution of the ecosystem-based approach and examines how it has been implemented during the past two decades.  Concludes by looking at prominent experiments in ecosystem-based management to see whether and how such initiatives provide genuine environmental protection.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.374",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Layzer, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.375 - Role of Science and Scientists in Collaborative Approaches to Environmental Policymaking",
            "id":          "11.375",
            "level":       "Grad",
            "units":       "2-0-7",
            "total-units": 9,
            "has-final":   false,
            "description": "Explores the evolving role of scientists and research in contemporary society.  Examines joint fact finding within the context of adaptive management and ecosystem-based management.  Challenges and obstacles to collaborative approaches for deciding environmental policy and natural resource policy and the institutional changes necessary within federal agencies to bridge the gap between science, policy, and management to achieve more durable policies and effective management decisions are discussed and reviewed with scientists, policymakers, and managers.  Senior-level federal policymakers participate.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.375",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      [
                "11.601",
                "11.373"
            ],
            "in-charge":   "Karl, H.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.375-1",
            "lecture-section-of": "11.375",
            "timeAndPlace":       [
                "R 14:00-17:00 24-112"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.401 - Introduction to Housing and Community Development",
            "id":          "11.401",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores how public policy and private markets affect housing, economic development, and the local economy; provides an overview of techniques and specified programs policies and strategies that are (and have been) directed at neighborhood development; gives students an opportunity to reflect on their personal sense of the housing and community development process; emphasizes the institutional context within which public and private actions are undertaken.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.401",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Thompson, J. P.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.402 - Urban Politics: Race and Political Change",
            "id":          "11.402",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the place of US cities in political theory and practice. Particular attention given to contemporary issues of racial polarization, demographic change, poverty, sprawl, and globalization. Specific cities, such as New York and Los Angleles are a focus for discussion.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.402",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Thompson, J. P.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.403 - Springfield Community Studio",
            "id":          "11.403",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "A practicum subject that focuses on the physical, programmatic, and social renewal of the North End community in Springfield, MA by combining classroom work with an applied class project. Builds on a long-term commitment to partnership with the North End, a predominantly Puerto Rican community with strong social networks, a high level of community involvement, and all the attendant issues of urban poverty. Each year the practicum works on a specific issue identified by the community. Past topics have included economic planning, land use planning, and environmental mapping.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.403",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   [
                "McDowell, C.",
                "Staff"
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.403-1",
            "lecture-section-of": "11.403",
            "timeAndPlace":       [
                "F 9:00-12:30 9-338"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.410J - Cities and Regions: Urban Economics and Public Policy",
            "id":          "11.410J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   true,
            "description": "The theory of urban land and housing markets, and the spatial development of cities. The roles played by transportation systems and local governments in shaping urban location patterns. Interregional competition, economic development, and the migration of labor and capital.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.410J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.283J",
                "14.573J",
                "ESD.191J",
                "14.03",
                "14.04"
            ],
            "in-charge":   "Wheaton, W.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.410J-1",
            "lecture-section-of": "11.410J",
            "timeAndPlace":       [
                "TR 14:30-16:00 E51-063"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.414J - Labor and Politics",
            "id":          "11.414J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines issues facing labor in today's global world through research and reading. Recent developments (globalization, liberalization, privatization) have created a mix of opportunities and risks for labor in most developing countries. On the one hand, these trends have encouraged foreign direct investment and the diffusion of global supply chains, which in turn, have promoted economic development and job growth for some groups of workers in some of these countries. On the other hand, globalization and liberalization have undermined social safety nets, eroded labor and environmental standards, and resulted in greater rates of poverty for other groups of workers in other developing countries. How do we explain these differences? What kinds of policies can be promoted to more evenly distribute the benefits of globalization? Subject seeks to address these two questions.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.414J",
            "semester":    "Fall",
            "offering":    "Not offered this year",
            "prereq":      "17.188J",
            "in-charge":   "Locke, R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.422 - Downtown Management Organizations",
            "id":          "11.422",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on the origins, functions, and implications of downtown management organizations (DMOs) such as business improvement districts in a variety of national contexts including the US, Canada, South Africa, and the UK. Critically examines how a range of urban theories provide a rationale for the establishment and design of DMOs; the evolution and transnational transfer of DMO policy; and the spatial and political externalities associated with the local proliferation of DMOs. Particular emphasis given to the role of DMOs in securing public space.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.422",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Hoyt, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.422-1",
            "lecture-section-of": "11.422",
            "timeAndPlace":       [
                "M 12:30-15:30 3-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.423 - Information, Asset-building, and the Immigrant City",
            "id":          "11.423",
            "level":       "Grad",
            "units":       "4-6-2",
            "total-units": 12,
            "has-final":   false,
            "description": "Practicum follows a participatory action research model whereby students work hand-in-hand with not-for-profit housing developers and municipal planners in the city of Lawrence, MA to craft a strategic affordable housing plan. Known as the ?Immigrant City?, Lawrence is part of a multiyear HUD-funded community outreach program intended to empower Latina women and youth by building individual and community assets through the use of spatial and other information technologies. Emphasizes reflection as a tool for investigating the nexus between planning practice and theory as well as issues of race/ethnicity, civic engagement, and the construction of urban narratives.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.423",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   [
                "Hoyt, L.",
                "Keyes, L."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.424 - Democracy, Inequality, and the City",
            "id":          "11.424",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Cities and the urban experience serve as a format to rethink democracy and the urban challenges of equity and social justice. Explores citizenship, the public sphere, avenues for democratic participation, struggles for social and political justice and how they inform life in cities. Readings include classic theoretical and historical works; Harvey, Lefebvre, de Tocqueville, Castells, Sennett, Tilly, Bellah, Katznelson, Ryan plus empirical studies of social and spatial patterns of injustice in cities here and abroad. Assignments and discussion build on normative aims of empowering citizens and state actors (from planners to politicians) to make cities more just, equitable, and democratic.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.424",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Davis, D. E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.425 - Urban Labor Markets",
            "id":          "11.425",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on the recent evolution of central city labor markets. Topics include the changing occupational structure of central cities; the occupation/population skills mismatch; education, wages, and urban schooling; the spatial mismatch and mobility strategies; the position of minority groups in central city labor markets; the interaction between welfare programs and labor markets; the potential role of job training.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.425",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      "11.203",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.426 - Cities and Globalization",
            "id":          "11.426",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Cities examined in the context of globalization. Subject examines changing nature and character of cities as produced by increased transnational migration flows, accelerated international trade, diminished institutional capacities of states (both local and national), and new forms of urban employment investment, and economic restructuring in an age of globalization. Among themes discussed are globalization's impact on the economic health, social and ethnic composition, political dynamics, and urban policy priorities of cities. Readings focus mainly on the American urban experience, including Boston, and Detroit, with additional emphasis on \"global cities\" (New York City, Los Angeles, London, Tokyo, Mexico City, Sao Paolo), and how transformations in these locales produce increasing urban inequality both nationally and world-wide.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.426",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Headquarters, Consult Department",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.426-1",
            "lecture-section-of": "11.426",
            "timeAndPlace":       [
                "F 15:00-17:00 5-231"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.427J - Urban Labor Markets and Employment Policy",
            "id":          "11.427J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Discusses the broader trends in the labor market, how urban labor markets function, public and private training policy, other labor market programs, the link between labor market policy and economic development, and the organization of work within firms.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.427J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "15.677J",
            "in-charge":   "Osterman, P.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.430J - Leadership in the Real Estate Industry",
            "id":          "11.430J",
            "level":       "Grad",
            "units":       "3-0-6",
            "total-units": 9,
            "has-final":   false,
            "description": "Provides and uses theories, concepts and tools to craft, articulate and refine a leadership point of view. Through reflection, self-assessment, discussion and feedback, learn about readiness to lead, leadership style, emotional intelligence, and presentation of self. Converse with leaders in the real estate industry and learn from their stories and insights. At the conclusion of the course, students have a deeper understanding of leadership; a better understanding of themselves and their authentic leadership style; and a plan for the ongoing development of their leadership capabilities.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.430J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "15.941J",
                "11.431J",
                "15.401",
                "15.414"
            ],
            "in-charge":   "Schuck, G.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.431J - Real Estate Finance and Investment",
            "id":          "11.431J",
            "level":       "Grad",
            "units":       "4-0-8",
            "total-units": 12,
            "has-final":   false,
            "description": "analysis, equity valuation, tax analysis, options, risk, and the financial structuring of real property ownership.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.431J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "15.426J",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.432J - Real Estate Capital Markets",
            "id":          "11.432J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "The evolving organization and operation of real estate capital markets. Sources of real estate capital. Primary and secondary mortgage markets. Investment behavior of real estate assets. Development of REITs and securitized debt markets. Advanced pricing techniques for complex real estate securities. Half term subject offered in first half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.432J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "15.427J",
                "11.431J",
                "15.401",
                "15.402",
                "15.407"
            ],
            "in-charge":   "Geltner, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.432J-1",
            "lecture-section-of": "11.432J",
            "timeAndPlace":       [
                "TR 14:30-16:00 W31-301"
            ]
        },
        {
            "type":           "RecitationSection",
            "label":          "s11.432J-2",
            "rec-section-of": "11.432J",
            "timeAndPlace":   [
                "R 17:30-19:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.433J - Real Estate Economics",
            "id":          "11.433J",
            "level":       "Grad",
            "units":       "4-0-8",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on developing an understanding of the factors that shape and influence markets for real property. Includes demographic analysis, patterns of regional growth, construction cycles, urban location theory, and modeling techniques for predicting demand.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.433J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "15.021J",
                "14.01",
                "15.010",
                "15.011"
            ],
            "in-charge":   "Wheaton, W. C.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.434J - Advanced Topics in Real Estate Finance",
            "id":          "11.434J",
            "level":       "Grad",
            "units":       "2-0-4",
            "total-units": 6,
            "has-final":   false,
            "description": "Primarily for students intending to write their MSRED thesis in an area of real estate finance. Focuses on such topics as: portfolio analysis, equilibrium asset price models, real estate investment performance measurement, real options, real estate securitization, and international real estate investment. Designed to allow students to pursue an area of individual interest by means of a term paper project. Half term subject. Offered second half of term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.434J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      "15.428J",
            "in-charge":   "Geltner, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.434J-1",
            "lecture-section-of": "11.434J",
            "timeAndPlace":       [
                "TR 14:30-16:00 W31-301"
            ]
        },
        {
            "type":           "RecitationSection",
            "label":          "s11.434J-2",
            "rec-section-of": "11.434J",
            "timeAndPlace":   [
                "R 17:30-19:00 W31-301"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.437 - Financing Economic Development",
            "id":          "11.437",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on financing tools and program models to support local economic development. Includes an overview of private capital markets and financing sources to understand capital market imperfections that constrain economic development; business accounting; financial statement analysis; federal economic development programs; and public finance tools. Policies and program models covered include revolving loan funds, guarantee programs, venture capital funds, bank holding companies, community development loan funds and credit unions, micro enterprise funds, and the Community Reinvestment Act.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.437",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Seidman, K. F.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.438 - Economic Development Planning",
            "id":          "11.438",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on the policy tools and planning techniques used to formulate and implement local economic development strategies. Includes an overview of economic development theory, discussion of major policy areas and practices employed to influence local economic development, a review of analytic tools to assess local economies and how to formulate strategy. Coursework includes formulation of a local economic development strategy for a client.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.438",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.203",
                "11.220"
            ],
            "in-charge":   "Seidman, K. F.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.438-1",
            "lecture-section-of": "11.438",
            "timeAndPlace":       [
                "MW 14:00-15:30 1-379"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.439 - Revitalizing Urban Main Streets",
            "id":          "11.439",
            "level":       "Grad",
            "units":       "4-0-11",
            "total-units": 15,
            "has-final":   false,
            "description": "Workshop explores the integration of economic development and physical planning interventions to revitalize urban commercial districts. Covers: an overview of the causes of urban business district decline, revitalization challenges, and the strategies to address them; the planning tools used to understand and assess urban Main Streets from both physical design and economic development perspectives; and the policies, interventions, and investments used to foster urban commercial revitalization. Students apply the theories, tools and interventions discussed in class to preparing a formal neighborhood commercial revitalization plan for a client business district.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.439",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.401",
                "11.301J",
                "11.328J"
            ],
            "in-charge":   [
                "Seidman, K. F.",
                "Silberberg, S."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.441 - Community Workshop I",
            "id":          "11.441",
            "level":       "Grad",
            "units":       "3-2-4",
            "total-units": 9,
            "has-final":   false,
            "description": "Community workshops offered by The Center for Reflective Community Practice (CRCP). Subject centers on the social, economic, political, and technological complexities inherent in supporting the equitable development of poor and minority communities. The seminar/workshop format includes collaborative projects that include community residents, professionals and faculty. Each year the subject focuses on a particular issues facing one of the current CRCP community partnerships.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.441",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    "Currently Offered",
            "in-charge":   [
                "McDowell, C.",
                "Staff"
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.462 - Housing Problems and Policies in Developing Countries",
            "id":          "11.462",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "No description available.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.462",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.701",
                "11.426"
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.463J - Structuring Low-Income Housing Projects in Developing Countries",
            "id":          "11.463J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines dynamic relationship among key actors: beneficiaries, government, and funder. Emphasis on cost recovery, affordability, replicability, user selection, and project administration. Extensive case examples provide basis for comparisons.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.463J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.236J",
            "in-charge":   "Goethert, R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.464 - The Informal Sector and the Household Economy",
            "id":          "11.464",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines interrelationships among low-income households, small-scale, income-generating activities, and the urban economy in developing countries. Theories of employment and an analysis of \"bazaar economies\" looked at. Reviews policy options for enhancing the informal sector's contribution to development. The role of women and the possibilities of nonmonetary activities explored.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.464",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.701",
            "in-charge":   "Sanyal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.465J - Special Interest Group in Urban Settlements: SIGUS Workshops",
            "id":          "11.465J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Interactive interdisciplinary workshops which focus on projects and practices on urban settlement issues in developing countries throughout the world. Participation by guest practitioners.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.465J",
            "semester":    [
                "IAP",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.23J",
            "in-charge":   "Goethert, R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.466J - Sustainability, Trade, and the Environment",
            "id":          "11.466J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "The Schumpeterian notion of technological innovation as \"the engine of growth\" is being challenged as the globalization of trade is increasingly seen as the driving force of industrial economies. With the establishment of the World Trade Organization implementing the GATT, NAFTA, and other trading regimes, serious questions have been raised concerning the effects of global trade on sustainability, which must be viewed broadly to include not only a healthy economic base, but also a sound environment, stable employment, adequate purchasing power, distributional equity, national self-reliance, and maintenance of cultural integrity. Subject explores the many dimensions of sustainability and the use of national, multinational, and international political and legal mechanisms to further sustainable development.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.466J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.813J",
                "15.657J",
                "ESD.137J"
            ],
            "in-charge":   "Ashford, N. A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.467J - Property Rights in Transition",
            "id":          "11.467J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the theories and policy debates over who can own real property, how to communicate and enforce property rights, and the range of liberties that they confer.  Explores alternative economic, political, and sociological perspectives of property rights and their policy and planning implications.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.467J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "4.257J",
                "17.550J"
            ],
            "in-charge":   "Kim, A. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.467J-1",
            "lecture-section-of": "11.467J",
            "timeAndPlace":       [
                "T 9:00-12:00 8-205"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.468J - SIGUS Workshop: Learning from Communities",
            "id":          "11.468J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Interactive, interdisciplinary workshops that focus on projects and practices on urban settlement issues in developing countries throughout the world. Participation by guest practitioners.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.468J",
            "semester":    [
                "IAP",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "4.230J",
            "in-charge":   "Goethert, R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.469 - Urban Sociology in Theory and Practice",
            "id":          "11.469",
            "level":       "Grad",
            "units":       "2-0-10",
            "total-units": 12,
            "has-final":   false,
            "description": "Introduction to core writings in urban sociology. Topics include: the changing nature of community, social inequality, political power, socio-spatial change, technological change, and the relationship between the built environment and human behavior. Examine key theoretical paradigms that have constituted the field since its founding, assess how and why they have changed over time, and discuss the implications of these paradigmatic shifts for urban scholarship, social policy and the planning practice. Explore the nature and changing character of the city and the urban experience, including the larger social, political, and economic dynamics of urban change, to enhance appreciation of contemporary, comparative, and historical context in which urban planning skills and sensibilities have been developed and could be applied.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.469",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Davis, D. E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.470 - The Politics of Development Policy",
            "id":          "11.470",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the political forces and conditions that affect urban, regional, and national develoment policymaking.  Key protagonists include political parties, state actors, social movements, NGOs (domestic and global), business groups, and labor organizations, both formal and informal.  Primary emphasis is the developing world, but seeks parallels across a variety of comparative and historical contexts.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.470",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Davis, D. E.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.471 - Political Economy of Development Projects: Targeting the Poor",
            "id":          "11.471",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Covers conditions under which public-sector policies, programs, and projects succeed in enhancing the economic activities of poorer groups and micro-regions in developing countries. Topics include local economic development; small enterprises; various forms of collective action; labor and worker associations; nongovernment organizations. Links these to literature on poverty, economic development, and reform of government, and to types of projects, tasks, and environments that are conducive to equitable outcomes.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.471",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.701",
            "in-charge":   "Tendler, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.472 - D-Lab: Development",
            "id":          "11.472",
            "level":       "Grad",
            "units":       "3-2-7",
            "total-units": 12,
            "has-final":   false,
            "description": "Introduces students to classical theories of economic, social, and political modernizations focusing on the role of technological change in the multifaceted process of development of newly industrializing nations.  Drawing on theories as well as case studies and hands-on exercises, the course introduces students to the potential as well as deficiencies of the dominant models of technological innovation focused particularly on the needs and capabilities of poor households.  Students are encouraged to develop specific plans for innovative technical solutions and test out such plans during IAP through site visits to poor communities in Asia, Africa, and Latin America where they work with host institutions in fostering technological change and institution building.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.472",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "prereq":      [
                "11.025J",
                "SP.721J"
            ],
            "in-charge":   [
                "Smith, A. B.",
                "Sanyal, B."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.479J - Water and Sanitation Infrastructure in Developing Countries",
            "id":          "11.479J",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.479J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      "1.851J",
            "in-charge":   "PM), T EVE (3-6",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.479J-1",
            "lecture-section-of": "11.479J",
            "timeAndPlace":       [
                "T 15:00-18:00 26-152"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.481J - Analyzing and Accounting for Regional Economic Change",
            "id":          "11.481J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Surveys theories of regional growth, factor mobility, clustering, industrial restructuring, learning regions, and global supply chains from a political-economy perspective. Examines/critiques accounting frameworks including accounting for the underground economy, multipliers, linkages, and supply chains used to assess employment and environmental impacts, infrastructure investments. Assesses price indices, industrial location and employment measures, and shift-share analyses. Discussions of US and foreign applications.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.481J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.284J",
                "ESD.192J",
                "14.03",
                "14.04"
            ],
            "in-charge":   "Polenske, K. R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.481J-1",
            "lecture-section-of": "11.481J",
            "timeAndPlace":       [
                "TR 9:00-10:30 1-246"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.482J - Regional Socioeconomic Impact Analyses and Modeling",
            "id":          "11.482J",
            "level":       "Grad",
            "units":       "2-1-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Reviews regional economic theories and models and provides students with experience in using alternative economic impact assessment models on microcomputers. Problem sets are oriented around infrastructure, housing, energy, and environmental issues. Students work with a client generally in Boston and make a presentation to the client. Emphasis on written and oral presentation skills.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.482J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.285J",
                "ESD.193J",
                "11.481J"
            ],
            "in-charge":   "Polenske, K. R.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.484 - Project Evaluation in Developing Countries",
            "id":          "11.484",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Covers techniques of financial analysis of investment expenditurs as well as the economic and distributive appraisal of development projects. Critical analysis of these tools and their role in the political economy of international development. Topics include alternative planning strategies for conditions of uncertainty, organizations and project cycle management, the political environment and the interactions of clients and advisers, engineers, planners, policy analysts, and other professionals.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.484",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Kim, A. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.485 - Planning in Transition Economies",
            "id":          "11.485",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Surveys the recent historic transformation of former centrally planned economies in Europe and Asia. Topics include the reformulation of property rights and institutional development, the emergence of the private sector, the changing role of the state, the spatial transformation of cities, and the redistribution of wealth.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.485",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Kim, A. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.486J - Economic Institutions and Growth Policy Analysis",
            "id":          "11.486J",
            "level":       "Grad",
            "units":       "3-0-6",
            "total-units": 9,
            "has-final":   false,
            "description": "Considers how institutions have been incorporated theoretically into explorations of growth and development. Four sets of institutions are examined in detail: the corporate sector, to study how ownership, strategy, and structure affect growth-related policies; financial institutions, to analyze how they condition savings and investment; labor market institutions, to investigate their impact on the determination of wage and production-related productivity; and the institutions associated with technology, such as universities, research laboratories, and corporate training centers, to consider how skill formulation is accomplished.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.486J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "14.778J",
                "17.184J",
                "11.203"
            ],
            "in-charge":   [
                "Amsden, A.",
                "Piore, M."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.486J-1",
            "lecture-section-of": "11.486J",
            "timeAndPlace":       [
                "M 9:00-12:00 10-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.487 - Urban Public Finance in Developing Countries",
            "id":          "11.487",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Explores the question of how to pay for urban public services in developing countries. Use of cases, implicit ethical issues, and diverse public financing arrangements and institutional contexts to appreciate the difficult choices the public sector faces in developing countries. The goal is to gain facility in public finance analysis, familiarity with a variety of sources of public finance and their tradeoffs, and a general theoretical framework with which to approach real urban financing problems in developing countries.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.487",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.701",
                "11.426"
            ],
            "in-charge":   "Kim, A. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.488 - Cities and Public Security",
            "id":          "11.488",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines how public security shapes, and is shaped by, the spatial character, political dynamics, and social experience of cities. A special concern is the \"privatization\" of public security and policing, and what it means for equality, rule of law, crime, violence, access to public space, community power, and quality of life in cities here and abroad. Subject has both theoretical and practical aims, and readings range from general accounts of the logic of social control to institutional analyses of police to case studies of police-community relations to city profiles in which the privatization of police brings greater physical and social segregation.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.488",
            "semester":    "Spring",
            "offering":    "Not offered this year",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Davis, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.489 - The Growth and Spatial Structure of Cities",
            "id":          "11.489",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the economic, political, social, and spatial dynamics of urban growth and decline in cities and their key component areas (downtown, suburbs, etc.). Topics include impacts of industrialization, technology, politics, and social practices on cities. Examines the role of public and private sector activities, ranging from zoning and subsidies to infrastructure development and real estate investment, in affecting urban growth and decline. Readings are both theoretical and empirical, with considerable thought paid to comparative and historical differences.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.489",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Davis, D.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.491J - Economic Development and Policy Analysis I",
            "id":          "11.491J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Analyzes the theoretical and historical reasons why governments in latecomer countries have intervened with a wide array of policies to foster industrial development at various turning points: the initiation of industrial activity; the diversification of the industrial base; the restructuring of major industrial institutions; and the entry into high-technology sectors.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.491J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "17.176J",
                "11.701"
            ],
            "in-charge":   "Amsden, A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.491J-1",
            "lecture-section-of": "11.491J",
            "timeAndPlace":       [
                "M 14:00-17:00 4-253"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.492J - Economic Development and Policy Analysis, Part II",
            "id":          "11.492J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Analyzes economic development in \"the remainder,\" or in countries that largely failed to enter the orbit of modern world industry since the end of World War II. Looks at the reasons for falling behind in terms of history, geography/global transactions, institutions (including business enterprises), policies and knowledge-based assets. Explores potential policies for accelerating the process of industrial transformation and the control mechanism necessary to improve government planning.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.492J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "17.190J",
                "11.491J"
            ],
            "in-charge":   "Amsden, A.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.493 - Legal Aspects of Property and Land Use",
            "id":          "11.493",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the legal and institutional arrangements for the establishment, transfer, and control over property under American and selected comparative systems including India and South Africa. Emphasizes efficient resource use, institutional, entitlement, and relational approaches to property, distributional and other social aspects, and the relationship between property, culture, and democracy.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.493",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Rajagopal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.494 - Law and Politics of Local Governance",
            "id":          "11.494",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Offers an introduction to the legal and institutional issues that arise in local and city governance. Focus on the way institutional arrangements and legal concepts influence how power is distributed, how it is exercised and by whom, and explores alternative arrangements. Principal emphasis on American local government law, with forays into comparative legal regulation.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.494",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Rajagopal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.495 - Governance and Law in Developing Countries",
            "id":          "11.495",
            "level":       "Grad",
            "units":       "2-0-10",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the multiple dimensions of governance in international development with a focus on the role of legal norms and institutions. Critically examines the changes in the distribution of authority, political and legal, as a result of economic globalization. Explores the relationship between local and global governance and the idea of multi-level governance. Topics covered include the role and the reform of the State, the role of civil society and markets, global governance, the role of the judiciary and legal culture in development and tools for measuring governance performance.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.495",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Rajagopal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.496 - Law, Social Movements, and Public Policy: Comparative and International Experience",
            "id":          "11.496",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Examines the role that courts and social movements play in shaping public policy, at the global level and within selected countries. Primary focus on law, courts and grassroots activism on processes and outcomes of public policy, in current areas like gender, race, trade, environment, and human rights. Introduction to theoretical frameworks that help critically link law and society. Research paper required for graduate students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.496",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "prereq":      "11.166",
            "in-charge":   "Rajagopal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.497 - Human Rights in Theory and Practice",
            "id":          "11.497",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Provides a rigorous and critical introduction to the foundation, structure and operation of the international human rights movement. Focus on current debates in human rights including democracy promotion, economic and social rights in development and globalization, gender and race discrimination, religion, use of military force and humanitarian intervention, terrorism, and ethical issues in science and technology. Meets with 11.164, but graduate students are expected to write a research paper.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.497",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "prereq":      [
                "11.164J",
                "17.391J"
            ],
            "in-charge":   "Rajagopal, B.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.520 - A Workshop on Geographic Information Systems",
            "id":          "11.520",
            "level":       "Grad",
            "units":       "3-6-3",
            "total-units": 12,
            "has-final":   false,
            "description": "An introduction to geographic information systems (GIS) as applied to urban and regional planning, community development, and local government. Emphasis on learning GIS technology and spatial analysis techniques through extensive hands-on exercises using real-world data sets such as the US census of population and housing. Includes a small project on an urban planning problem involving the selection of appropriate methods, the use of primary and secondary data, computer-based modeling, and spatial analysis. This full-term subject includes all topics in the IAP module 11.208.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.520",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.204",
                "11.188",
                "11.208"
            ],
            "in-charge":   "Ferreira, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.521 - Spatial Database Management and Advanced Geographic Information Systems",
            "id":          "11.521",
            "level":       "Grad",
            "units":       "3-3-6",
            "total-units": 12,
            "has-final":   false,
            "description": "Extends the computing and geographic information systems (GIS) skills developed in 11.520 to include spatial data management in client/server environments and advanced GIS techniques. First half covers the content of 11.523, introducing database management concepts, SQL (Structured Query Language), and enterprise-class database management software. Second half explores advanced features and the customization features of GIS software that perform analyses for decision support that go beyond basic thematic mapping. Includes the half-semester GIS project of 11.524 that studies a real-world planning issue.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.521",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.520",
                "11.523",
                "11.524"
            ],
            "in-charge":   "Ferreira, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.521-1",
            "lecture-section-of": "11.521",
            "timeAndPlace":       [
                "R 14:00-15:30 9-251"
            ]
        },
        {
            "type":           "LabSection",
            "label":          "s11.521-2",
            "lab-section-of": "11.521",
            "timeAndPlace":   [
                "T 14:00-17:00 37-312"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.522 - Research Seminar on Urban Information Systems",
            "id":          "11.522",
            "level":       "Grad",
            "units":       "2-4-6",
            "total-units": 12,
            "has-final":   false,
            "description": "Advanced research seminar enhances computer and analytic skills developed in other subjects in this sequence. Students present a structured discussion of journal articles representative of their current research interests involving urban information systems and complete a short research project. Suggested research projects include topics related to ongoing UIS Group research.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.522",
            "semester":    "Fall",
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.204",
                "11.521",
                "11.520",
                "11.525"
            ],
            "in-charge":   "Ferreira, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.523 - Fundamentals of Spatial Database Management",
            "id":          "11.523",
            "level":       "Grad",
            "units":       "2-2-2",
            "total-units": 6,
            "has-final":   false,
            "description": "The fundamentals of database management systems as applied to spatial analysis. Includes extensive hands-on exercises using real-world planning data. Introduces database management concepts, SQL (Structured Query Language), and enterprise-class database software. Same content as first half of 11.521.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.523",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.204",
                "11.521",
                "11.524"
            ],
            "in-charge":   "Ferreira, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.523-1",
            "lecture-section-of": "11.523",
            "timeAndPlace":       [
                "R 14:00-15:30 9-251"
            ]
        },
        {
            "type":           "LabSection",
            "label":          "s11.523-2",
            "lab-section-of": "11.523",
            "timeAndPlace":   [
                "T 14:00-17:00 37-312"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.524 - Advanced Geographic Information System Project",
            "id":          "11.524",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Learning and utilizing advanced geographic information system techniques in studio/lab setting with real-world client problem and complex digital spatial data infrastructure. Projects typically use the client and infrastructure setting for 11.521. Credit cannot also be received for 11.521 in the same term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.524",
            "semester":    "Spring",
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "11.523",
                "11.521",
                "11.523"
            ],
            "in-charge":   "Ferreira, J.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.524-1",
            "lecture-section-of": "11.524",
            "timeAndPlace":       [
                "R 14:00-15:30 9-251"
            ]
        },
        {
            "type":           "LabSection",
            "label":          "s11.524-2",
            "lab-section-of": "11.524",
            "timeAndPlace":   [
                "T 14:00-17:00 37-312"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.525 - Emerging Technologies for Planners",
            "id":          "11.525",
            "level":       "Grad",
            "units":       "3-2-7",
            "total-units": 12,
            "has-final":   false,
            "description": "Students are familiarized with the changing technologies available for manipulating, organizing, and presenting visually-oriented electronic information for the description of urban environmental phenomena. Students are exposed to cases where these technologies have been used, or are in use, by planning-related agencies. Impacts of these technologies upon public debate and decision making are studied. Specific attention is paid to multimedia and communication technologies and how these have the ability to change the way people plan.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.525",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.204",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.526J - Comparative Land Use and Transportation Planning",
            "id":          "11.526J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Focuses on the integration of land use and transportation planning, drawing from cases in both industrialized and developing countries. Reviews underlying theories, analytical techniques, and the empirical evidence of the land use-transportation relationship at the metropolitan, intra-metropolitan, and micro-scales.  Also covers the various ways of measuring urban structure, form, and the \"built environment.\"  Develops students? skills to assess relevant policies, interventions and impacts.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.526J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "1.251J",
            "in-charge":   "Zegras, C.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.526J-1",
            "lecture-section-of": "11.526J",
            "timeAndPlace":       [
                "TR 11:00-12:30 1-135"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.528J - Urban Spatial Structure, Transportation, and Telecommunications I",
            "id":          "11.528J",
            "level":       "Grad",
            "units":       "3-1-2",
            "total-units": 6,
            "has-final":   false,
            "description": "Discusses the meanings of urban space and the role of transportation planning in a contemporary metropolitan context. Topics include formation and evolution of land use patterns; job accessibility of low-skilled workers; strategies for improving accessibility; integration of transportation planning with housing, social service, and job placement; and impact of advanced communication and information technologies on urban space. Applies spatial analysis, GIS, and transportation planning methods to a case study of Boston.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.528J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "ESD.229J",
                "11.204"
            ],
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.529 - Urban Spatial Structure, Transportation, and Telecommunications II",
            "id":          "11.529",
            "level":       "Grad",
            "units":       "0-3-3",
            "total-units": 6,
            "has-final":   false,
            "description": "Extends the analytical frameworks developed in 11.528J and applies them to the examination of urban land use, transportation, and telecommunications-related problems. Sheds light on ongoing policy debates by analyzing empirical data using GIS and spatial models. Students undertake a short research project individually or participate in a group project.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.529",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      "11.528",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.530 - Community and Technology",
            "id":          "11.530",
            "level":       "Grad",
            "units":       "2-0-10",
            "total-units": 12,
            "has-final":   false,
            "description": "Critical overview of recent studies on the social implications of new media on community, networks and society. Topics include personal computing, Internet use, mobile phones, virtual community, blogs, etc. Critical evaluation of empirical studies, use of social network analysis, and research projects address sociological research questions.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.530",
            "semester":    "Spring",
            "offering":    [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Hampton, K.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.540J - Urban Transportation Planning",
            "id":          "11.540J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "History, policy, and politics of urban transportation. The role of the federal government and the \"highway revolt.\" Public transit in the auto era. Analytic tools for transportation planning and policy analysis. The contribution of transportation to air pollution and climate change. Land use and transportation interactions. Bicycles, pedestrians, and traffic calming. Examples from the Boston area.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.540J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.252J",
                "ESD.225J"
            ],
            "in-charge":   [
                "Salvucci, F.",
                "Murga, M."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.541J - Public Transportation Systems",
            "id":          "11.541J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   true,
            "description": "Evolution and role of urban public transportation modes, systems, and services, focussing on bus and rail. Description of technological characteristics and their impacts on capacity, service quality, and cost. Current practice and new methods for data collection and analysis, performance monitoring, route design, frequency determination, and vehicle and crew scheduling. Effect of pricing policy and service quality on ridership. Methods for estimating costs associated with proposed service changes. Organizational models for delivering public transportation service including finance and operations.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.541J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.258J",
                "ESD.226J",
                "1.201J"
            ],
            "in-charge":   "Wilson, N. H. M.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.541J-1",
            "lecture-section-of": "11.541J",
            "timeAndPlace":       [
                "TR 13:00-14:30 1-246"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.543J - Transportation Policy and Environmental Limits",
            "id":          "11.543J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Through a combination of lectures, cases, and class discussions the subject examines the economic and political conflict between transportation and the environment. Investigates the role of government regulation, green business and transportation policy as a facilitator of economic development and environmental sustainability. Analyzes a variety of international policy problems including government-business relations, the role of interest groups, non-governmental organizations, and the public and media in the regulation of the automobile; sustainable development; global warming; politics of risk and siting of transport facilities; environmental justice; equity; as well as transportation and public health in the urban metropolis. Provides students with an opportunity to apply transportation and planning methods to develop policy alternatives in the context of environmental politics.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.543J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.253J",
                "ESD.222J"
            ],
            "in-charge":   [
                "Coughlin, J.",
                "Salvucci, F."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.543J-1",
            "lecture-section-of": "11.543J",
            "timeAndPlace":       [
                "F 14:00-17:00 1-277"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.544J - Transportation Systems Analysis",
            "id":          "11.544J",
            "level":       "Grad",
            "units":       "3-1-8",
            "total-units": 12,
            "has-final":   false,
            "description": "Problem-motivated introduction to methods, models and tools for the analysis and design of transportation networks including their planning, operations and control.  Capacity of critical elements of transportation networks.  Traffic flows and deterministic and probabilistic delay models.  Formulation of optimization models for planning and scheduling of freight, transit and airline systems, and their solution using software packages.  User- and system-optimal traffic assignment.  Control of traffic flows on highways, urban grids, and airspace.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.544J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.200J",
                "ESD.21J",
                "1.010"
            ],
            "in-charge":   [
                "Barnhart, C.",
                "Odoni, A. R."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.545J - Introduction to Transportation Systems",
            "id":          "11.545J",
            "level":       "Grad",
            "units":       "3-1-8",
            "total-units": 12,
            "has-final":   false,
            "description": "Introduces transportation as a complex sociotechnical  system, stressing its social and economic aspects. Key issues shaping urban, intercity, and international passenger and freight transportation in the developed and developing world. Principles governing transportation planning, investment, operations and maintenance. Introduction to quantitative models and qualitative frameworks. System performance and level-of-service metrics and the determinants of transportation demand. Introduction to economic concepts central to transportation. Transportation services and facilities for various modes and intermodal operations.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.545J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.201J",
                "ESD.210J"
            ],
            "in-charge":   [
                "Wilson, N. H. M.",
                "Ben-Akiva, M."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.601 - Introduction to Environmental Policy and Planning",
            "id":          "11.601",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Required introductory subject for graduate students pursuing environmental policy and planning as their specialization in the MCP Program. Also open to all DUSP/TPP students interested in ?the environmental policy debate? as well as the range of environmental planning tools and techniques. Class is taught comparatively, with constant reference to examples from around the world. Consists of three parts: The Environmental Policy Debates, Environmental Planning Techniques and Strategies, and Synthesis and Preparation for Practice. The first part revolves around debate-style presentations in which student teams test contrary arguments drawing on the relevant philosophical literature. The second part provides an overview of techniques and strategies for environmental management and planning. The third part introduces students to EPP faculty work and helps students formulate a plan for the remainder of their graduate studies.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.601",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Susskind, L.",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.630J - Environmental Law, Policy, and Economics: Pollution Prevention and Control",
            "id":          "11.630J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Reviews and analyzes federal and state regulation of air and water pollution and hazardous wastes. Analyzes pollution as an economic problem and the failure of markets. Emphasizes use of legal mechanisms and alternative approaches (such as economic incentives and voluntary approaches) to control pollution and to encourage chemical accident and pollution prevention. Focuses on the major federal legislation, the underlying administrative system, and the common law in analyzing environmental policy, economic consequences, and the role of the courts. Discusses classical pollutants and toxic industrial chemicals, community right-to-know, and environmental justice. Also provides an introduction to basic legal skills.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.630J",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.811J",
                "ESD.133J",
                "1.801J",
                "11.021J",
                "17.393J"
            ],
            "in-charge":   [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.631J - Regulation of Chemicals, Radiation, and Biotechnology",
            "id":          "11.631J",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   true,
            "description": "Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.631J",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "prereq":      [
                "1.812J",
                "ESD.134J",
                "1.802J",
                "11.022J"
            ],
            "in-charge":   [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "subarea":     "Program Group Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.631J-1",
            "lecture-section-of": "11.631J",
            "timeAndPlace":       [
                "W 19:00-10:00 E51-372"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.701 - Introduction to Planning and Institutional Processes in Developing Countries",
            "id":          "11.701",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Interaction between planners and institutions at both national and local levels. Overview of theories of state, organizational arrangements, implementation mechanisms, and planning styles. Case studies of planning: decentralization, provision of low-cost housing, and new-town development. Analyzes various roles planners play in different institutional contexts. Professional ethics and values amidst conflicting demands. Restricted to first-year MCP and SPURS students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.701",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Staff",
            "subarea":     "Program Group Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.800 - Doctoral Research Seminar",
            "id":          "11.800",
            "level":       "Grad",
            "units":       "3-0-9",
            "total-units": 12,
            "has-final":   false,
            "description": "Required subject for all entering PhD students. Dual focus is on formulating researchable questions (to help students write their first-year papers) and understanding how research knowledge comes to be influential in the world or not influential. Explores ways to make research knowledge more accessible, credible, and useful in the realm of public policy and practice. Addresses the politics of the policymaking process, the power of framing and agenda-setting, how knowledge diffuses along knowledge and influcence networks, and how varied types of knowledge shape decision-making and action.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.800",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Levy, F.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.800-1",
            "lecture-section-of": "11.800",
            "timeAndPlace":       [
                "W 8:30-10:30 5-231"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.900 - Doctoral Proseminars",
            "id":          "11.900",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Designed primarily for advanced doctoral candidates. A selection of Proseminars is offered each year for groups of students affiliated with the various research clusters in the Department.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.900",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Levy, F.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.901 - Research Seminar: Topics in Urban Studies and Planning",
            "id":          "11.901",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Special research issues in urban planning, selected each term for special study.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.901",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    [
                "H-LEVEL Grad Credit",
                "H-LEVEL Grad Credit"
            ],
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.911, 11.912 - Supervised Readings in Urban Studies",
            "id":          "11.911, 11.912",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Reading and discussion of special topics in urban studies and planning.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.911, 11.912",
            "semester":    [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Staff",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.913 - Special Topics in Urban Studies and Planning",
            "id":          "11.913",
            "level":       "Grad",
            "units":       "1-0-2 [P/D/F]",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Special topics in Urban Studies and Planning. Restricted to first-year MCP students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.913",
            "semester":    "Fall",
            "offering":    "Currently Offered",
            "in-charge":   "Ryznar, R.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.914 - Special Topics in Urban Studies and Planning",
            "id":          "11.914",
            "level":       "Grad",
            "units":       "2-0-1",
            "total-units": 3,
            "has-final":   false,
            "description": "Special topics in Urban Studies and Planning. Restricted to first-year MCP students.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.914",
            "semester":    "Spring",
            "offering":    "Currently Offered",
            "in-charge":   "Briggs, X.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.921, 11.922 - Special Seminars in Real Estate Development",
            "id":          "11.921, 11.922",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "No description available.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.921, 11.922",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.941-11.955 - Special Studies in Urban Studies and Planning",
            "id":          "11.941-11.955",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.941-11.955",
            "semester":    [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-1",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "R 9:00-11:00 5-232"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-2",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "M 15:30-17:30 3-401"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-3",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "M 14:00-17:00 10-401"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-4",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "TR 9:00-11:00 W31-301"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-5",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "M 14:00-17:00 5-231"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-6",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "T 9:00-12:00 3-401"
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "s11.941-11.955-7",
            "lecture-section-of": "11.941-11.955",
            "timeAndPlace":       [
                "W 15:00-17:00 3-401"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.956-11.959 - IAP Special Studies in Urban Studies and Planning",
            "id":          "11.956-11.959",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Special subjects offered during IAP. 11.958 and 11.959 are taught P/D/F.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.956-11.959",
            "semester":    "IAP",
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.960, 11.961 - Special Studies in Real Estate",
            "id":          "11.960, 11.961",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Special subjects offered during IAP and summer.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.960, 11.961",
            "semester":    [
                "IAP",
                "Summer"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":   "Geltner, D.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.962 - Urban Fieldwork and Internships",
            "id":          "11.962",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Practical application of planning techniques to towns, cities, and regions, including problems of replanning, redevelopment, and renewal of existing communities. Includes internships, under staff supervision, in municipal and state agencies and departments.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.962",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.963-11.969 - Special Studies in Urban Studies and Planning",
            "id":          "11.963-11.969",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.963-11.969",
            "semester":    [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.970 - Special Studies in Urban Studies and Planning",
            "id":          "11.970",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Small group study of advanced subjects under staff supervision. For graduate students wishing to pursue further study in advanced areas of urban studies and city and regional planning not covered in regular subjects of instruction.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.970",
            "semester":    [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.970-1",
            "lecture-section-of": "11.970",
            "timeAndPlace":       [
                "T 15:00-17:00 4-146"
            ]
        },
        {
            "type":        "Class",
            "label":       "11.981 - Graduate Tutorial",
            "id":          "11.981",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Planned programs of individual instruction. Students and faculty members must make arrangements prior to the beginning of the term.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.981",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.983 - SPURS Seminar",
            "id":          "11.983",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Provides skills to enable SPURS Fellows to grasp complex issues of urban and regional change. Aims to facilitate professional interactions with scholars, policy makers, and practitioners in the field. MIT faculty and outside specialists share expertise on issues related to globalization, urban development, infrastructure, and public policy. Fellows present their professional interests and research, and hone practical and professional skills. Fellows prepare a research paper that addresses an important issue in their practice and conducts an examination of that issue. Final research paper is presented to the larger MIT community. SPURS Fellows only.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.983",
            "semester":    [
                "Fall",
                "Spring"
            ],
            "offering":    "Currently Offered",
            "in-charge":   "Staff",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.985 - Summer Thesis Writing",
            "id":          "11.985",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Designed to be used specifically for thesis writing and research during the summer.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.985",
            "semester":    "Summer",
            "offering":    "Currently Offered",
            "in-charge":   "Vale, L.",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":        "Class",
            "label":       "11.ThG - Graduate Thesis",
            "id":          "11.ThG",
            "level":       "Grad",
            "units":       "Unknown",
            "total-units": "Unknown",
            "has-final":   false,
            "description": "Program of research and writing of thesis; to be arranged by the student with supervising committee.",
            "url":         "http://student.mit.edu/catalog/m11c.html#11.ThG",
            "semester":    [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":    [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":    "H-LEVEL Grad Credit",
            "in-charge":   "Staff",
            "subarea":     "Tutorials, Research, and Field Work Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "s11.ThG-1",
            "lecture-section-of": "11.ThG",
            "timeAndPlace":       [
                "T 12:30-14:30 5-232"
            ]
        }
    ]
}