{
    "items": [
        {
            "type":          "Class",
            "label":         "Probability and Statistics in Engineering",
            "id":            "1.151",
            "listing-index": "m1b-000",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Quantitative analysis of uncertainty and risk for engineering applications. Fundamentals of probability, statistics, and decision analysis. Events and their probability, Total Probability and Bayes\\' Theorems. Random variables and vectors. Bernoulli Trial Sequence and Poisson Point Process models. Conditional distributions and distribution of functions of random variables and vectors.  Probabilistic moments, second-moment uncertainty propagation and best linear unbiased estimation theory for variables and vectors. Introduction to system reliability. Estimation of distribution parameters (method of moments, maximum likelihood, Bayesian estimation) and simple and multiple linear regression. Emphasis on application to engineering problems.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.151",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Veneziano, D.",
            "area":          "Engineering Risk Assessment and Probabilistic Analysis"
        },
        {
            "type":          "Class",
            "label":         "Engineering Risk-Benefit Analysis",
            "id":            "1.155",
            "listing-index": "m1b-001",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Emphasis on three methodologies pertaining to decision making in the presence of uncertainty: reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). Risks of particular interest are those associated with large engineering projects such as the development of new products; the building, maintenance and operation of nuclear reactors and space systems. Presents and interprets some of the frameworks helpful for balancing risks and benefits in the situations that typically involve human safety, potential environmental effects, and large financial and technological uncertainties. Review of elementary probability theory and statistics included.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.155",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.155",
                "2.963",
                "3.577",
                "6.938",
                "10.816",
                "16.862",
                "22.82"
            ],
            "in-charge":     "Apostolakis, G. E.",
            "area":          "Engineering Risk Assessment and Probabilistic Analysis"
        },
        {
            "type":          "Class",
            "label":         "Transportation Systems Analysis: Performance and Demand",
            "id":            "1.200",
            "listing-index": "m1b-002",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Problem-motivated introduction to methods, models and tools for the analysis and design of transportation networks including their planning, operations and control.  Capacity of critical elements of transportation networks.  Traffic flows and deterministic and probabilistic delay models.  Formulation of optimization models for planning and scheduling of freight, transit and airline systems, and their solution using software packages.  User- and system-optimal traffic assignment.  Control of traffic flows on highways, urban grids, and airspace.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.200J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.544J",
                "1.010"
            ],
            "in-charge":     [
                "Barnhart, C.",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.200",
            "lecture-section-of": "1.200",
            "timeAndPlace":       "TR10.30-12 5-134"
        },
        {
            "type":           "RecitationSection",
            "label":          "R021.200",
            "rec-section-of": "1.200",
            "timeAndPlace":   [
            ]
        },
        {
            "type":          "Class",
            "label":         "Transportation Systems Analysis: Demand and Economics",
            "id":            "1.201",
            "listing-index": "m1b-003",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     true,
            "description":   "Introduces transportation systems analysis, stressing demand and economic aspects. Covers the key principles governing transportation planning, investment, operations and maintenance.  Introduces the microeconomic concepts central to transportation systems. Topics covered include economic theories of the firm, the consumer and the market,  demand models, discrete choice analysis, cost models and production functions, and pricing theory.  Application to transportation systems include congestion pricing, technological change, resource allocation, market structure and regulation, and project evaluation; covering passenger and freight, aviation and intelligent transportation systems.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.201J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.545J",
            "in-charge":     [
                "Wilson, N. H. M.",
                "Ben-Akiva, M."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.201",
            "lecture-section-of": "1.201",
            "timeAndPlace":       "TR2.30-4 1-242"
        },
        {
            "type":           "RecitationSection",
            "label":          "R021.201",
            "rec-section-of": "1.201",
            "timeAndPlace":   "F11 1-242"
        },
        {
            "type":          "Class",
            "label":         "Demand Modeling",
            "id":            "1.202",
            "listing-index": "m1b-004",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Theory and application of modeling and statistical methods for analysis and forecasting of demand for facilities, services, and products. Topics include review of probability and statistics, estimation and testing of linear regression models, theory of individual choice behavior, derivation, estimation, and testing of discrete choice models (including logit, nested logit, GEV, probit, and mixture models), estimation under various sample designs and data collection methods (including revealed and stated preferences), sampling, aggregate forecasting methods, and iterative proportional fitting and related methods. Lectures reinforced with case studies, which require specification, estimation, testing, and analysis of models using data sets from actual applications.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.202J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Ben-Akiva, M. E.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Logistical and Transportation Planning Methods",
            "id":            "1.203",
            "listing-index": "m1b-005",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Quantitative techniques of operations research with emphasis on applications in transportation systems analysis (urban, air, ocean, highway, and pickup and delivery systems) and in the planning and design of logistically oriented urban service systems (e.g., fire and police departments, emergency medical services, and emergency repair services). Unified study of functions of random variables, geometrical probability, multi-server queuing theory, spatial location theory, network analysis and graph theory, and relevant methods of simulation. Computer exercises and discussions of implementation difficulties.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.203J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "6.281J",
                "15.073J",
                "16.76J",
                "6.431"
            ],
            "in-charge":     [
                "Larson, R. C.",
                "Odoni, A. R.",
                "Barnett, A. I.",
                "Orlin, J.B."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.203",
            "lecture-section-of": "1.203",
            "timeAndPlace":       "MW10.30-12 1-150"
        },
        {
            "type":          "Class",
            "label":         "Computer Algorithms in Systems Engineering",
            "id":            "1.204",
            "listing-index": "m1b-006",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Concepts of computation in analysis of engineering systems. Data structures, relational database representations of engineering data. Algorithms for the solution and optimization of engineering system designs: greedy, dynamic programming, branch and bound, graph algorithms, nonlinear optimization. Introduction to complexity analysis. Object-oriented, efficient implementations of algorithms.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.204",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.001",
            "in-charge":     "Kocur, G.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Advanced Demand Modeling",
            "id":            "1.205",
            "listing-index": "m1b-007",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Advanced theories and applications of models for analysis and forecasting of users\\' behavior and demand for facilities, services, and products. Topics vary each year and typically include linear and nonlinear latent variable models, including structural equations and latent class models; estimation techniques with multiple data sources; joint discrete and continuous choice models; dynamic models; analysis of panel data; analysis of complex choices; estimation and forecasting with very large choice sets; multidimensional probabilistic choice models; advanced choice models, including probit, logit mixtures, hybrid choice models, hidden Markov models, simulation and Bayesian methods, survey design, sampling, model transferability, and use of stated preference data.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.205J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.202",
            "in-charge":     "Ben-Akiva, M. E.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Airline Schedule Planning",
            "id":            "1.206",
            "listing-index": "m1b-008",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores a variety of models and optimization techniques for the solution of airline schedule planning problems. Schedule design, fleet assignment, aircraft maintenance routing, crew scheduling, robust planning, integrated schedule planning, and other topics are addressed. Models and solution techniques are surveyed and state-of-the-art applications of these techniques to airline problems are presented.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.206J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.77J",
            "in-charge":     "Barnhart, C.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "An Introduction to Intelligent Transportation Systems",
            "id":            "1.212",
            "listing-index": "m1b-009",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Basic elements of intelligent transportation systems. Technological, systems, and institutional aspects of ITS considered, including system architecture, congestion pricing, public/private partnerships, network models, freight, public transportation, ITS and regional strategic transportation planning, environmental aspects of ITS, developing country applications and implementation case studies. Term project required.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.212J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Sussman, J.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Planning and Design of Airport Systems",
            "id":            "1.231",
            "listing-index": "m1b-010",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Equal emphasis on current practice and advanced concepts. Airport location and planning with full consideration of economic, environmental, and other impacts. Demand prediction, determination of the capacity of the airfield, and estimation of levels of congestion. Design of terminals. Role of airports in the aviation and transportation system. Airport access problems. Optimal configuration of air transport networks and implications for airport development. Economics of the airport. Financing and institutional aspects. Special attention to international practice and developments.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.231J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.781J",
            "in-charge":     [
                "Neufville, R. de",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.231",
            "lecture-section-of": "1.231",
            "timeAndPlace":       "TR1-2.30 1-371"
        },
        {
            "type":          "Class",
            "label":         "The Airline Industry",
            "id":            "1.232",
            "listing-index": "m1b-011",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Overview of the global airline industry, focusing on recent industry performance, current issues and challenges for the future. Fundamentals of airline industry structure, airline economics, operations planning, safety, labor relations, airports and air traffic control, marketing, and competitive strategies, with an emphasis on the interrelationships among major industry stakeholders. Recent research findings of the MIT Global Airline Industry Program are showcased, including the impacts of congestion and delays, evolution of information technologies, changing human resource management practices, and competitive effects of new entrant airlines. Taught by faculty participants of the Global Airline Industry Program.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.232J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "15.054J",
                "16.71J"
            ],
            "in-charge":     [
                "Belobaba, P. P.",
                "Barnett, A. I.",
                "Barnhart, C.",
                "Hansman, R. J.",
                "Kochan, T. A.",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.232",
            "lecture-section-of": "1.232",
            "timeAndPlace":       "MW1-2.30 33-419"
        },
        {
            "type":          "Class",
            "label":         "Airline Management",
            "id":            "1.234",
            "listing-index": "m1b-012",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Overview of airline management decision processes, with a focus on economic issues and their relationship to operations planning models and decision support tools. Application of economic models of demand, pricing, costs, and supply to airline markets and networks. Examination of industry practice and emerging methods for fleet planning, route network design, scheduling, pricing and revenue management, with emphasis on the interactions between the components of airline management and profit objectives in competitive environments. Students participate in a competitive airline management simulation game as part of the subject requirements.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.234J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.75J",
                "16.71J"
            ],
            "in-charge":     "Belobaba, P. P.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Comparative Land Use and Transportation Planning",
            "id":            "1.251",
            "listing-index": "m1b-013",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focuses on the integration of land use and transportation planning, drawing from cases in both industrialized and developing countries. Reviews underlying theories, analytical techniques, and the empirical evidence of the land use-transportation relationship at the metropolitan, intra-metropolitan, and micro-scales.  Also covers the various ways of measuring urban structure, form, and the \\\u0022built environment.\\\u0022  Develops students\\' skills to assess relevant policies, interventions and impacts.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.251J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.526J",
            "in-charge":     "Zegras, C.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Urban Transportation Planning",
            "id":            "1.252",
            "listing-index": "m1b-014",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "History, policy, and politics of urban transportation. The role of the federal government and the \\\u0022highway revolt.\\\u0022 Public transit in the auto era. Analytic tools for transportation planning and policy analysis. The contribution of transportation to air pollution and climate change. Land use and transportation interactions. Bicycles, pedestrians, and traffic calming. Examples from the Boston area.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.252J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.540J",
            "in-charge":     [
                "Salvucci, F.",
                "Murga, M."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.252",
            "lecture-section-of": "1.252",
            "timeAndPlace":       "F2-5 5-217"
        },
        {
            "type":          "Class",
            "label":         "Transportation Policy and Environmental Limits",
            "id":            "1.253",
            "listing-index": "m1b-015",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Through a combination of lectures, cases, and class discussions the subject examines the economic and political conflict between transportation and the environment. Investigates the role of government regulation, green business and transportation policy as a facilitator of economic development and environmental sustainability. Analyzes a variety of international policy problems including government-business relations, the role of interest groups, non-governmental organizations, and the public and media in the regulation of the automobile; sustainable development; global warming; politics of risk and siting of transport facilities; environmental justice; equity; as well as transportation and public health in the urban metropolis. Provides students with an opportunity to apply transportation and planning methods to develop policy alternatives in the context of environmental politics.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.253J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.543J",
            "in-charge":     [
                "Coughlin, J.",
                "Salvucci, F."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Transport Modeling Course",
            "id":            "1.254",
            "listing-index": "m1b-016",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Fosters practical experience with the concepts and approaches behind the analytical chain composed by GIS, 4-step planning and traffic models. Study conducted in Greater Boston. Students develop road and street, pedestrian and public transportation networks. The latest CTPP data, and Boston home travel survey used to understand travel behavior and calibrate model. Final project involves the design of alternative futures for the metropolitan area with different transportation and land use policies. Basic programming experience required.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.254",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "in-charge":     "Murga, Mikel",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Transportation MEng Project",
            "id":            "1.255",
            "listing-index": "m1b-017",
            "course":        "1",
            "level":         "Grad",
            "units":         "5-0-10",
            "total-units":   15,
            "has-final":     false,
            "description":   "Core requirement for the Transportation MEng program.  Students work on projects related to ongoing MIT research programs with agencies, industries and government, such as the Chicago Transit Authority, Transport for London, or related transportation projects in the Boston area. An in-depth design study is carried out as a group effort and provides the background for individual student theses. Students must register for 1.255 for the Fall term, IAP, and the Spring term. Limited to Course 1 MEng students.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.255",
            "joint":         false,
            "semester":      [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     [
                "Wilson, N.",
                "Attanucci, J.",
                "Murga, M."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.255",
            "lecture-section-of": "1.255",
            "timeAndPlace":       "W10-12 1-375"
        },
        {
            "type":          "Class",
            "label":         "Public Transportation Systems",
            "id":            "1.258",
            "listing-index": "m1b-018",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Evolution and role of urban public transportation modes, systems, and services, focussing on bus and rail. Description of technological characteristics and their impacts on capacity, service quality, and cost. Current practice and new methods for data collection and analysis, performance monitoring, route design, frequency determination, and vehicle and crew scheduling. Effect of pricing policy and service quality on ridership. Methods for estimating costs associated with proposed service changes. Organizational models for delivering public transportation service including finance and operations.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.258J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.541J",
                "1.201J"
            ],
            "in-charge":     "Wilson, N. H. M.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Logistics Systems",
            "id":            "1.260",
            "listing-index": "m1b-019",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to supply chain management from both analytical and practical perspectives.  Stressing a unified approach, the course allows the student to develop a framework for making intelligent decisions within the supply chain.  Key logistics functions are covered to include demand planning, procurement, inventory theory and control, transportation planning and execution, reverse logistics, and flexible contracting.  Concepts explored include postponement, portfolio management, dual sourcing, and others.  Emphasis is placed on being able to recognize and manage risk, analyze various tradeoffs, and model logistics systems.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.260J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "15.770J",
            "in-charge":     [
                "Sheffi, Y.",
                "Caplice, C."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.260",
            "lecture-section-of": "1.260",
            "timeAndPlace":       "MW8.30-10 E51-315"
        },
        {
            "type":          "Class",
            "label":         "Case Studies in Logistics and Supply Chain Management",
            "id":            "1.261",
            "listing-index": "m1b-020",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "A combination of lectures and cases covering the strategic, management, and operating issues in contemporary logistics and integrated supply chain management. Includes: logistics strategy; supply chain restructuring and change management; and distribution, customer service, and inventory policy.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.261J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "15.771J",
            "in-charge":     "Byrnes, J.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Supply Chain Context",
            "id":            "1.262",
            "listing-index": "m1b-021",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Introduction to theory and practice of the core functions of the enterprises that impact supply chain management. Provides a basic understanding of strategy, industry structure, organization behavior, and marketing highlighted in the context of the supply chain. Uses lectures to introduce core functions and cases to illustrate the relationship and context for supply chain management. This results in a basic tool set to illustrate the theory and practice of analyzing and managing the relationship between supply chain management and the various functions of business. Also provides a solid understanding of supply chain management in practice. Core subject for MEng in Logistics.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.262J",
            "joint":         true,
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "in-charge":     [
                "Caplice, C.",
                "Goentzel, J."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Database, Internet, and Systems Integration Technologies",
            "id":            "1.264",
            "listing-index": "m1b-022",
            "course":        "1",
            "level":         "Grad",
            "units":         "5-0-7",
            "total-units":   12,
            "has-final":     false,
            "description":   "Information technology fundamentals: software process, data modeling, UML, relational databases and SQL. Internet technologies: http, xhtml, XML, Web services. Introduction to security. Fundamentals of telecommunications. Students complete project that covers requirements/design, data model, database implementation, website, and system architecture. No prior programming experience required.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.264J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Kocur, G.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.264",
            "lecture-section-of": "1.264",
            "timeAndPlace":       "MW1-2.30 4-231"
        },
        {
            "type":           "RecitationSection",
            "label":          "R021.264",
            "rec-section-of": "1.264",
            "timeAndPlace":   "F1-2.30 4-231"
        },
        {
            "type":          "Class",
            "label":         "International Supply Chain Management",
            "id":            "1.265",
            "listing-index": "m1b-023",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "An overview of globalization and the international environment: the international marketing, international finance and supply chain interface; global strategy for logistics and supply chain management; global supply chain models; role of government intervention and regulations; the role of international air and ocean carriers. Emphasis on both strategy formulation and implementation.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.265J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.965J",
                "15.765J",
                "1.260J",
                "1.261J",
                "1.262J",
                "15.760"
            ],
            "in-charge":     [
                "Marcus, H. S.",
                "Weiss, A."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Studies in Transportation",
            "id":            "1.27",
            "listing-index": "m1b-024",
            "course":        "1",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual advanced study of a topic in transportation systems, selected with the approval of the instructor.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.27",
            "joint":         false,
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Staff",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Logistics and Supply Chain Management",
            "id":            "1.270",
            "listing-index": "m1b-025",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Survey of Operations Research models and techniques developed for a variety of problems arising in logistical planning of multi-echelon systems. Focus on planning models for production/inventory/distribution strategies in general multi-echelon multi-item systems. Topics include vehicle routing problems, dynamic lot sizing inventory models, stochastic and deterministic multi-echelon inventory systems, the bullwhip effect, pricing models, and integration problems arising in supply chain management.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.270J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Simchi-Levi, D.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.270",
            "lecture-section-of": "1.270",
            "timeAndPlace":       "MW4-5.30 1-150"
        },
        {
            "type":          "Class",
            "label":         "Design and Operation of Logistics Facilities and Networks",
            "id":            "1.272",
            "listing-index": "m1b-026",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-1",
            "total-units":   3,
            "has-final":     false,
            "description":   "Exploration of the technological and managerial issues involved in the design and operation of distribution and logistics physical facilities and associated information technology in an enterprise wise supply chain. Includes day-long site visits to logistics operations in the local area, as well as day-long software tutorials on commercial-grade software packages used in the design of logistics networks. The curriculum also includes lectures and case studies from faculty and professional logistics consultants focusing on the design and operation of efficient logistics facilities.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.272J",
            "joint":         true,
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "prereq":        "1.260J",
            "in-charge":     "Caplice, C.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Supply Chain Planning",
            "id":            "1.273",
            "listing-index": "m1b-027",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Focuses on effective supply chain strategies for companies that operate globally, with emphasis on how to plan and integrate supply chain components into a coordinated system.  Students are exposed to concepts and models important in supply chain planning with emphasis on key tradeoffs and phenomena. Introduces and utilizes key tactics such as risk pooling and inventory placement, integrated planning and collaboration, and information sharing. Lectures, computer exercises, and case discussions introduce various models and methods for supply chain analysis and optimization. Recommended for Operations Management concentrators. First half-term subject.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.273J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "15.762J",
                "1.260J",
                "15.760",
                "15.761"
            ],
            "in-charge":     [
                "Graves, S. C.",
                "Simchi-Levi, D."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Manufacturing System and Supply Chain Design",
            "id":            "1.274",
            "listing-index": "m1b-028",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Focuses on decision making for system design, as it arises in manufacturing systems and supply chains. Students exposed to frameworks and models for structuring the key issues and trade-offs. Presents and discusses new opportunities, issues and concepts introduced by the internet and e-commerce. Introduces various models, methods and software tools for logistics network design, capacity planning and flexibility, make-buy, and integration with product development. Industry applications and cases illustrate concepts and challenges.  Recommended for Operations Management concentrators. Second half-term subject.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.274J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "15.763J",
                "1.260",
                "15.760",
                "15.761"
            ],
            "in-charge":     [
                "Graves, S. C.",
                "Simchi-Levi, D."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Cities and Regions: Urban Economics and Public Policy",
            "id":            "1.283",
            "listing-index": "m1b-029",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "The theory of urban land and housing markets, and the spatial development of cities. The roles played by transportation systems and local governments in shaping urban location patterns. Interregional competition, economic development, and the migration of labor and capital.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.283J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.410J",
                "14.573J",
                "14.03",
                "14.04"
            ],
            "in-charge":     "Wheaton, W.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Analyzing and Accounting for Regional Economic Change",
            "id":            "1.284",
            "listing-index": "m1b-030",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Surveys theories of regional growth, factor mobility, clustering, industrial restructuring, learning regions, and global supply chains from a political-economy perspective. Examines/critiques accounting frameworks including accounting for the underground economy, multipliers, linkages, and supply chains used to assess employment and environmental impacts, infrastructure investments. Assesses price indices, industrial location and employment measures, and shift-share analyses. Discussions of US and foreign applications.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.284J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.481J",
                "14.03",
                "14.04"
            ],
            "in-charge":     "Polenske, K. R.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "Regional Socioeconomic Impact Analyses and Modeling",
            "id":            "1.285",
            "listing-index": "m1b-031",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-1-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Reviews regional economic theories and models and provides students with experience in using alternative economic impact assessment models on microcomputers. Problem sets are oriented around infrastructure, housing, energy, and environmental issues. Students work with a client generally in Boston and make a presentation to the client. Emphasis on written and oral presentation skills.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.285J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.482J",
                "11.481J"
            ],
            "in-charge":     "Polenske, K. R.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.285",
            "lecture-section-of": "1.285",
            "timeAndPlace":       "W EVE (4-6 PM) 1-273"
        },
        {
            "type":          "Class",
            "label":         "Soil Behavior",
            "id":            "1.322",
            "listing-index": "m1b-032",
            "course":        "1",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Detailed study of soil properties with emphasis on interpretation of field and laboratory test data and their use in soft-ground construction engineering. Includes: consolidation and secondary compression; basic strength principles; stress-strain strength behavior of clays, emphasizing effects of sample disturbance, anisotropy, and strain rate; strength and compression of granular soils; and engineering properties of compacted soils. Some knowledge of field and laboratory testing assumed; 1.37 desirable.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.322",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.361",
            "in-charge":     "Whittle, A. J.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Advanced Soil Dynamics",
            "id":            "1.331",
            "listing-index": "m1b-033",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Review of linear vibration theory for single- and multiple degree-of-freedom systems and for continuous systems. Propagation of waves in soils; soil amplification in vertically inhomogeneous media, including iterative method for inelastic media.  Dynamic stiffness of foundations, vibration of machine foundations, effective motion of foundations for earthquake waves, inertial soil-structure interaction. Absorbing boundaries. Inelastic behavior of soils, non-linear  response of soils under dynamic loads. Sliding block analysis, dynamic slope stability, liquefaction.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.331",
            "joint":         false,
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Kausel, E.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Waste Containment and Remediation Technology",
            "id":            "1.34",
            "listing-index": "m1b-034",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Hazardous waste site remediation and waste disposal facility design. Introduction to hazardous waste including the definition of hazardous waste, regulatory requirements under RCRA and CERCLA, waste characteristics,  environmental chemistry, hydrology, and contaminant transport. Characterization of contaminated sites, preliminary site assessment, site investigation techniques, remediation technologies for soil and groundwater, risk assessment, and monitoring.  The design, construction, operation, and hydrology of landfills and waste disposal facilities.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.34",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.72",
            "in-charge":     "Shanahan, P.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Theoretical Soil Mechanics",
            "id":            "1.351",
            "listing-index": "m1b-035",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Presentation of fundamental theories in soil mechanics: field equations of linear elasticity and solutions of boundary value problems. Introduction to finite element method. Steady and transient flow in porous media; applications in confined and unconfined seepage, and one-dimensional consolidation. Introduction to poro-elasticity. Yielding and failure of soils; plasticity theory and limit analyses, with examples for bearing capacity and slope stability. Cam Clay models and critical state theory of soil behavior.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.351",
            "joint":         false,
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.361",
            "in-charge":     "Whittle, A. J.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.351",
            "lecture-section-of": "1.351",
            "timeAndPlace":       "TR9-10.30 1-375"
        },
        {
            "type":          "Class",
            "label":         "Advanced Soil Mechanics",
            "id":            "1.361",
            "listing-index": "m1b-036",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Presentation and application of principles of soil mechanics. Considers topics: the origin and nature of soils; soil classification; the effective stress principle; hydraulic conductivity and seepage; stress-strain-strength behavior of cohesionless and cohesive soils and application to lateral earth stresses, bearing capacity and slope stability; consolidation theory and settlement analyses; laboratory and field methods for evaluation of soil properties in design practice. Same lectures as 1.361.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.361",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.032",
                "1.366",
                "1.031"
            ],
            "in-charge":     "Jen, L. C.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.361",
            "lecture-section-of": "1.361",
            "timeAndPlace":       "TR10.30-12 1-375"
        },
        {
            "type":          "Class",
            "label":         "Advanced Geotechnical Engineering",
            "id":            "1.364",
            "listing-index": "m1b-037",
            "course":        "1",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     true,
            "description":   "testing), shallow (footings and raftings) and deep (piles and caissons) foundations, excavation support systems, groundwater control, slope stability, soil improvement (compaction, soil reinforcement, etc.), and construction monitoring. Core requirement for Geotechnical MEng program.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.364",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "coreq":         "1.361",
            "in-charge":     "Whittle, A. J.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.364",
            "lecture-section-of": "1.364",
            "timeAndPlace":       "MWF10 1-379"
        },
        {
            "type":           "RecitationSection",
            "label":          "R021.364",
            "rec-section-of": "1.364",
            "timeAndPlace":   "M1 1-379"
        },
        {
            "type":          "Class",
            "label":         "Geotechnical Engineering",
            "id":            "1.366",
            "listing-index": "m1b-038",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     true,
            "description":   "Presentation and application of principles of soil mechanics. Considers topics: the origin and nature of soils; soil classification; the effective stress principle; hydraulic conductivity and seepage; stress-strain-strength behavior of cohesionless and cohesive soils and application to lateral earth stresses, bearing capacity and slope stability; consolidation theory and settlement analyses; laboratory and field methods for evaluation of soil properties in design practice. Same lectures as 1.361.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.366",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.032",
                "1.361",
                "1.031"
            ],
            "in-charge":     "Jen, L. C.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.366",
            "lecture-section-of": "1.366",
            "timeAndPlace":       "TR10.30-12 1-375"
        },
        {
            "type":          "Class",
            "label":         "Geotechnical Measurements and Exploration",
            "id":            "1.37",
            "listing-index": "m1b-039",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-4-2",
            "total-units":   9,
            "has-final":     true,
            "description":   "testing. Extensive laboratory experiments to explore geotechnical test equipment and techniques. Laboratory use of testing automation and electronic instrumentation. Experiments include data analysis, evaluation, and presentation.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.37",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.031",
            "in-charge":     "Germaine, J. T.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.37",
            "lecture-section-of": "1.37",
            "timeAndPlace":       [
                "MW12 1-375",
                "F9 1-375"
            ]
        },
        {
            "type":           "LabSection",
            "label":          "B021.37",
            "lab-section-of": "1.37",
            "timeAndPlace":   "M1-5 1-334"
        },
        {
            "type":          "Class",
            "label":         "Engineering Geology",
            "id":            "1.38",
            "listing-index": "m1b-040",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Effect of geologic features and processes on constructed facilities; interaction between man-made structures and human activities in general, and the geologic environment. Planning of subsurface exploration. Engineering geologic characterization of soil and rock, including joint surveys and aspects of sedimented and residual soils. Laboratory on basic geologic identification and mapping techniques. Extensive reading of case histories. Field trip.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.38",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Einstein, H. H.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.38",
            "lecture-section-of": "1.38",
            "timeAndPlace":       "TR9-10.30 1-371"
        },
        {
            "type":          "Class",
            "label":         "Rock Mechanics",
            "id":            "1.381",
            "listing-index": "m1b-041",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Introduces theoretical and experimental aspects of rock mechanics and on this basis prepares the student for rock engineering. Includes review of laboratory and field testing; empirical and analytical methods for describing strength, deformability, and permeability of intact rock and rock masses; fracture mechanics and mechanics of discontinua including flow through discontinua; design and analysis of rock slopes and foundations on rock; and discussion of blasting design.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.381",
            "joint":         false,
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.38",
                "1.361"
            ],
            "in-charge":     "Einstein, H. H.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Underground Construction",
            "id":            "1.383",
            "listing-index": "m1b-042",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Familiarization with the most important aspects of planning, design, and construction of underground openings in soft ground and rock. Detailed engineering analysis and design. Major aspects of construction techniques and construction planning. Discussion of general planning and economic problems. Major design project.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.383",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.361",
                "1.38"
            ],
            "in-charge":     "Einstein, H. H.",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Studies in Geotechnical Engineering",
            "id":            "1.39",
            "listing-index": "m1b-043",
            "course":        "1",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.39",
            "joint":         false,
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Geoenvironmental and Geotechnical Engineering"
        },
        {
            "type":          "Class",
            "label":         "Project Management",
            "id":            "1.401",
            "listing-index": "m1b-044",
            "course":        "1",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Introduction to project management with emphasis on finance, evaluation, and organization.  Topics include cost benefit analysis, resource and cost estimation, and project control and delivery.  Case studies used to demonstrate relevant issues.  Students taking graduate version complete additional assignments.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.401J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.040",
            "in-charge":     "Moavenzadeh, F.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":          "Class",
            "label":         "International Construction Finance",
            "id":            "1.45",
            "listing-index": "m1b-045",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Examination of financing methods and structure, project financial evaluation, and financial management in the domestic and international construction industry. Analytical concepts and methodologies from modern finance theory and practice presented in lecture/discussions and applied to case analyses including problems in cash-flow analysis, corporate financial structure, project finance, and foreign exchange exposure. Innovative financial securities, such as options, and methods such as privatization and sale-leaseback are examined. Prior subjects in microeconomics, accounting, and/or corporate finance desirable but not required.  Half-term subject offered in the second half of term.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.45J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.341J",
            "in-charge":     "Samii, M. V.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":          "Class",
            "label":         "Strategic Leadership in Real Estate and Construction",
            "id":            "1.46",
            "listing-index": "m1b-046",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Examines the fundamental concepts of strategic planning and management in the context of the real estate, design, and construction industry. Basic business relationships among firms in the design and construction value chain. Topics include industry analysis, strategic planning models, information technology strategy, strategy in fragmented industries, negotiation, and macro trends shaping the industry as a whole. Case method of instruction is used, and supplemented by extensive readings. Half term subject taught in the first half of the term.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.46J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.348J",
            "in-charge":     "Macomber, J.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":          "Class",
            "label":         "Entrepreneurship in Construction and Real Estate Development",
            "id":            "1.462",
            "listing-index": "m1b-047",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Explains role of the entrepreneur in the construction industry using case studies to outline different steps in developing construction enterprises. Emphasis on strategic marketing component in the development of these businesses. Lectures address program, development, and construction management services. Guest lectures from entrepreneurs in their field. Team project identifying an opportunity and developing a strategic marketing/business plan for a company in the design/construct or related industries.  Half-term subject offered in second half of term.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.462J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.345J",
            "in-charge":     "Kennedy, J. F.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.462",
            "lecture-section-of": "1.462",
            "timeAndPlace":       "M10.30-12.30 (BEGINS OCT 20) W31-301"
        },
        {
            "type":          "Class",
            "label":         "The Impact of Globalization on the Built Environment",
            "id":            "1.463",
            "listing-index": "m1b-048",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Addresses the importance and pervasiveness of Globalization in Architecture, Engineering and Construction Companies (AEC Firms). Covers strategies for a presence in the global market and the importance of the global financial market in project financing, with a primary focus on infrastructure. Includes discussion of innovative approaches to marketing, partnering, risk management, finance, specialized delivery systems, and privatization.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.463J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.342J",
            "in-charge":     [
                "Moavenzadeh, F.",
                "Wolff, D."
            ],
            "area":          "Construction Engineering and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "L011.463",
            "lecture-section-of": "1.463",
            "timeAndPlace":       "M3-5 5-232"
        },
        {
            "type":          "Class",
            "label":         "E-Commerce and the Internet in Real Estate and Construction",
            "id":            "1.464",
            "listing-index": "m1b-049",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Examines long-term effects of information technology on business strategy in the real estate and construction industry. Considerations include: supply chain, allocation of risk, impact on contract obligations and security, trends toward consolidation, and the convergence of information transparency and personal effectiveness. Resources drawn from the world of dot-com entrepreneurship and \\\u0022old economy\\\u0022 responses. Taught by case study method. Half-term subject offered in the first half of term.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.464J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.343J",
            "in-charge":     "Macomber, J.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":          "Class",
            "label":         "Innovative Project Delivery in the Public and Private Sectors",
            "id":            "1.472",
            "listing-index": "m1b-050",
            "course":        "1",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Examines the compatibility of various project delivery methods, consisting of organizations, contracts, and award methods, with certain types of projects and owners. Six methods examined: traditional general contracting; construction management; multiple primes; design-build; turnkey; and build-operate-transfer. Consists of lectures, case studies, guest speakers, and a team project to analyze a case example. Half-term subject offered in second half of term.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.472J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "11.344J",
            "in-charge":     "Gordon, C. M.",
            "area":          "Construction Engineering and Management"
        },
        {
            "type":          "Class",
            "label":         "Studies in Construction Engineering and Management",
            "id":            "1.482",
            "listing-index": "m1b-051",
            "course":        "1",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual study of an advanced topic in construction engineering and management, selected with approval of faculty supervisor.",
            "url":           "http://student.mit.edu/catalog/m1b.html#1.482",
            "joint":         false,
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Moavenzadeh, F.",
            "area":          "Construction Engineering and Management"
        }
    ]
}