{
    "items": [
        {
            "type":          "Class",
            "label":         "How to Stage a Revolution",
            "id":            "21H.001",
            "listing-index": "m21Ha-000",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores fundamental questions about the causes and nature of revolutions by looking at how people overthrow their rulers and establish new governments. Considers a set of major political transformations throughout the world and across centuries to understand the meaning of revolution and evaluate its impact. Examines how revolutionaries have attempted to establish their ideals and realize their goals. Asks whether radical upheavals require bloodshed, violence, or even terror. Goal is to explain why some revolutions succeed and others fail. Materials include the writings of revolutionaries, declarations and constitutions, music, films, art, novels, memoirs, and newspapers.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.001",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     [
                "Broadhead, W.",
                "Jacobs, M.",
                "Perdue, P. C."
            ]
        },
        {
            "type":          "Class",
            "label":         "American History to 1865",
            "id":            "21H.101",
            "listing-index": "m21Ha-001",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "A basic history of American social, economic, and political development from the colonial period through the Civil War. Examines the colonial heritages of Spanish and British America; the American Revolution and its impact; the establishment and growth of the new nation; and the Civil War, its background, character, and impact. Readings include writings of the period by Winthrop, Paine, Jefferson, Madison, W. H. Garrison, G. Fitzhugh, H. B. Stowe, and Lincoln.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.101",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Maier, P.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "American History since 1865",
            "id":            "21H.102",
            "listing-index": "m21Ha-002",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines the history of American politics, economics, and society from the Civil War to the present. Use of secondary accounts and primary documents such as court cases, letters and diaries, photographs, and films to examine some of the key issues in the development of modern America: industrialization and urbanization, US emergence as a global power, growth of consumer culture, and the development of the civil rights movement.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.102",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Capozzola, C.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "American Indian History From Columbus to the Present",
            "id":            "21H.103",
            "listing-index": "m21Ha-003",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "An introduction to American Indian history since 1492, with an emphasis on its environmental dimensions.  Topics include indigenous societies before the arrival of Europeans, epidemics and colonialism, the fur trade, federal Indian policy and the white-Indian wars, life on the reservations, struggles for land and native hunting and fishing rights, American Indian identity in law and popular culture, casinos, and American Indians and environmental politics.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.103",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Buchanan, N.",
            "area":          "American History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.103-1",
            "lecture-section-of": "21H.103",
            "timeAndPlace":       "MW 14:30-16:00 1-273"
        },
        {
            "type":          "Class",
            "label":         "Riots, Strikes, and Conspiracies in American History",
            "id":            "21H.104J",
            "listing-index": "m21Ha-004",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Readings and discussions focusing on a series of short-term events that shed light on American politics, culture, and social organization. The events studied in 2006 were the Boston Tea Party of 1773; the crisis at Boston over the case of Anthony Burns, an escaped slave, in 1854; the Homestead strike of 1892; and the student uprisings at Columbia University in 1968. Emphasis on finding ways to make sense of these complicated, highly traumatic events, and on using them to understand larger processes of change in American history.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.104J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "prereq":        "11.015J",
            "in-charge":     "Fogelson, R. M.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "American Classics",
            "id":            "21H.105",
            "listing-index": "m21Ha-005",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "An examination of classic documents in American history from the 17th through the 20th centuries, including writings by authors such as John Winthrop, Thomas Jefferson, and James Madison; Frederick Douglass, William Lloyd Garrison, and Abraham Lincoln; Horatio Alger, Franklin D. Roosevelt, Betty Friedan, and Martin Luther King, Jr. Possible materials include music, taped speeches, television programs, and motion pictures.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.105",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Maier, P.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "The American Revolution",
            "id":            "21H.112",
            "listing-index": "m21Ha-006",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "English and American backgrounds of the Revolution; issues and arguments in the Anglo-American conflict; colonial resistance and the beginnings of republicanism; the Revolutionary War; constitution writing for the states and nation; and effects of the American Revolution. Concerned primarily with the revolutionary origins of American government. Readings emphasize documents from the period--pamphlets, correspondence, the minutes or resolutions of resistance organizations, constitutional documents and debates.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.112",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Maier, P.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "The Civil War and Reconstruction",
            "id":            "21H.116J",
            "listing-index": "m21Ha-007",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Anti-slavery and the intensification of sectionalism in the 1850s; the secession crisis; political and military developments in the Civil War years; why the North won; and the political, economic, and social legacies of the conflict.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.116J",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "HASS Elective",
            "in-charge":     "Smith, M. R.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "America in Depression and War",
            "id":            "21H.126",
            "listing-index": "m21Ha-008",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "The Great Depression and World War II permanently changed American politics and society. Topics include: the Great Crash, the New Deal, Roosevelt, the home front, the Normandy Invasion, and the atomic bomb. Explores those events through film, posters, newspapers, and other historical documents.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.126",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Jacobs, M.",
            "area":          "American History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.126-1",
            "lecture-section-of": "21H.126",
            "timeAndPlace":       "MW 13:00-14:30 66-160"
        },
        {
            "type":          "Class",
            "label":         "The United States in the Nuclear Age: Politics, Culture, and Society Since 1941",
            "id":            "21H.131",
            "listing-index": "m21Ha-009",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "American experience at home and abroad from Pearl Harbor to the end of the Cold War. Topics include: America's role as global superpower, foreign and domestic anticommunism, social movements of left and right, suburbanization, and popular culture.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.131",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Jacobs, M.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "Introduction to Asian American Studies: Literature, Culture, and Historical Experience",
            "id":            "21H.150J",
            "listing-index": "m21Ha-010",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "An interdisciplinary subject that draws on literature, history, anthropology, film, and cultural studies to examine the experiences of Asian Americans in US society. Covers the first wave of Asian immigration in the 19th century, the rise of anti-Asian movements, the experiences of Asian Americans during WWII, the emergence of the Asian American movement in the 1960s, and the new wave of \"post-1965\" Asian immigration. Examines the role these historical experiences played in the formation of Asian American ethnicity, and explores how these experiences informed Asian American literature and culture. Addresses key societal issues such as racial stereotyping, media racism, affirmative action issues, the glass ceiling, the \"model minority\" syndrome, and anti-Asian harassment or violence. Taught in English.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.150J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Teng, E.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "American Consumer Culture",
            "id":            "21H.206",
            "listing-index": "m21Ha-011",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines how and why twentieth-century Americans came to define the \"good life\" through consumption, leisure, and material abundance.  Explores how such things as department stores, advertising, mass-produced cars, and suburbs transformed the American economy, society, and politics.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.206",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Jacobs, M.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "Migration and Immigration in US History",
            "id":            "21H.221J",
            "listing-index": "m21Ha-012",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines the history of the United States as a \"nation of immigrants\" within a broader global context. Considers migration from the mid-19th century to the present through case studies of such places as New York's Lower East Side, South Texas, Florida, and San Francisco's Chinatown.  Examines the role of memory, media, and popular culture in shaping ideas about migration. Includes optional field trip to New York City.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.221J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "prereq":        "11.019J",
            "in-charge":     "Capozzola, C.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "War and American Society",
            "id":            "21H.223",
            "listing-index": "m21Ha-013",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Throughout American history, the experience of war has shaped the ways that Americans think about themselves, their fellow citizens, and the meanings of American citizenship. Examines how Americans have told the stories of modern war in history, literature, and popular culture from the Civil War to the present, and interprets those documents in terms of changing ideas about American identity.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.223",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Capozzola, C.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "Constitutional Law in US History",
            "id":            "21H.224",
            "listing-index": "m21Ha-014",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces major themes and patterns of change in American constitutional law since 1787, including federal-state relations, racial and gender equality, economic regulation, and civil liberties. Readings consist of original court cases, especially from the US Supreme Court, including cases of the current term. Emphasis on the historical development of constitutional law and on the relationship between the Supreme Court and broader social, political, and cultural trends.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.224",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Capozzola, C.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "Gender and the Law in US History",
            "id":            "21H.225J",
            "listing-index": "m21Ha-015",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores the legal history of the US as a gendered system. Examines how women have shaped the meanings of American citizenship through pursuit of political rights such as suffrage, jury duty, and military service, as well as how the legal system has shaped gender relations for both women and men through regulation of such issues as marriage, divorce, work, reproduction, and the family. Readings draw from primary and secondary materials, focusing on the broad historical relationship between law and society. No legal knowledge is required or assumed.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.225J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "prereq":        "SP.607J",
            "in-charge":     "Capozzola, C.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "American Urban History I",
            "id":            "21H.231J",
            "listing-index": "m21Ha-016",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Seminar on the history of institutions and institutional change in American cities from roughly 1850 to the present.  Among the institutions to be looked at are political machines, police departments, courts, schools, prisons, public autorities, and universities.  Focuses on readings and discussions.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.231J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "prereq":        "11.013J",
            "in-charge":     "Fogelson, R. M.",
            "area":          "American History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.231J-1",
            "lecture-section-of": "21H.231J",
            "timeAndPlace":       "T 14:00-16:00 3-401"
        },
        {
            "type":          "Class",
            "label":         "American Urban History II",
            "id":            "21H.232J",
            "listing-index": "m21Ha-017",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Seminar on the history of selected features of the physical environment of urban America. Among the features considered are parks, cemeteries, tenements, suburbs, zoos, skyscrapers, department stores, supermarkets, and amusement parks. Focuses on readings and discussions.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.232J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "prereq":        "11.014J",
            "in-charge":     "Fogelson, R. M.",
            "area":          "American History"
        },
        {
            "type":          "Class",
            "label":         "Downtown",
            "id":            "21H.234J",
            "listing-index": "m21Ha-018",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Seminar on downtown in US cities from the late 19th century to the late 20th. Emphasis on downtown as an idea, place, and cluster of interests, on the changing character of downtown, and on recent efforts to rebuild it. Considers subways, skyscrapers, highways, urban renewal, and retail centers. Focus on readings, discussions, and individual research projects. Meets with graduate subject 11.339, but assignments differ.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.234J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "prereq":        [
                "11.026J",
                "11.339"
            ],
            "in-charge":     "Fogelson, R. M.",
            "area":          "American History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.234J-1",
            "lecture-section-of": "21H.234J",
            "timeAndPlace":       "R 14:00-16:00 3-401"
        },
        {
            "type":          "Class",
            "label":         "The Ancient World: Greece",
            "id":            "21H.301",
            "listing-index": "m21Ha-019",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "History of Ancient Greece from the Bronze Age to the death of Alexander. Major social, economic, political, and religious trends. Homer, heroism, and the Greek identity; the hoplite revolution and the rise of the city-state; Herodotus, Persia, and the (re)birth of history; Empire, Thucydidean rationalism, and the Peloponnesian War; Aristotle, Macedonia, and Hellenism. Emphasis on use of primary sources in translation.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.301",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Ostrow, S.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "The Ancient World: Rome",
            "id":            "21H.302",
            "listing-index": "m21Ha-020",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "History of Rome from its humble beginnings to the 5th century A.D. First half: Kingship to Republican form; the conquest of Italy; Roman expansion: Pyrrhus, Punic Wars and provinces; classes, courts, and the Roman revolution; Augustus and the formation of empire. Second half: Virgil to the Vandals; major social, economic, political and religious trends at Rome and in the provinces. Emphasis on use of primary sources in translation.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.302",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Broadhead, W.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.302-1",
            "lecture-section-of": "21H.302",
            "timeAndPlace":       "MW 12:00-13:00 6-120"
        },
        {
            "type":           "RecitationSection",
            "label":          "R21H.302-2",
            "rec-section-of": "21H.302",
            "timeAndPlace":   "R 12:00-13:00 66-156"
        },
        {
            "type":           "RecitationSection",
            "label":          "R21H.302-3",
            "rec-section-of": "21H.302",
            "timeAndPlace":   "F 13:00-14:00 56-162"
        },
        {
            "type":           "RecitationSection",
            "label":          "R21H.302-4",
            "rec-section-of": "21H.302",
            "timeAndPlace":   "F 15:00-16:00 56-162"
        },
        {
            "type":          "Class",
            "label":         "The Middle Ages:  500-1300",
            "id":            "21H.306",
            "listing-index": "m21Ha-021",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Survey of the history of western Europe, Byzantium, and the Islamic World between 200 and 1500. Topics include the late Roman Empire and the \"barbarian\" invasions; the emergence of Christianity and the Church; the formation of the Carolingian, Byzantine, and Islamic empires; the Vikings and Mongols; castles, knights, and \"feudalism\"; medieval warfare and the crusades; religious thinkers, reformers, and heretics; the experience of women and Jews; the rise of cities and trade; the Black Death and the fall of Constantinople.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.306",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Goldberg, E.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.306-1",
            "lecture-section-of": "21H.306",
            "timeAndPlace":       "TR 11:00-12:30 1-246"
        },
        {
            "type":          "Class",
            "label":         "The Vikings",
            "id":            "21H.308",
            "listing-index": "m21Ha-022",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores the complex relationship of the Vikings with the medieval world, examines developments within Scandinavian society such as state formation, social structures, trade, shipbuilding, slavery, urban growth, and Christianization. Considers the methodological difficulties presented by the diverse and often contradictory historical sources for information about the Vikings, such as monastic chronicles, archaeology, coin hoards, stone inscriptions, and sagas.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.308",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Goldberg, E.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.308-1",
            "lecture-section-of": "21H.308",
            "timeAndPlace":       "T 19:00-22:00 E51-372"
        },
        {
            "type":          "Class",
            "label":         "The Renaissance: 1300-1600",
            "id":            "21H.311",
            "listing-index": "m21Ha-023",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "European history from the 14th through the 16th century. Consideration of political, social, artistic, and scientific developments during this period of transition to the modern world. Examines the connections between Renaissance Humanism and the Protestant and Catholic reform movements of the 16th century. Studies works by Petrarch, Machiavelli, Brunelleschi, Leonardo, Erasmus, More, Luther, and Montaigne.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.311",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ravel, J.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "The Royal Family",
            "id":            "21H.342",
            "listing-index": "m21Ha-024",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "An exploration of the changing role of the monarchy in British politics and culture, beginning with the accession of the House of Hanover (later Windsor) in 1714. The dynasty has encountered a series of crises, in which the personal and the political have been inextricably combined: for example, George III's mental illness; the scandalous behavior of his son, George IV; Victoria's withdrawal from public life after the death of Prince Albert; the abdication of Edward VIII; and the public antagonism sparked by sympathy for Diana, Princess of Wales. In addition to readings, materials include portraits, news footage, and films.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.342",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "HASS Elective",
            "in-charge":     "Ritvo, H.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "France 1660-1815:  Enlightenment, Revolution, Napoleon",
            "id":            "21H.346",
            "listing-index": "m21Ha-025",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "French politics, culture, and society from Louis XIV to Napoleon Bonaparte. Attention given to the growth of the central state, the beginnings of a modern consumer society, the Enlightenment, the origins and course of the French Revolution, and the rise and fall of Napoleon.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.346",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ravel, J.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "The Making of a Roman Emperor",
            "id":            "21H.402",
            "listing-index": "m21Ha-026",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Through close examination of the emperor Augustus and his Julio-Claudian successors, this subject investigates how Roman emperors used art, architecture, coinage, and other media to create and project an image of themselves, how the surviving literary sources from the Roman period reinforced or subverted that image, and how both phenomena have contributed to post-classical perceptions of Roman emperors. Also considers works of Suetonius and Tacitus, and modern representations of the emperors such as those found in the films I, Claudius and Quo Vadis?.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.402",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Broadhead, W.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "The Ancient City",
            "id":            "21H.405J",
            "listing-index": "m21Ha-027",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Historical topography of the Greek and Roman city. Investigates the relationship between urban architecture and the political, social, and economic role of cities in the Greek and Roman world. Analyzes a range of archaeological and literary evidence relevant to the use of space in Greek and Roman cities (Athens, Paestum, Rome, and Pompeii). Subjects of detailed study include the sanctuary of Athena on the Athenian Acropolis, the atrium houses of Roman Pompeii, the Athenian Agora and the Roman Forum, feeding the ancient city, and the great bath complexes of Imperial Rome.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.405J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "prereq":        "11.012J",
            "in-charge":     "Broadhead, W.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.405J-1",
            "lecture-section-of": "21H.405J",
            "timeAndPlace":       "TR 14:30-16:00 33-319"
        },
        {
            "type":          "Class",
            "label":         "History of Western Thought, 500-1300",
            "id":            "21H.411",
            "listing-index": "m21Ha-028",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines the development of the western intellectual tradition from the fall of the Roman Empire through the High Middle Ages. Basic premise is that the triumph of Christianity in Europe was not the inevitable outcome it appears from hindsight. Attention is therefore focused not only on the development of Christian thought and practice, but on its challengers as well. Particular emphasis devoted to Nordic paganism, the rise of Islam, Byzantine orthodoxy, indigenous heretical movements, and the ambiguous position of Jews in European society.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.411",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "McCants, A.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "Medieval Economic History in Comparative Perspective",
            "id":            "21H.416J",
            "listing-index": "m21Ha-029",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Surveys the conditions of material life and changing social and economic relations in medieval Europe using the comparative context of contemporary Islamic, Chinese, and Japanese experiences. Covers the emergence and decline of feudal institutions, the transformation of peasant agriculture, living standards and the course of epidemic disease, and the ebb and flow of long-distance trade across the Eurasian system. Particular emphasis placed on the study of those factors, both institutional and technological, which contributed to the emergence of capitalist organization and economic growth in western Europe in contrast to the trajectories followed by the other major medieval economies.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.416J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS-D 5",
            "prereq":        "14.70J",
            "in-charge":     "McCants, A.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.416J-1",
            "lecture-section-of": "21H.416J",
            "timeAndPlace":       "M 9:30-11:00 4-231"
        },
        {
            "type":           "RecitationSection",
            "label":          "R21H.416J-2",
            "rec-section-of": "21H.416J",
            "timeAndPlace":   "W 9:30-11:00 66-156"
        },
        {
            "type":          "Class",
            "label":         "From Print to Digital: Technologies of the Word, 1450-Present",
            "id":            "21H.418",
            "listing-index": "m21Ha-030",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores the impact of new technology on the recording and distribution of words at three different times: the invention of the printing press ca. 1450; the adaptation of electricity to communication technology in the nineteenth century (telegraph, telephone, phonograph); and the emergence of digital media today. Assignments include essays and online projects.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.418",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ravel, J.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "Introduction to Environmental History",
            "id":            "21H.421",
            "listing-index": "m21Ha-031",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focusing primarily on the period since 1500, explores the influence of climate, topography, plants, animals, and microorganisms on human history and the reciprocal influence of people on the environment. Topics include the European encounter with the Americas, the impact of modern technology, and the historical roots of the current environmental crisis.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.421",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Ritvo, H.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.421-1",
            "lecture-section-of": "21H.421",
            "timeAndPlace":       "T 14:30-16:00 E51-372"
        },
        {
            "type":           "RecitationSection",
            "label":          "R21H.421-2",
            "rec-section-of": "21H.421",
            "timeAndPlace":   "R 14:30-16:00 E51-372"
        },
        {
            "type":          "Class",
            "label":         "The Age of Reason: Europe from the 17th to the Early 19th Centuries",
            "id":            "21H.433",
            "listing-index": "m21Ha-032",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "A study of the evolution of European society from the end of the 17th to mid-19th century: its politics, the nature of its social system, the workings of its economy, and its intellectual accomplishments. Particular attention given to the analyses made by critics and contemporary thinkers to the matters treated in the subject, such as Descartes, Spinoza, Voltaire, Locke, Rousseau, Hegel, and Marx.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.433",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Ravel, J.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.433-1",
            "lecture-section-of": "21H.433",
            "timeAndPlace":       "MW 11:00-12:30 2-132"
        },
        {
            "type":          "Class",
            "label":         "Revolutionary Europe, 1789-1989",
            "id":            "21H.441",
            "listing-index": "m21Ha-033",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines European history through the lens of one recurrent event  the political and social upheaval of revolution. Explores how ideology and economy combine to force social and political change. Focuses on the French Revolution of 1789, the Paris commune of 1871, the fascist counter-revolutions in Italy and Germany, and the revolt against communism in central Europe in 1989.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.441",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ciarlo, D.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "European Imperialism in the 19th and 20th Centuries",
            "id":            "21H.443",
            "listing-index": "m21Ha-034",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores the history of European imperialism in its political, economic, and cultural dimensions. Examines the role imperialism played in the development of European society and culture in the 19th and 20th centuries, alongside case studies of the experiences of the colonized in Africa, India, and Asia. Topics include: colonial economics in European industrialization; imperial science and the rise of \"scientific\" racism; the myth of empire in European national identity; class and gender in imperial ideology; \"modernization\" and cultural transformation in the colonies; decolonization; and globalization in the post-colonial world.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.443",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "HASS Elective",
            "in-charge":     "Ciarlo, D.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "Nazi Germany and the Holocaust",
            "id":            "21H.447",
            "listing-index": "m21Ha-035",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "German history in the early 20th century, focusing on the rise and fall of Nazism through readings from the time and interpretations by historians. Topics include: the roots of racist thought in Imperial Germany, the impact of the First World War; the flowering of culture in the Weimar Republic and the  reaction to it;  Nazism as political coup or social movement; the structure of the Nazi state; the experience of the Second World War in Germany and Europe; the origins of the Holocaust; and the memory of Nazism and of the Holocaust in post-war Germany.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.447",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Ciarlo, D.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "Imperial and Revolutionary Russia: Culture and Politics",
            "id":            "21H.466",
            "listing-index": "m21Ha-036",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Analyzes Russia's social, cultural, and political heritage. Compares reforming and revolutionary impulses in the context of serfdom, the rise of the intelligentsia, and debates over capitalism. Focuses on historical and literary texts, especially the intersections between the two.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.466",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Wood, E.",
            "area":          "European History"
        },
        {
            "type":          "Class",
            "label":         "Soviet and Post-Soviet Politics and Society, 1917-Present",
            "id":            "21H.467J",
            "listing-index": "m21Ha-037",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Explores political and historical evolution of Soviet state and society from 1917 Revolution to its demise in 1991. Subject covers the creation of a revolutionary regime; causes and nature of the Stalin revolution; post-Stalinist efforts to achieve radical political and social reform; and causes of the Soviet collapse. Also examines current developments in Russia in light of Soviet history.",
            "url":           "http://student.mit.edu/catalog/m21Ha.html#21H.467J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS-D 4",
            "prereq":        "17.57J",
            "in-charge":     "Wood, E.",
            "area":          "European History"
        },
        {
            "type":               "LectureSection",
            "label":              "L21H.467J-1",
            "lecture-section-of": "21H.467J",
            "timeAndPlace":       "TR 13:00-14:30 66-160"
        }
    ]
}