{
    "items": [
        {
            "type":          "Class",
            "label":         "East Asia in the World: 15002000 A.D.",
            "id":            "21H.504",
            "listing-index": "m21Hb-000",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines the interactions of East Asia with the rest of the world and the relationships of each of the East Asian countries with each other, from ca. 1500 to 2000 A.D. Primary focus on China and Japan, with some reference to Korea, Vietnam, and Central Asia. Asks how international diplomatic, commercial, military, religious, and cultural relationships joined with internal processes to direct the development of East Asian societies. Addresses perceptions and misperceptions among East Asians and foreigners.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.504",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      [
                "HASS-D 5",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Chapman, I.",
            "area":          "Asian History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.504",
            "lecture-section-of": "21H.504",
            "timeAndPlace":       "MW9.30-11 2-146"
        },
        {
            "type":          "Class",
            "label":         "Ancient Japan and the Courtly Society",
            "id":            "21H.521",
            "listing-index": "m21Hb-001",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Japanese history and culture from earliest times to the late twelfth century. Covers prehistoric cultures, creation myths, native and borrowed beliefs (Shinto, Buddhism, and Confucianism), the origins of the imperial dynasty, and the emergence of a highly aesthetic court society sometimes called \\\u0022the world of the shining prince.\\\u0022 Readings include many writings in translation (poems, prayers, popular tales, classics by women, etc.). Early art is introduced.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.521",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Staff",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "Japan in the Age of the Samurai: History and Film",
            "id":            "21H.522",
            "listing-index": "m21Hb-002",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Medieval Japanese society and culture from the twelfth to the nineteenth centuries, when political power rested largely in the hands of feudal warriors. Topics include religion (especially Zen Buddhism); changing concepts of \\\u0022the way of the warrior;\\\u0022 women under feudalism; popular culture; and protest and rebellion. Presentations include weekly feature films. Assigned readings include many literary writings in translation.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.522",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Staff",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "History of Modern Japan, 1853-2000",
            "id":            "21H.523",
            "listing-index": "m21Hb-003",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Covers Japan\\'s emergence as a modern state and global power.  Examines the end of the policy of national seclusion and crumbling of Tokugawa rule, the formation of the modern Meiji state (1868-1912), Japanese imperialism, social and political movements, the costs of rapid modernization, the road to war and defeat in World War II, the U.S. occupation, the postwar economic miracle, \\\u0022internationalization\\\u0022, and the social and cultural transformations of the 1980s and 1990s.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.523",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS-D 5",
            "in-charge":     "Cutler, M. G.",
            "area":          "Asian History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.523",
            "lecture-section-of": "21H.523",
            "timeAndPlace":       "TR11-12.30 E51-057"
        },
        {
            "type":          "Class",
            "label":         "World War II in Asia: Film, Fantasy, Fact",
            "id":            "21H.546",
            "listing-index": "m21Hb-004",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Propaganda and ideology in World War II, as seen especially through Japanese and American eyes, from the invasion of China in 1937 through the use of the atomic bomb and Japan\\'s surrender in 1945. This graphic cross-cultural approach raises questions of national and racial stereotyping, and challenges students to assess how the role of prejudice, emotion, and irrationality influenced wartime policies and shaped perceptions of the enemy. Uses extensive written materials from the Japanese side and a large number of visual materials including classic wartime films from both sides.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.546",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Cutler, M. G.",
            "area":          "Asian History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.546",
            "lecture-section-of": "21H.546",
            "timeAndPlace":       "M EVE (7-10 PM) 4-249"
        },
        {
            "type":          "Class",
            "label":         "Smashing the Iron Rice Bowl: Chinese East Asia",
            "id":            "21H.560",
            "listing-index": "m21Hb-005",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Examines the experiences of ordinary Chinese people as they lived through tumultous change in the 20th century. Class discussion focuses on personal memoirs and films.  Includes comparisons between the People\\'s Republic of China, Taiwan, and Hong Kong.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.560",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Chapman, I.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "History of Modern South Asia",
            "id":            "21H.571",
            "listing-index": "m21Hb-006",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Survey of Indian civilization from 2500 BC to present day. Traces major political events as well as economic, social, ecological, and cultural developments. Primary and secondary readings enhance understanding of this unique civilization, and shape and improve understanding in analyzing and interpreting historical data. Examines major thematic debates in Indian history through class discussion.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.571",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Roy, H.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "Religion and Politics in Modern South Asia",
            "id":            "21H.573",
            "listing-index": "m21Hb-007",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines how religion and politics have shaped identities, societies and the historical past in modern South Asia. Explores the growth and dissemination of major South Asian religions including Hinduism, Islam, Buddhism, Jainism and Sikhism in ancient and early modern India. Focuses on formation of religious identities within the politics of nationalism and colonialism. Examines how religion has influenced recent geopolitics of South Asia, with specific focus on India, Pakistan, and Bangladesh.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.573",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Roy, H.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "Women in South Asia from 1800 to Present",
            "id":            "21H.575",
            "listing-index": "m21Hb-008",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Exploration of the changes and continuities in the lives of South Asian women. Using gender as a lens, examines how politics of race, class, caste, and religion have affected women in South Asian countries, primarily in India, Pakistan, Bangladesh and Sri Lanka. Current debates within South Asian women\\'s history illustrate the issues and problems that arise in re-writing the past from a gendered perspective. Primary documents, secondary readings, films, newspaper articles, and the Internet.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.575J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "prereq":        "SP.459J",
            "in-charge":     "Roy, H.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "Film, Fiction, and History in India, 1905-2005",
            "id":            "21H.577",
            "listing-index": "m21Hb-009",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines how the history of modern India has been recorded and reconstructed in diverse media. Primary documents, films, novels, short stories and secondary documents written by historians serve as tools of analysis to explore the connections between history and popular culture. Themes include Indian nationalism, British imperialism, Partition and Independence, communalism, urban-rural linkages, and the construction of class, caste, and gendered identities.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.577J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Roy, H.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "Gandhi\\'s India",
            "id":            "21H.579",
            "listing-index": "m21Hb-010",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Mohandas K. Gandhi\\'s iconic status, both in India and abroad, owes much to his leadership role in the struggle for Indian independence from British rule. Gandhi\\'s philosophy of non-violence, political morality, and his critique of western modernity were developed in the context of the history of the Indian nationalist movement and are inextricably linked to it. Examines the emergence of Gandhi and his legacy within the context of the anti-colonial nationalist movement in India. Introduction to the tools of the historian\\'s craft such as interpretation based on critical reading of primary texts and secondary historical analyses.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.579",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Roy, H.",
            "area":          "Asian History"
        },
        {
            "type":          "Class",
            "label":         "From the Silk Road to the Great Game:  China, Russia, and Central Asia, 500-2000 A.D.",
            "id":            "21H.580",
            "listing-index": "m21Hb-011",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines interactions across the Eurasian continent between Russians, Chinese, Mongolian nomads, and Turkic oasis dwellers during the last millennium and a half. As empires rose and fell, religions, trade, and war flowed back and forth continuously across this vast space. Britain and Russia competed for power over Eurasia in the \\\u0022Great Game\\\u0022 of geopolitics in the 19th century, just as China, Russia, and others did in the 20th century. Today, the fall of the Soviet Union and China\\'s reforms have opened new opportunities for cultural interaction. Topics include the religious traditions of Central Asian Islam, Buddhism, Christianity, and Confucianism; caravans and travelers like Marco Polo and Rabban Sauma, the first Chinese to travel to the West; and nomadic conquest and imperialist competition, past and present. Source materials include primary documents, travelogues, films, and music from Yo Yo Ma\\'s Silk Road Project.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.580",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Chapman, I.",
            "area":          "Asian History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.580",
            "lecture-section-of": "21H.580",
            "timeAndPlace":       "MW1-2.30 1-371"
        },
        {
            "type":          "Class",
            "label":         "Islam, the Middle East, and the West",
            "id":            "21H.601",
            "listing-index": "m21Hb-012",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Provides students with an overview of basic themes and issues in Middle Eastern history from the rise of Islam to the present, with an emphasis on exchanges and encounters between the Middle East and Europe/North America.  Examines the history of the notion of \\\u0022East\\\u0022 and \\\u0022West\\\u0022; the emergence of Islam and the Christianization of Europe; Ottoman expansion and the flourishing of European powers; European competition with and colonization of Middle Eastern societies, and Middle Eastern responses.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.601",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS-D 5",
            "in-charge":     "Matossian, B. Der",
            "area":          "Middle Eastern History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.601",
            "lecture-section-of": "21H.601",
            "timeAndPlace":       "MWF11 2-146"
        },
        {
            "type":          "Class",
            "label":         "The Middle East in the Twentieth Century",
            "id":            "21H.615",
            "listing-index": "m21Hb-013",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Surveys major political, socio-economic, and cultural changes in the Middle East after 1900. Investigates the demise of the Ottoman and Qajar dynasties, the rise of new nations and nationalist identities, and the development of modern states and societies. Examines contemporary issues in historical perspective: the Arab-Israeli conflict, the Gulf War, oil and regional security, the impact of the Iranian revolution, and Islamic movements. Heavy emphasis on primary sources, such as novels and historical documents. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.615",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "in-charge":     "Matossian, B. Der",
            "area":          "Middle Eastern History"
        },
        {
            "type":          "Class",
            "label":         "Nation, Faith, and Gender in the Modern Middle East",
            "id":            "21H.621",
            "listing-index": "m21Hb-014",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Surveys the development of national, religious, and gendered identities in the Middle East during the 19th and 20th centuries. Examines European imperialism, theories of nationalism, and state formation in the successor states of the Ottoman Empire, as well as Iran. Considers national identities in light of minority, gender, and sectarian issues. Topics include Arab nationalism, Zionism, Palestinian nationalism, and regional case studies.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.621",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Staff",
            "area":          "Middle Eastern History"
        },
        {
            "type":          "Class",
            "label":         "Palestine and the Arab-Israeli Conflict",
            "id":            "21H.631",
            "listing-index": "m21Hb-015",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Traces the history of the Arab-Israeli conflict from the 19th century up to the present. Explores the role of ideology, political actors, social history, economic and infrastructural problems, and regional and international interaction, as well as prospects for peace in the 21st century.  Examines the related historiographical debates, especially those focusing on the Arab-Israeli Wars of 1948 and 1967.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.631",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Matossian, B. Der",
            "area":          "Middle Eastern History"
        },
        {
            "type":          "Class",
            "label":         "Introduction to the History of Modern Africa",
            "id":            "21H.705",
            "listing-index": "m21Hb-016",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Surveys the history of sub-Saharan Africa from c.1880 to the present, and considers African responses to social change. Major themes include European colonialism, African nationalism and nationhood, ethnic politics, and religious practice (traditional faiths, Islam, and Christianity). In an effort to understand variations of experience within the continent, compares the histories of different regions and countries (e.g., Nigeria vs Uganda), and different social groups (e.g., men vs women).",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.705",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ciarlo, D.",
            "area":          "African History"
        },
        {
            "type":          "Class",
            "label":         "Latin America:  Revolution, Dictatorship, and Democracy, 1850 to Present",
            "id":            "21H.802",
            "listing-index": "m21Hb-017",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Selective survey of Latin American history from the mid-19th century to the present.  Issues studied include:  dictators and democracies in the 20th century, revolution in Mexico, Cuba, and Central America, Latin America in the global economy, relations between Latin America and the U.S., indigenisma, feminism, and the varieties of religion in Latin America.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.802",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "HASS Elective",
            "in-charge":     "Ravel, J.",
            "area":          "Latin American History"
        },
        {
            "type":          "Class",
            "label":         "People and Other Animals",
            "id":            "21H.909",
            "listing-index": "m21Hb-018",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "A historical exploration of the ways that people have interacted with their closest animal relatives, for example: hunting, domestication of livestock, worship of animal gods, exploitation of animal labor, scientific study of animals, display of exotic and performing animals, and petkeeping. Themes include changing ideas about animal agency and intelligence, our moral obligations to animals, and the limits imposed on the use of animals.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.909",
            "joint":         false,
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "HASS Elective",
            "in-charge":     "Ritvo, H.",
            "area":          "Comparative History Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.909",
            "lecture-section-of": "21H.909",
            "timeAndPlace":       "T11-1 E51-393"
        },
        {
            "type":          "Class",
            "label":         "The World Since 1492",
            "id":            "21H.912",
            "listing-index": "m21Hb-019",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focus on four related themes: struggles between Europeans and colonized peoples; industrialization and the global emergence of capitalist economies; the formation of modern states and the challenges to them; and the development of modern consumer society. Topics include: the French and Haitian Revolutions; the partition of Africa; the two World Wars; and the emergence of advertising. Readings include both historical analysis and documents from the periods under investigation.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.912",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS-D 5",
            "in-charge":     "Matossian, B. Der",
            "area":          "Comparative History Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.912",
            "lecture-section-of": "21H.912",
            "timeAndPlace":       "MW2.30-4 66-160"
        },
        {
            "type":          "Class",
            "label":         "Jewish History from Biblical to Modern Times",
            "id":            "21H.914",
            "listing-index": "m21Hb-020",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "How our views of Jewish history have been formed and how this history can explain the survival of the Jews as an ethnic/religious group into the present day. Special attention to the partial and fragmentary nature of our information about the past, and the difficulties inherent in decoding statements about the past that were written with a religious agenda in mind. Considers complex events in Jewish history -- from early history as portrayed in the Bible to recent history, including the Holocaust.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.914",
            "joint":         false,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Temin, P.",
            "area":          "Comparative History Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.914",
            "lecture-section-of": "21H.914",
            "timeAndPlace":       "W EVE (7-10 PM) E51-385"
        },
        {
            "type":          "Class",
            "label":         "Visualizing Cultures",
            "id":            "21H.917",
            "listing-index": "m21Hb-021",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines how visual images shape the identity of peoples and cultures. A prototype digital project looking at American and Japanese graphics depicting the opening of Japan to the outside world in the 1850s is used as a case study to introduce the conceptual and practical issues involved in visualizing cultures. Guest lecturers include professionals engaged in various aspects of collecting, analyzing, and presenting graphic images. Students create and present a project involving visualized cultures. Taught in English. 21F.590 is for students pursuing a minor in Japanese; students complete some assignments in Japanese. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.917J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "in-charge":     [
                "Miyagawa, S.",
                "Dower, J."
            ],
            "area":          "Comparative History Subjects"
        },
        {
            "type":          "Class",
            "label":         "Gender and Work: From the Middle Ages to the Contemporary World",
            "id":            "21H.927",
            "listing-index": "m21Hb-022",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores men\\'s and women\\'s labor time as it is allocated between market and home-production, as well as their differentiated access to the consumption of goods and leisure.  Another major theme involves the reproductive strategies of women, both in conjunction with, and in opposition to, their families.  Examines how an ideal of the domestic sphere arose in early modern western Europe, and addresses the extent to which it limited the economic position of women. Analyzes how this ideal has been challenged, and with what success in the post-industrial period. Focuses on western Europe since the Middle Ages and on the United States, but also examines how these issues have played themselves out in non-Western cultures.  Students are expected to complete a substantial seminar paper on a relevant topic of their own choosing, as well as contribute to the discussion of a common set of readings.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.927J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "HASS Elective",
            "prereq":        "SP.610J",
            "in-charge":     "Rubin, A.",
            "area":          "Comparative History Subjects"
        },
        {
            "type":          "Class",
            "label":         "Seminar in Historical Methods",
            "id":            "21H.931",
            "listing-index": "m21Hb-023",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines the distinctive ways in which historians in different parts of the world have approached the task of writing history. Explores methodologies used, such as political, social, economic, cultural, and popular histories through the reading and discussion of relevant and innovative texts. Introduction to a variety of sources (archival documents, statistical data, film, fiction, memoirs, artifacts, and images) and the ways they can be used to research, interpret, and present the past. Assignments include weekly two-page response papers and an original research paper (including a proposal, bibliography, first draft, and final version, based on primary sources) in conjunction with a formal oral presentation. Open to all students interested in history.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.931",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     "Roy, H.",
            "area":          "Special Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "Special Topics in History",
            "id":            "21H.932",
            "listing-index": "m21Hb-024",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual supervised work for students who wish to study topics not covered in the regular history offerings. Before registering for this subject, a student must plan a course of study with a member of the History Faculty and secure approval from the Head of the History Faculty. HASS credit for Special Topics subjects awarded only by individual petitions to the Committee on Curricula. Normal maximum is 6 units; to count toward HASS Requirement, 9 units are required. Exceptional 9-unit projects occasionally approved.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.932",
            "joint":         false,
            "semester":      [
                "Fall",
                "IAP",
                "Spring"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Staff",
            "area":          "Special Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "History Pre-Thesis Tutorial",
            "id":            "21H.ThT",
            "listing-index": "m21Hb-025",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "Students writing a thesis in History develop their research topics, review relevant research and scholarship, frame their research questions and arguments, choose an appropriate methodology for analysis, and draft the introductory and methodology sections of their theses. Includes substantial practice in writing (with revision) and oral presentations.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.ThT",
            "joint":         false,
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Staff",
            "area":          "Special Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "History Thesis",
            "id":            "21H.ThU",
            "listing-index": "m21Hb-026",
            "course":        "21H",
            "level":         "Undergrad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Completion of work on the senior major thesis under supervision of a faculty thesis advisor. Includes oral presentation of thesis progress early in the term, assembling and revising the final text, and a final meeting with a committee of faculty evaluators to discuss the successes and limitations of the project. Required for students pursuing a full major in History.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.ThU",
            "joint":         false,
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Staff",
            "area":          "Special Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "Reading Seminar in American History, 1877 to the Present",
            "id":            "21H.952",
            "listing-index": "m21Hb-027",
            "course":        "21H",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Aims to develop a teaching knowledge of the field through extensive reading and discussion of major works. The reading covers a broad range of topics  political, economic, social, and cultural  and represents a variety of historical methods. Students make frequent oral presentations and prepare a 20-page review essay.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.952J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Jacobs, M.",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "Nature, Environment, and Empire",
            "id":            "21H.968",
            "listing-index": "m21Hb-028",
            "course":        "21H",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "An exploration of the relationship between the study of natural history, both domestic and exotic, by Europeans and Americans, and concrete exploitation of the natural world, focusing on the 18th and 19th centuries.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.968J",
            "joint":         true,
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Ritvo, H.",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "People and Other Animals",
            "id":            "21H.969",
            "listing-index": "m21Hb-029",
            "course":        "21H",
            "level":         "Grad",
            "units":         "2-0-10",
            "total-units":   12,
            "has-final":     false,
            "description":   "A historical survey of the ways that people have interacted with their closest animal relatives, for example: hunting, domestication of livestock, worship of animal gods, exploitation of animal labor, scientific study of animals, display of exotic and performing animals, and petkeeping. Themes include changing ideas about animal agency and intelligence, our moral obligations to animals, and the limits imposed on the use of animals.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.969",
            "joint":         false,
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "in-charge":     "Ritvo, H.",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.969",
            "lecture-section-of": "21H.969",
            "timeAndPlace":       "T11-1 E51-393"
        },
        {
            "type":          "Class",
            "label":         "Theories and Methods in the Study of History",
            "id":            "21H.991",
            "listing-index": "m21Hb-030",
            "course":        "21H",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "school, agrarian history, class, race, and gender as historical categories, historical demography, new economic, and environmental history, microhistory, and history on film. Topics drawn from European, American, and Asian history. Open to qualified undergraduates.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.991J",
            "joint":         true,
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "in-charge":     "McCants, A.",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":               "LectureSection",
            "label":              "L0121H.991",
            "lecture-section-of": "21H.991",
            "timeAndPlace":       "W10-1 E51-385"
        },
        {
            "type":          "Class",
            "label":         "Advanced Topics in History",
            "id":            "21H.992",
            "listing-index": "m21Hb-031",
            "course":        "21H",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual supervised work for graduate students on a topic or field of history not covered at the graduate level in the regular history offerings. Before registering for this subject, a student must plan a course of study with a member of the History Faculty and secure the approval of the head of the History Faculty.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.992",
            "joint":         false,
            "semester":      [
                "Fall",
                "Fall"
            ],
            "offering":      "Currently Offered",
            "in-charge":     "Staff",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "Advanced Topics in History",
            "id":            "21H.995",
            "listing-index": "m21Hb-032",
            "course":        "21H",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual supervised work for graduate students on a topic or field of history not covered at the graduate level in the regular history offerings.  Before registering for this subject, a student must plan a course of study with a member of the History Faculty and secure the approval of the head of the History Faculty.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.995",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "in-charge":     "Staff",
            "area":          "Graduate Subjects in History"
        },
        {
            "type":          "Class",
            "label":         "Advanced Topics in History",
            "id":            "21H.996",
            "listing-index": "m21Hb-033",
            "course":        "21H",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual supervised work for graduate students on a topic or field of history not covered at the graduate level in the regular history offerings.  Before registering for this subject, a student must plan a course of study with a member of the History Faculty and secure the approval of the head of the History Faculty.",
            "url":           "http://student.mit.edu/catalog/m21Hb.html#21H.996",
            "joint":         false,
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "in-charge":     "Staff",
            "area":          "Graduate Subjects in History"
        }
    ]
}