{
    "items": [
        {
            "type":          "Class",
            "label":         "Principles of Engineering Practice",
            "id":            "3.003",
            "listing-index": "m3a-000",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "1-2-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Introduces students to the interdisciplinary nature of 21st century engineering projects with three threads of learning: a technical toolkit, a social science toolkit, and a methodology for problem-based learning. Students encounter the social, political, economic, and technological challenges of engineering practice by participating in actual engineering projects involving public transportation and information infrastructure with faculty and industry. Student teams create prototypes and mixed media reports with exercises in project planning, analysis, design, optimization, demonstration, reporting and team building. Preference to freshmen.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.003",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "8.01",
                "18.01"
            ],
            "in-charge":     [
                "Kimerling, L.",
                "Kirchain, R.",
                "Fitzgerald, E.",
                "Weaver, C.",
                "Uricchio, W.",
                "Einstein, H."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.003-1",
            "lecture-section-of": "3.003",
            "timeAndPlace":       "T 14:00-15:00 8-404"
        },
        {
            "type":           "LabSection",
            "label":          "B3.003-2",
            "lab-section-of": "3.003",
            "timeAndPlace":   "R 14:00-16:00 8-107"
        },
        {
            "type":          "Class",
            "label":         "Fundamentals of Materials Science and Engineering",
            "id":            "3.012",
            "listing-index": "m3a-001",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "5-0-10",
            "total-units":   15,
            "has-final":     false,
            "description":   "Describes the fundamentals of structure, energetics, and bonding that underpin materials science. Introduction to thermodynamic functions and laws governing equilibrium properties, relating macroscopic behavior to atomistic and molecular models of materials. The role of electronic bonding in determining the energy, structure, and stability of materials. Quantum mechanical descriptions of interacting electrons and atoms. Materials phenomena, such as heat capacities, phase transformations, multiphase equilibria, chemical reactions, and magnetism. Structure of noncrystalline, crystalline, and liquid-crystalline states. Symmetry and tensor properties of materials. Point, line, and surface imperfections in materials. Diffraction and structure determination. Real-world examples such as engineered alloys, electronic and magnetic materials, ionic and network solids, polymers, and biomaterials.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.012",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "Restricted Electives in Science and Technology",
            "coreq":         [
                "18.03",
                "18.034",
                "3.016"
            ],
            "in-charge":     [
                "Allen, S.",
                "Irvine, D."
            ]
        },
        {
            "type":          "Class",
            "label":         "Materials Laboratory",
            "id":            "3.014",
            "listing-index": "m3a-002",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "1-4-7",
            "total-units":   12,
            "has-final":     false,
            "description":   "Experimental exploration of the connections between energetics, bonding and structure of materials, and application of these principles in instruments for materials characterization.  Demonstration of the wave-like nature of electrons.  Hands-on experience with techniques to quantify energy (DSC), bonding (XPS, AES, FTIR, UV/vis and force spectroscopy), and degree of order (x-ray scattering) in condensed matter. Investigation of structural transitions and structure-property relationships through practical materials examples. Practice in oral and written technical communication. It is strongly recommended that 3.012 and 3.014 are taken simultaneously.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.014",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "Institute LAB",
            "in-charge":     [
                "Gradeak, S.",
                "Stellacci, F."
            ]
        },
        {
            "type":          "Class",
            "label":         "Mathematical Methods for Materials Scientists and Engineers",
            "id":            "3.016",
            "listing-index": "m3a-003",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Mathematical techniques necessary for materials science and  engineering topics such as energetics, materials structure and symmetry, materials response to applied fields, mechanics and physics of solids and soft materials. Mathematical concepts and materials-related problem solving skills. Symbolic algebraic computational methods, programming, and visualization techniques. Topics include linear algebra, quadratic forms, tensor operations, symmetry operations, calculus of several variables, eigensystems, introduction to complex analysis, systems of ordinary and partial differential equations, phase plane analysis, beam theory,  resonance phenomena, special functions, numerical solutions,  statistical analysis, Fourier analysis, and random walks.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.016",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "18.02",
            "in-charge":     "Carter, W. C."
        },
        {
            "type":          "Class",
            "label":         "Introduction to Modeling and Simulation",
            "id":            "3.021",
            "listing-index": "m3a-004",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.021",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "Restricted Electives in Science and Technology",
            "prereq":        [
                "1.021",
                "3.021",
                "10.333",
                "18.361",
                "22.00",
                "18.03"
            ],
            "in-charge":     [
                "Buehler, M.",
                "Radovitzky, R.",
                "Thonhauser, T."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.021-1",
            "lecture-section-of": "3.021",
            "timeAndPlace":       "TR 15:00-16:30 4-231"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.021-2",
            "rec-section-of": "3.021",
            "timeAndPlace":   "M 16:00-17:00 4-231"
        },
        {
            "type":          "Class",
            "label":         "Microstructural Evolution in Materials",
            "id":            "3.022",
            "listing-index": "m3a-005",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-3-6",
            "total-units":   12,
            "has-final":     true,
            "description":   "Microstructures, defects, and structural evolution in all classes of materials. Topics include disclocations and point defects, diffusion, surface energetics, grains and grain boundaries, grain growth, nucleation and precipitation, interface stability, solution kinetics and electrochemical reactions. The lectures are widely illustrated with examples and applications based on  metals, ceramics, electronic materials and polymers. Experimental exploration of the evolution of microstructure, including experimentation using optical and electron microscopy, calorimetry, and other characterization methods. Investigations include structural transitions and structure-property relationships through practical materials examples.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.022",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        "3.012",
            "in-charge":     [
                "Cima, M.",
                "Hobbs, L."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.022-1",
            "lecture-section-of": "3.022",
            "timeAndPlace":       "MWF 10:00-11:00 37-212"
        },
        {
            "type":           "LabSection",
            "label":          "B3.022-2",
            "lab-section-of": "3.022",
            "timeAndPlace":   "MWF 9:00-13:00 8-107"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.022-3",
            "rec-section-of": "3.022",
            "timeAndPlace":   "TR 13:00-14:00 13-1143"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.022-4",
            "rec-section-of": "3.022",
            "timeAndPlace":   "TR 14:00-15:00 13-1143"
        },
        {
            "type":          "Class",
            "label":         "Electronic, Optical and Magnetic Properties of Materials",
            "id":            "3.024",
            "listing-index": "m3a-006",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-3-6",
            "total-units":   12,
            "has-final":     false,
            "description":   "Describes how the electronic, optical and magnetic properties of materials originate from their electronic and molecular structure and how these properties can be designed for particular applications, for instance in optical fibers, magnetic data storage, solar cells, transistors and other devices. Experimental exploration of the electronic, optical and magnetic properties of materials. Includes hands-on experimentation using spectroscopy, resistivity, impedance and magnetometry measurements, behavior of light in waveguides, and other characterization methods.  Investigation of structure-property relationships through practical materials examples.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.024",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        "3.012",
            "in-charge":     [
                "M",
                "Jurgen",
                "Hobbs, L.",
                "Tuller, H."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.024-1",
            "lecture-section-of": "3.024",
            "timeAndPlace":       "MWF 11:00-12:00 4-231"
        },
        {
            "type":           "LabSection",
            "label":          "B3.024-2",
            "lab-section-of": "3.024",
            "timeAndPlace":   "MWF 9:00-13:00 8-107"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.024-3",
            "rec-section-of": "3.024",
            "timeAndPlace":   "TR 14:00-15:00 13-5101"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.024-4",
            "rec-section-of": "3.024",
            "timeAndPlace":   "TR 15:00-16:00 13-5101"
        },
        {
            "type":          "Class",
            "label":         "Mechanical Behavior of Materials",
            "id":            "3.032",
            "listing-index": "m3a-007",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-2-6",
            "total-units":   12,
            "has-final":     false,
            "description":   "Basic concepts of solid mechanics and mechanical behavior of materials, stress-strain relationships, stress transformation, elasticity, plasticity and fracture. Case studies include materials selection for bicycle frames, stress shielding in biomedical implants; residual stresses in thin films; and ancient materials. Lab experiments and demonstrations give hands-on experience of the physical concepts at a variety of length scales. Use of facilities for measuring mechanical properties including standard mechanical tests, bubble raft models, atomic force microscopy and nanoindentation.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.032",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "8.01",
                "3.016",
                "18.03"
            ],
            "in-charge":     [
                "Ortiz, C.",
                "Vliet, K. J. Van"
            ]
        },
        {
            "type":          "Class",
            "label":         "Organic and Biomaterials Chemistry",
            "id":            "3.034",
            "listing-index": "m3a-008",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-2-6",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focuses on the chemistry and chemical structure-property relationships of soft synthetic and biologically derived materials.  Topical coverage includes: methods for preparing synthetic polymers by step and chain growth polymerizations; polymerization reaction kinetics; chemistry of proteins, nucleic acids, polysaccharides and lipids, and their incorporation into biomaterials and biosensors; enzymatic reactions and ligations; chemical modification and patterning of organic and inorganic surfaces using organosilane and self-assembled monolayer chemistries, radiation grafting, physisorption and microcontact printing; organic systems as templates for inorganic materials; sol gel syntheses, polymer precursor conversions, polymer vesicle naroreactors; chemical degradation of soft materials through readition, hydrolysis, and thermolysis; electroactive organic materials.  First-hand application of lecture topics is obtained through design-oriented experiments.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.034",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "3.012",
            "in-charge":     [
                "Belcher, A.",
                "Rubner, M. F."
            ]
        },
        {
            "type":          "Class",
            "label":         "Special Problems in Materials Science and Engineering",
            "id":            "3.035, 3.036, 3.037",
            "listing-index": "m3a-009",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "For undergraduates desiring to carry on projects of their own choosing, which may be experimental, theoretical, or of a design nature. Also for undergraduate studies arranged by students or staff, which may consist of seminars, assigned reading, or laboratory projects. See UROP Coordinator for registration procedures.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.035, 3.036, 3.037",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer",
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Wuensch, B. J."
        },
        {
            "type":          "Class",
            "label":         "Materials Project Laboratory",
            "id":            "3.042",
            "listing-index": "m3a-010",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "1-6-5",
            "total-units":   12,
            "has-final":     false,
            "description":   "Student project teams design and fabricate a materials engineering prototype using processing technologies (e.g. injection molding, thermoforming, investment casting, powder processing, three-dimensional printing, physical vapor deposition) appropriate for the materials and device of interest. Goals include using MSE fundamentals in a practical application; understanding trade-offs between design, processing and performance; and fabrication of a deliverable prototype. Emphasis on teamwork, project management, communications and computer skills, and hands-on work using student and MIT laboratory shops. Teams document their progress and final results by means of written and oral communication.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.042",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "prereq":        [
                "3.014",
                "3.032",
                "3.044"
            ],
            "in-charge":     "Roylance, D."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.042-1",
            "lecture-section-of": "3.042",
            "timeAndPlace":       "R 13:00-14:00 4-253"
        },
        {
            "type":           "LabSection",
            "label":          "B3.042-2",
            "lab-section-of": "3.042",
            "timeAndPlace":   "TR 14:00-17:00 16-602"
        },
        {
            "type":          "Class",
            "label":         "Materials Processing",
            "id":            "3.044",
            "listing-index": "m3a-011",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     true,
            "description":   "How materials are processed, including diffusion, chemical reactions and solid-state phase transformations. Covers heat and mass transport, fluid flow during materials processing, and the economics of materials processing and recycling.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.044",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.012",
                "3.022"
            ],
            "in-charge":     "Schuh, C."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.044-1",
            "lecture-section-of": "3.044",
            "timeAndPlace":       "MW 14:00-15:30 4-231"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.044-2",
            "rec-section-of": "3.044",
            "timeAndPlace":   "TR 11:00-12:00 13-4101"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.044-3",
            "rec-section-of": "3.044",
            "timeAndPlace":   "TR 12:00-13:00 13-4101"
        },
        {
            "type":          "Class",
            "label":         "Thermodynamics of Materials",
            "id":            "3.046",
            "listing-index": "m3a-012",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     true,
            "description":   "The laws of thermodynamics and their application to equilibrium and the properties of materials. Foundation to treat general phenomena in materials science and engineering, including chemical reactions, magnetism, polarizability, and elasticity. Relations pertaining to multiphase equilibria as determined by a treatment of solution thermodynamics. Graphical constructions that are essential for the interpretation of phase diagrams. Electrochemical equilibria and surface thermodynamics. Aspects of statistical thermodynamics as they relate to macroscopic equilibrium phenomena.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.046",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "Restricted Electives in Science and Technology",
            "prereq":        [
                "18.03",
                "18.034",
                "3.016"
            ],
            "in-charge":     "Carter, W. C."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.046-1",
            "lecture-section-of": "3.046",
            "timeAndPlace":       "TR 9:30-11:00 56-180"
        },
        {
            "type":          "Class",
            "label":         "Advanced Materials Processing",
            "id":            "3.048",
            "listing-index": "m3a-013",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Fundamentals of materials processing. Building engineering structures from the atomic- and nano-scales  to macroscopic levels. Case studies illustrating application of processing science to creation of modern metallic, ceramic, polymeric and biomaterials devices and components.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.048",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        [
                "3.52J",
                "10.581J",
                "3.022",
                "3.044"
            ],
            "in-charge":     [
                "Schuh, C.",
                "Flemings, M. C."
            ]
        },
        {
            "type":          "Class",
            "label":         "Materials for Biomedical Applications",
            "id":            "3.051J",
            "listing-index": "m3a-014",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to the interactions between cells and surfaces of biomaterials. Surface chemistry and physics of selected metals, polymers, and ceramics. Surface characterization methodology. Modification of biomaterials surfaces. Quantitative assays of cell behavior in culture. Biosensors and microarrays. Bulk properties of implants. Acute and chronic response to implanted biomaterials. Topics in biomimetics, drug delivery, and tissue engineering.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.051J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        [
                "20.340J",
                "3.091",
                "5.11",
                "5.111",
                "5.112",
                "7.012",
                "7.013",
                "7.014",
                "7.015",
                "3.00",
                "3.012",
                "5.60",
                "2.005"
            ],
            "in-charge":     "Irvine, D."
        },
        {
            "type":          "Class",
            "label":         "Nanomechanics of Materials and Biomaterials",
            "id":            "3.052",
            "listing-index": "m3a-015",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Latest scientific developments and discoveries in the field of nanomechanics, i.e. the deformation of extremely tiny (10-9 meters) areas of synthetic and biological materials. Lectures include a description of normal and lateral forces at the atomic scale, atomistic aspects of adhesion, nanoindentation, molecular details of fracture, chemical force microscopy, elasticity of individual macromolecular chains, intermolecular interactions in polymers, dynamic force spectroscopy, biomolecular bond strength measurements, and molecular motors.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.052",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        [
                "3.032",
                "3.11"
            ],
            "in-charge":     "Ortiz, C."
        },
        {
            "type":          "Class",
            "label":         "Molecular, Cellular, and Tissue Biomechanics",
            "id":            "3.053J",
            "listing-index": "m3a-016",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Develops and applies scaling laws and the methods of continuum mechanics to biomechanical phenomena over a range of length scales. Topics include structure of tissues and the molecular basis for macroscopic properties; chemical and electrical effects on mechanical behavior; cell mechanics, motility and adhesion; biomembranes; biomolecular mechanics and molecular motors. Experimental methods for probing structures at the tissue, cellular, and molecular levels.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.053J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "2.797J",
                "6.024J",
                "20.310J",
                "18.03",
                "3.016",
                "7.012",
                "7.013",
                "7.014",
                "7.015",
                "2.370",
                "2.772J"
            ],
            "in-charge":     [
                "Lang, M. J.",
                "Kamm, R. D."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.053J-1",
            "lecture-section-of": "3.053J",
            "timeAndPlace":       "MWF 12:00-13:00 4-163"
        },
        {
            "type":          "Class",
            "label":         "Polymer Physics",
            "id":            "3.063",
            "listing-index": "m3a-017",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "The mechanical, optical, and transport properties of polymers are presented with respect to the underlying physics and physical chemistry of polymers in melt, solution, and solid state. Topics include conformation and molecular dimensions of polymer chains in solutions, melts, blends, and block copolymers. Examination of the structure of glassy, crystalline, and rubbery elastic states of polymers; thermodynamics of polymer solutions, blends, crystallization; liquid crystallinity, microphase separation, and self-assembled organic-inorganic nanocomposites. Case studies of relationships between structure and function in technologically important polymeric systems.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.063",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        "3.012",
            "in-charge":     "Thomas, E. L."
        },
        {
            "type":          "Class",
            "label":         "Polymer Engineering",
            "id":            "3.064",
            "listing-index": "m3a-018",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Overview of engineering analysis and design techniques for synthetic polymers. Treatment of materials properties selection, mechanical characterization, and processing in design of load-bearing and environment-compatible structures.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.064",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.032",
                "3.044"
            ],
            "in-charge":     "Roylance, D. K."
        },
        {
            "type":          "Class",
            "label":         "Introduction to Ceramics",
            "id":            "3.07",
            "listing-index": "m3a-019",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Discusses structure-property relationships in ceramic materials. Includes hierarchy of structures from the atomic to microstructural levels. Defects and transport, solid-state electrochemical processes, phase equilibria, fracture and phase transformations are discussed in the context of controlling properties for various applications of ceramics. Numerous examples from current technology.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.07",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "3.012",
            "in-charge":     "Hobbs, L."
        },
        {
            "type":          "Class",
            "label":         "Communicating About Technology:  Colossal Failures in Engineering",
            "id":            "3.070J",
            "listing-index": "m3a-020",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores communication about technological subjects in the context of colossal engineering failures including Three Mile Island, Bhopal, the Columbia Shuttle, 9/11, and Katrina. Examines the basic engineering principles and the social context of several such failures in case studies from various engineering disciplines. Students see how problematic communications, sometimes subtly unrecognizable at the time, significantly contributed to the final failures. Students collaborate to produce a final written and oral research report that anticipates a potential failure and makes recommendations for avoiding it. Multiple sections, each limited to 18 students.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.070J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "prereq":        [
                "1.588J",
                "22.002J"
            ],
            "in-charge":     [
                "Eagar, T.",
                "Haas, W.",
                "Kadak, A.",
                "Lagace, P.",
                "Buyukozturk, O."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.070J-1",
            "lecture-section-of": "3.070J",
            "timeAndPlace":       "MW 13:00-14:00 4-237"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.070J-2",
            "rec-section-of": "3.070J",
            "timeAndPlace":   "F 13:00-14:00 66-160"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.070J-3",
            "rec-section-of": "3.070J",
            "timeAndPlace":   "F 14:00-15:00 66-160"
        },
        {
            "type":          "Class",
            "label":         "Symmetry, Structure and Tensor Properties of Materials",
            "id":            "3.072",
            "listing-index": "m3a-021",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Derivation of symmetry theory; lattices, point groups, space groups, and their properties. Use of symmetry in tensor representation of crystal properties, including anisotropy, representation surfaces, as well as applications to piezoelectricity and elasticity.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.072",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.60",
                "3.016",
                "18.03"
            ],
            "in-charge":     "Wuensch, B. J."
        },
        {
            "type":          "Class",
            "label":         "Diffraction and Structure",
            "id":            "3.073",
            "listing-index": "m3a-022",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Describes x-ray and neutron diffraction using Laue equations, Bragg's law, and the reciprocal lattice. Use of Fourier transforms and series to establish relations between intensity and distribution of scattering density. Applications to identification of materials, texture, small angle scattering and Rietveld analysis. Determines structure through diffraction effects: the phase problem, Patterson function, and direct methods for phase determination. Quantitative description and refinement of atomic arrangements.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.073",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.271",
                "18.03",
                "3.024"
            ],
            "in-charge":     "Wuensch, B. J."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.073-1",
            "lecture-section-of": "3.073",
            "timeAndPlace":       "TR 14:00-16:00 13-4101"
        },
        {
            "type":          "Class",
            "label":         "Imaging of Materials",
            "id":            "3.074",
            "listing-index": "m3a-023",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Principles and applications of imaging techniques for materials characterization including transmission and scanning electron microscopy and scanning probe microscopy. Topics include electron diffraction; image formation in transmission and scanning electron microscopy; diffraction and phase contrast; imaging of crystals and crystal imperfections; review of the most recent advances in electron microscopy for bio- and nanosciences; analysis of chemical composition and electronic structure at the atomic scale. Lectures, real-case studies and computer simulations.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.074",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.34",
                "3.024",
                "3.073"
            ],
            "in-charge":     "Gradeak, S."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.074-1",
            "lecture-section-of": "3.074",
            "timeAndPlace":       "TR 13:00-14:30 2-131"
        },
        {
            "type":          "Class",
            "label":         "Economic and Environmental Materials Selection",
            "id":            "3.080",
            "listing-index": "m3a-024",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Provides a survey of methods for evaluating choice of material and explores the implications of that choice. Topics include choice of materials, manufacturing economics, and life-cycle environmental evaluation. Students carry out a group project selecting materials technology options based on economic and environmental characteristics.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.080",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.012",
                "3.014",
                "3.022",
                "3.024"
            ],
            "in-charge":     "Kirchain, R."
        },
        {
            "type":          "Class",
            "label":         "Introduction to Solid-State Chemistry",
            "id":            "3.091",
            "listing-index": "m3a-025",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "5-0-7",
            "total-units":   12,
            "has-final":     true,
            "description":   "Basic principles of chemistry and their application to engineering systems. The relationship between electronic structure, chemical bonding, and atomic order. Characterization of atomic arrangements in crystalline and amorphous solids: metals, ceramics, semiconductors, and polymers (including proteins). Topical coverage of organic chemistry, solution chemistry, acid-base equilibria, electrochemistry, biochemistry, chemical kinetics, diffusion, and phase diagrams. Examples from industrial practice (including the environmental impact of chemical processes), from energy generation and storage (e.g. batteries and fuel cells), and from emerging technologies  (e.g. photonic and biomedical devices).",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.091",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "category":      "Chemistry",
            "in-charge":     "Paul, D."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.091-1",
            "lecture-section-of": "3.091",
            "timeAndPlace":       "MWF 11:00-12:00 3-343"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.091-2",
            "rec-section-of": "3.091",
            "timeAndPlace":   "TR 11:00-12:00 13-5101"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.091-3",
            "rec-section-of": "3.091",
            "timeAndPlace":   "TR 14:00-15:00 4-149"
        },
        {
            "type":          "Class",
            "label":         "Information Exploration: Becoming a Savvy Scholar",
            "id":            "3.093",
            "listing-index": "m3a-026",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "0-1-2",
            "total-units":   3,
            "has-final":     false,
            "description":   "Explores the scientific publication cycle: primary vs. secondary sources, bibliographic databases - both on-line and in print. Learn how to search, find, evaluate, and cite information. Indexing and abstracting, special resources (e.g. patents), \"grey literature\" (such as technical reports and conference proceedings), and Web searches. Students construct literature reviews. Limited to freshman.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.093",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "coreq":         "3.091",
            "in-charge":     [
                "Sadoway, D.",
                "Locknar, A."
            ]
        },
        {
            "type":          "Class",
            "label":         "Materials in Human Experience",
            "id":            "3.094",
            "listing-index": "m3a-027",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "2-3-4",
            "total-units":   9,
            "has-final":     false,
            "description":   "Examines the ways in which people in ancient and contemporary societies have selected, evaluated, and used materials of nature, transforming them to objects of material culture. Some examples: glass in ancient Egypt and Rome; sounds and colors of powerful metals in Mesoamerica; cloth and fiber technologies in the Inca empire. Explores ideological and aesthetic criteria often influential in materials development. Laboratory/workshop sessions provide hands-on experience with materials discussed in class. Subject complements 3.091. Enrollment may be limited.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.094",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "HASS Elective",
            "in-charge":     [
                "Hosler, D.",
                "Hobbs, L. W.",
                "Lechtman, H. N."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.094-1",
            "lecture-section-of": "3.094",
            "timeAndPlace":       "TR 16:00-17:00 56-154"
        },
        {
            "type":           "LabSection",
            "label":          "B3.094-2",
            "lab-section-of": "3.094",
            "timeAndPlace":   "TWR 19:00-22:00 16-605"
        },
        {
            "type":          "Class",
            "label":         "Physical Metallurgy",
            "id":            "3.14",
            "listing-index": "m3a-028",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focuses on the links between the processing, structure, and properties of metals and alloys. First, the physical bases for strength, stiffness, and ductility are discussed with reference to crystallography, defects, and microstructure.  Second, phase transformations and microstructural evolution are studied in the context of alloy thermodynamics and kinetics. Together, these components comprise the modern paradigm for designing metallic microstructures for optimized properties. Concludes with a focus on processing/microstructure/property relationships in structural engineering alloys, particularly steels and aluminum alloys.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.14",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.012",
                "3.022",
                "3.032"
            ],
            "in-charge":     "Russell, K."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.14-1",
            "lecture-section-of": "3.14",
            "timeAndPlace":       "TR 11:00-12:30 56-197"
        },
        {
            "type":          "Class",
            "label":         "Electrical, Optical, and Magnetic Materials and Devices",
            "id":            "3.15",
            "listing-index": "m3a-029",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores the relationships which exist between the performance of electrical, optical, and magnetic devices and the microstructural characteristics of the materials from which they are constructed. Features a device-motivated approach which places strong emphasis on emerging technologies. Device applications of physical phenomena are considered, including electrical conductivity and doping, transistors, photodectors and photovoltaics, luminescence, light emitting diodes, lasers, optical phenomena, photonics, ferromagnetism, and magnetoresistance.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.15",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "3.024",
            "in-charge":     "Ross, C. A."
        },
        {
            "type":          "Class",
            "label":         "Nanoscale Materials",
            "id":            "3.153",
            "listing-index": "m3a-030",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to the most recent advances in the synthesis, lithographic patterning and characterization of nanomaterials and to their physical and electronic properties. The materials presented include semiconductor and metal nanoparticles and nanowires, carbon fullerenes and nanotubes, organic nanoparticles and dendrimers. Fundamental concepts of surface physics and chemistry used to explain the working principles of devices such as nanotransistors and nanosensors.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.153",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        "3.024",
            "in-charge":     "Stellacci, F."
        },
        {
            "type":          "Class",
            "label":         "Micro/Nano Processing Technology",
            "id":            "3.155J",
            "listing-index": "m3a-031",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-4-5",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces the theory and technology of micro/nano fabrication. Lectures and laboratory sessions on basic processing techniques such as vacuum processes, lithography, diffusion, oxidation, and pattern transfer. Students fabricate MOS capacitors, nanomechanical cantilevers, and microfluidic mixers. Emphasis on the interrelationships between material properties and processing, device structure, and the electrical, mechanical, optical, chemical  or biological behavior of devices. Provides background for thesis work in micro/nano fabrication or for 6.151. Students engage in extensive written and oral communication exercises.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.155J",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "prereq":        "6.152J",
            "in-charge":     [
                "Schmidt, M. A.",
                "Kolodziejski, L. A.",
                "O'Handley, R. C.",
                "Ross, C. A."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.155J-1",
            "lecture-section-of": "3.155J",
            "timeAndPlace":       "MW 14:30-16:00 2-105"
        },
        {
            "type":           "LabSection",
            "label":          "B3.155J-2",
            "lab-section-of": "3.155J",
            "timeAndPlace":   [
            ]
        },
        {
            "type":          "Class",
            "label":         "Inventions and Patents",
            "id":            "3.172",
            "listing-index": "m3a-032",
            "course":        "3",
            "level":         "Undergrad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "History of private and public rights in scientific discoveries and applied engineering, leading to the development of worldwide patent systems. The classes of invention protectable under the patent laws of the US, including the procedures in protecting inventions in the Patent Office and the courts. Reviews of past cases involving inventions and patents in a) the chemical process industry and medical pharmaceutical, biological, and genetic-engineering fields; b) devices in the mechanical, ocean exploration, civil, and/or aeronautical fields; c) the electrical, computer, software, and electronic areas, including key radio, solid-state, computer and software inventions; and also d) software protection afforded under copyright laws. Conducting periodic joint real-time class sessions and discussions by video-audio Internet conferencing, with other universities. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.172",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.172",
                "6.901",
                "16.652",
                "14.02"
            ],
            "in-charge":     "Rines, R. H."
        },
        {
            "type":          "Class",
            "label":         "Materials at Equilibrium",
            "id":            "3.20",
            "listing-index": "m3a-033",
            "course":        "3",
            "level":         "Grad",
            "units":         "5-0-10",
            "total-units":   15,
            "has-final":     false,
            "description":   "Laws of thermodynamics: general formulation and applications to mechanical, electromagnetic and electrochemical systems, solutions, and phase diagrams. Computation of phase diagrams. Statistical thermodynamics and relation between microscopic and macroscopic properties, including ensembles, gases, crystal lattices, phase transitions.  Applications to phase stability and properties of mixtures.  Computational modeling. Interfaces.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.20",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.012",
                "3.014",
                "3.022",
                "3.024",
                "3.034",
                "3.042"
            ],
            "in-charge":     "Ceder, G."
        },
        {
            "type":          "Class",
            "label":         "Advanced Engineering Internship",
            "id":            "3.201",
            "listing-index": "m3a-034",
            "course":        "3",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Provides academic credit for students in the Course 3 MEng program for approved off-campus work assignments in industry. Students participate in engineering projects and technology assessment under the supervision of a departmental faculty advisor.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.201",
            "semester":      [
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Fitzgerald, E. A."
        },
        {
            "type":          "Class",
            "label":         "Advanced Industrial Internship Technology Development",
            "id":            "3.202",
            "listing-index": "m3a-035",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Students explore in-depth projects on a particular materials-based technology. Students are expected to investigate the science and technology of materials advances and their strategic value; explore potential applications for fundamental advances; and determine intellectual property related to the materials technology and applications. Students map progress with presentations, and are expected to create an end-of-term document enveloping technology, intellectual property, applications, and potential commercialization. In addition to lectures, outside speakers present their expertise in technology, entrepreneurship, intellectual property, and commercialization of materials technologies. All lectures and speaker's presentations are videotaped, digitized and put on the web for internship students to view. Registration is restricted to students enrolled in the Course 3 MEng Program who are off-campus working at an industrial site.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.202",
            "semester":      [
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.15",
            "in-charge":     "Fitzgerald, E. A."
        },
        {
            "type":          "Class",
            "label":         "Thermodynamics and Kinetics of Materials",
            "id":            "3.205",
            "listing-index": "m3a-036",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Laws of thermodynamics applied to materials and materials processes. Solution theory. Equilibrium diagrams. Kinetics of processes that occur in materials, including diffusion, phase transformations, and the development of microstructure.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.205",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.022",
                "3.042"
            ],
            "in-charge":     "Liu, Z."
        },
        {
            "type":          "Class",
            "label":         "Introduction to Materials Engineering Practice",
            "id":            "3.206",
            "listing-index": "m3a-037",
            "course":        "3",
            "level":         "Grad",
            "units":         "1-0-2",
            "total-units":   3,
            "has-final":     false,
            "description":   "Introduction to methods of technology research and development in materials-based fields. Seminar-based methodology, employing speakers from inside and outside MIT.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.206",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.091",
            "in-charge":     "Fitzgerald, E. A."
        },
        {
            "type":          "Class",
            "label":         "Technology Development and Evaluation",
            "id":            "3.207",
            "listing-index": "m3a-038",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Students explore in-depth projects on a particular materials-based technology. Students are expected to investigate the science and technology of materials advances and their strategic value; explore potential applications for fundamental advances; and determine intellectual property related to the materials technology and applications. Students map progress with presentations, and are expected to create an end-of-term document enveloping technology, intellectual property, applications, and potential commercialization. In addition to classroom lectures, outside speakers present their expertise in technology, entrepreneurship, intellectual property, and commercialization of materials technologies.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.207",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.024",
                "3.15"
            ],
            "in-charge":     "Fitzgerald, E. A."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.207-1",
            "lecture-section-of": "3.207",
            "timeAndPlace":       "TR 8:00-9:30 3-370"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.207-2",
            "rec-section-of": "3.207",
            "timeAndPlace":   "TR 19:30-21:00 3-370"
        },
        {
            "type":          "Class",
            "label":         "Kinetic Processes in Materials",
            "id":            "3.21",
            "listing-index": "m3a-039",
            "course":        "3",
            "level":         "Grad",
            "units":         "5-0-10",
            "total-units":   15,
            "has-final":     false,
            "description":   "Unified treatment of phenomenological and atomistic kinetic processes in materials. Provides the foundation for the advanced understanding of processing, microstructural evolution, and behavior for a broad spectrum of materials. Emphasis on analysis and development of rigorous comprehension of fundamentals. Topics include: irreversible thermodynamics; diffusion; nucleation; phase transformations; fluid and heat transport; morphological instabilities; gas-solid, liquid-solid, and solid-solid reactions.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.21",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.012",
                "3.022",
                "3.044"
            ],
            "in-charge":     "Allen, S. M."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.21-1",
            "lecture-section-of": "3.21",
            "timeAndPlace":       [
                "MW 9:30-11:00 4-237",
                "F 10:00-11:00 4-237"
            ]
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.21-2",
            "rec-section-of": "3.21",
            "timeAndPlace":   "F 11:00-12:00 13-3101"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.21-3",
            "rec-section-of": "3.21",
            "timeAndPlace":   "F 13:00-14:00 13-3101"
        },
        {
            "type":          "Class",
            "label":         "Mechanical Properties of Materials",
            "id":            "3.22",
            "listing-index": "m3a-040",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Phenomenology of mechanical behavior of materials at the macroscopic level. Relationship of mechanical behavior to material structure and mechanisms of deformation and failure. Topics include: elasticity, viscoelasticity, plasticity, creep, fracture, and fatigue. Case studies and examples drawn from structural and functional applications that include a variety of material classes: metals, ceramics, polymers, thin films, composites, and cellular materials.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.22",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.032",
            "in-charge":     "Vliet, K. Van"
        },
        {
            "type":               "LectureSection",
            "label":              "L3.22-1",
            "lecture-section-of": "3.22",
            "timeAndPlace":       "TR 9:30-11:00 4-237"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.22-2",
            "rec-section-of": "3.22",
            "timeAndPlace":   "W 11:00-12:00 13-3101"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.22-3",
            "rec-section-of": "3.22",
            "timeAndPlace":   "W 13:00-14:00 13-3101"
        },
        {
            "type":          "Class",
            "label":         "Electronic and Mechanical Properties of Materials",
            "id":            "3.225",
            "listing-index": "m3a-041",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Electrical, optical, magnetic, and mechanical properties of metals, semiconductors, ceramics and polymers. Discussion of roles of bonding, structure (crystalline, defect, energy band and microstructure) and composition in influencing and controlling physical properties. Case studies drawn from a variety of applications including semiconductor diodes, optical detectors, sensors, thin films, biomaterials, composites, and cellular materials.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.225",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "8.03",
                "3.032"
            ],
            "in-charge":     [
                "Gibson, L. J.",
                "Fitzgerald, E. A."
            ]
        },
        {
            "type":          "Class",
            "label":         "Electrical, Optical, and Magnetic Properties of Materials",
            "id":            "3.23",
            "listing-index": "m3a-042",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Origin of electrical, magnetic and optical properties of materials. Focus on the acquisition of quantum mechanical tools. Analysis of the properties of materials. Presentation of the postulates of quantum mechanics. Examination of the hydrogen atom, simple molecules and bonds, and the behavior of electrons in solids and energy bands. Introduction of the variation principle as a method for the calculation of wavefunctions. Investigation of how and why materials respond to different electrical, magnetic and electromagnetic fields and probes. Study of the conductivity, dielectric function, and magnetic permeability in metals, semiconductors, and insulators. Survey of common devices such as transistors, magnetic storage media, optical fibers.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.23",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "8.03",
                "18.03"
            ],
            "in-charge":     "Marzari, N."
        },
        {
            "type":          "Class",
            "label":         "Diffraction and Structure",
            "id":            "3.271",
            "listing-index": "m3a-043",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Describes x-ray and neutron diffraction using Laue equations, Bragg's law, and the reciprocal lattice. Use of Fourier transforms and series to establish relations between intensity and distribution of scattering density. Applications to identification of materials, texture, small angle scattering and Rietveld analysis. Determines structure through diffraction effects: the phase problem, Patterson function, and direct methods for phase determination. Quantitative description and refinement of atomic arrangements.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.271",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.073",
                "18.03",
                "3.024"
            ],
            "in-charge":     "Wuensch, B. J."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.271-1",
            "lecture-section-of": "3.271",
            "timeAndPlace":       "TR 14:00-16:00 13-4101"
        },
        {
            "type":          "Class",
            "label":         "Special Problems in Emerging and Fundamental Studies in Materials",
            "id":            "3.29",
            "listing-index": "m3a-044",
            "course":        "3",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Advanced work in the field for qualified students. Lectures, conferences, assigned readings, or supervised laboratory work.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.29",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer",
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      [
                "H-LEVEL Grad Credit",
                "H-LEVEL Grad Credit"
            ],
            "in-charge":     "Ceder, G."
        },
        {
            "type":          "Class",
            "label":         "Atomistic Computer Modeling of Materials",
            "id":            "3.320",
            "listing-index": "m3a-045",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Theory and application of atomistic computer simulations to model, understand, and predict the properties of real materials.  Energy models: from classical potentials to first-principles approaches.  Density-functional theory and the total-energy pseudopotential method.  Errors and accuracy of quantitative predictions.  Thermodynamic ensembles: Monte Carlo sampling and molecular dynamics simulations.  Free energies and phase transitions.  Fluctations and transport properties.  Coarse-graining approaches and mesoscale models.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.320",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.022",
                "3.20",
                "3.23"
            ],
            "in-charge":     "Ceder, G."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.320-1",
            "lecture-section-of": "3.320",
            "timeAndPlace":       "TR 11:00-12:30 8-404"
        },
        {
            "type":          "Class",
            "label":         "Imaging of Materials",
            "id":            "3.34",
            "listing-index": "m3a-046",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Principles and applications of imaging techniques for materials characterization including transmission and scanning electron microscopy and scanning probe microscopy. Topics include electron diffraction; image formation in transmission and scanning electron microscopy; diffraction and phase contrast; imaging of crystals and crystal imperfections; review of the most recent advances in electron microscopy for bio- and nanosciences; analysis of chemical composition and electronic structure at the atomic scale. Lectures, real-case studies and computer simulations. Graduate students complete additional assignments.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.34",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.074",
                "3.23"
            ],
            "in-charge":     "Gradeak, S."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.34-1",
            "lecture-section-of": "3.34",
            "timeAndPlace":       "TR 13:00-14:30 2-131"
        },
        {
            "type":          "Class",
            "label":         "Fracture and Fatigue",
            "id":            "3.35",
            "listing-index": "m3a-047",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Linear elastic and elastic-plastic fracture mechanics. Experimental methods. Microstructural effects on fracture in metals, ceramics, polymers, thin films, biological materials and composites. Toughening mechanisms. Crack growth resistance and creep fracture. Interface fracture mechanics. Fatigue damage and dislocation substructures in single crystals. Stress- and strain-life approach to fatigue. Fatigue crack growth models and mechanisms. Variable amplitude fatigue. Corrosion fatigue. Case studies of fracture and fatigue in structural, bioimplant, and microelectronic components.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.35",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.032",
            "in-charge":     "Suresh, S."
        },
        {
            "type":          "Class",
            "label":         "Welding and Joining Processes",
            "id":            "3.37",
            "listing-index": "m3a-048",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-3",
            "total-units":   6,
            "has-final":     false,
            "description":   "Discusses a wide variety of processes and materials from the viewpoint of their fundamental physical and chemical properties. Specific topics: cold welding, adhesive bonding, diffusion bonding, soldering, brazing, flames, arcs, high-energy density heat sources, solidification, cracking resistance, shielding methods, and electric contacts. Emphasis on underlying science of a given process rather than a detailed description of the technique or equipment. Meets with first half of subject 3.371J in Fall Term; videotaped instruction.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.37",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.821J",
                "3.371J"
            ],
            "in-charge":     "Eagar, T. W."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.37-1",
            "lecture-section-of": "3.37",
            "timeAndPlace":       "MTWRF 19:30-21:00 2-139"
        },
        {
            "type":          "Class",
            "label":         "Fabrication Technology",
            "id":            "3.371J",
            "listing-index": "m3a-049",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-5",
            "total-units":   9,
            "has-final":     false,
            "description":   "Discusses a wide variety of technologies including welding, brazing, soldering, casting, forging and non-destructive testing, especially as related to ship building and heavy fabrication. Emphasis on the underlying science of a given process rather than a detailed description of the technique or equipment. First half of subject meets with subject 3.37 in Fall Term; videotaped instruction in other terms.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.371J",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.821J",
                "3.37"
            ],
            "in-charge":     "Eagar, T. W."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.371J-1",
            "lecture-section-of": "3.371J",
            "timeAndPlace":       "MTWRF 19:30-21:00 2-139"
        },
        {
            "type":          "Class",
            "label":         "Modern Physical Metallurgy",
            "id":            "3.40J",
            "listing-index": "m3a-050",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines how the presence of 1-, 2- and 3D defects and second phases control the mechanical, electromagnetic and chemical behavior of metals and alloys. Considers point, line and interfacial defects in the context of structural transformations including annealing, spinodal decomposition, nucleation, growth, and particle coarsening. Concentrates on structure-function relationships, and in particular how grain size, interstitial and substitutional solid solutions, and second-phase particles impact mechanical and other properties  Industrially relevant case studies illustrate lecture concepts.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.40J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "22.71J",
                "3.14"
            ],
            "in-charge":     [
                "Vliet, K. J. Van",
                "Schuh, C."
            ]
        },
        {
            "type":          "Class",
            "label":         "Electronic Materials Design",
            "id":            "3.42",
            "listing-index": "m3a-051",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Extensive and intensive examination of structure-processing-property correlations for a wide range of materials including metals, semiconductors, dielectrics, and optical materials.  Topics covered include defect equilibria; junction characteristics; photodiodes, light sources and displays; bipolar and field effect transistors; chemical, thermal and mechanical transducers; data storage.  Emphasis on materials design in relation to device performance.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.42",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.23",
            "in-charge":     "Tuller, H. L."
        },
        {
            "type":          "Class",
            "label":         "Integrated Microelectronic Devices",
            "id":            "3.43J",
            "listing-index": "m3a-052",
            "course":        "3",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "The physics of microelectronic semiconductor devices for silicon integrated circuit applications. Topics: semiconductor fundamentals, p-n junction, metal-oxide semiconductor structure, metal-semiconductor junction, MOS field-effect transistor, and bipolar junction transistor. Emphasis on physical understanding of device operation through energy band diagrams and short-channel MOSFET device design. Issues in modern device scaling outlined. Includes device characterization projects and device design project.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.43J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "6.720J",
                "6.012",
                "3.42"
            ],
            "in-charge":     [
                "Alamo, J. A. del",
                "Tuller, H. L."
            ]
        },
        {
            "type":          "Class",
            "label":         "Materials Processing for Micro- and Nano-Systems",
            "id":            "3.44",
            "listing-index": "m3a-053",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Processing of bulk, thin film, and nanoscale materials for applications in electronic, magnetic, electromechanical, and photonic devices and microsystems. Topics include growth of bulk, thin-film, nanoscale single crystals via vapor and liquid phase processes; formation, patterning and processing of thin films, with an emphasis on relationships among processing, structure, and properties; and processing of systems of nanoscale materials. Examples from materials processing for applications in high-performance integrated electronic circuits, integrated sensors, and data storage systems.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.44",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.205",
                "3.225",
                "3.20",
                "3.21"
            ],
            "in-charge":     "Thompson, C. V."
        },
        {
            "type":          "Class",
            "label":         "Magnetic Materials",
            "id":            "3.45",
            "listing-index": "m3a-054",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Foundation topics include magnetostatics, origin of magnetism in materials, magnetic domains and domain walls, magnetic anisotropy, reversible and irreversible magnetization processes; hard and soft magnetic materials and magnetic recording. Special topics are selected from magnetism at nanoscale (thin films, surfaces, particles); amorphous and nanocrystalline magnetic materials; electronic transport in ferromagnets including magnetoresistive, spin-valve and spin-tunnel junction sensors.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.45",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.23",
            "in-charge":     "O'Handley, R. C."
        },
        {
            "type":               "LectureSection",
            "label":              "L3.45-1",
            "lecture-section-of": "3.45",
            "timeAndPlace":       "TR 14:30-16:00 4-145"
        },
        {
            "type":          "Class",
            "label":         "Photonic Materials and Devices",
            "id":            "3.46",
            "listing-index": "m3a-055",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Optical materials design for semiconductors, dielectrics and polymers. Ray optics, electromagnetic optics and guided wave optics. Physics of light-matter interactions.  Device design pronciples: LEDs, lasers, photodetectors, modulators, fiber and waveguide interconnects, optical filters, and photonic crystals. Device processing:  crystal growth, substrate engineering, thin film deposition, etching and process integration for dielectric, silicon and compound semiconductor materials. Microphotonic integrated circuits.  Telecom/datacom systems. Assignments include three design projects that emphasize materials, devices and systems applications.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.46",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.42",
            "in-charge":     "Kimerling, L. C."
        },
        {
            "type":          "Class",
            "label":         "Processing of Materials on the Nanoscale",
            "id":            "3.47",
            "listing-index": "m3a-056",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Coverage includes techniques and underlying principles for synthesis and assembly of materials with one or more nanoscale dimensions, in the form of individual molecules, dots, wires, tubes, or sheets. Focuses on materials with applications arising from size-dependent electronic, magnetic, photonic, chemical, or mechanical properties.  Synthesis via both physical processes (e.g. lithography, physical vapor deposition) and chemical processes (e.g. chemical vapor deposition, growth from liquid and solid solutions) are discussed. Thermodynamically-driven and kinetically-driven self-assembly processes are described as illustrations of fundamental assembly mechanisms. The formation of hierarchical ordered structures by templated self assembly are also discussed. Lectures complemented by case studies given by the instructors and by outside speakers.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.47",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "3.20",
                "3.21",
                "3.205",
                "3.44"
            ],
            "in-charge":     [
                "Ross, C. A.",
                "Thompson, C. V."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.47-1",
            "lecture-section-of": "3.47",
            "timeAndPlace":       "MW 9:30-11:00 9-057"
        },
        {
            "type":          "Class",
            "label":         "Materials and Processes for Microelectromechanical Devices and Systems",
            "id":            "3.48J",
            "listing-index": "m3a-057",
            "course":        "3",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Unified treatment of key principles in materials and processing for design and manufacture of microelectromechanical systems (MEMS). Emphasis on materials and processes commonly used for fabrication for MEMS and not microelectronic systems. Discussion of the processing and properties of both thin and thick polycrystalline and amorphous films, wafer and thin film bonding, bulk micromachining techniques, and the relationships between processing and properties of active materials such as piezoelectrics, ferroelectrics and phase-transition materials. Key material properties and parameters and their relationships with microfabrication processes and applications are discussed, including elastic and inelastic deformation, fracture, residual stress, fatigue, creep, adhesion, stiction, and coupled-field constitutive behavior. Materials and process selection and case studies of applications provide a unifying theme.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.48J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.373J",
                "6.778J",
                "10.584J",
                "16.288J",
                "6.152J",
                "3.155J"
            ],
            "in-charge":     [
                "Anand, L.",
                "Jensen, K. F.",
                "Schmidt, M. A.",
                "Thompson, C. V.",
                "Wardle, B. L."
            ]
        },
        {
            "type":               "LectureSection",
            "label":              "L3.48J-1",
            "lecture-section-of": "3.48J",
            "timeAndPlace":       "MW 8:00-9:30 9-057"
        },
        {
            "type":           "RecitationSection",
            "label":          "R3.48J-2",
            "rec-section-of": "3.48J",
            "timeAndPlace":   "F 9:00-11:00 66-156"
        },
        {
            "type":          "Class",
            "label":         "Special Problems in Electronic, Photonic and Magnetic Materials",
            "id":            "3.49",
            "listing-index": "m3a-058",
            "course":        "3",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Advanced work for qualified students. Lectures, conferences, assigned readings, or supervised laboratory work.",
            "url":           "http://student.mit.edu/catalog/m3a.html#3.49",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer",
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      [
                "H-LEVEL Grad Credit",
                "H-LEVEL Grad Credit"
            ],
            "in-charge":     "Stellacci, F."
        }
    ]
}