{
    "items": [
        {
            "type":          "Class",
            "label":         "ESD.01J - Engineering System Design",
            "id":            "ESD.01J",
            "listing-index": "mESDa-000",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Deals with the design of complex, large, interconnected,  open  sociotechnical(CLIOS) systems, where \"open\" denotes systems that directly interact with the social/political/economic context. Introduces the CLIOS process, defining the concept and distinguishing between quantitative and qualitative analyses of such systems, including introductions of models and frameworks. Systems are characterized, measures of system performance are developed, and key CLIOS system concepts (including sustainability, equity, mobility, and accessibility) are introduced. Class-wide project, with students working in teams on the design of a CLIOS system, taking a broad systems perspective in that design. Examples include the urban ring, a proposed new transit line for Boston; Tren Urbano in San Juan, Puerto Rico; the Central Artery/Ted Williams Tunnel project in Boston; and the transportation of spent nuclear fuel.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.01J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.041J",
                "1.011"
            ],
            "in-charge":     "J.Sussman",
            "area":          "Undergraduate"
        },
        {
            "type":          "Class",
            "label":         "ESD.018J - Project Management",
            "id":            "ESD.018J",
            "listing-index": "mESDa-001",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to theories of project management, with practical application through case projects. Topics include resource management, financial controls, and construction management (including scheduling, estimating, progress monitoring, and project control) for all phases of expected life of facility. Meets with undergraduate subject 1.040; students taking the graduate version are expected to complete additional assignments.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.018J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.401J",
                "1.040"
            ],
            "in-charge":     "Staff",
            "area":          "Undergraduate"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.018J-1",
            "lecture-section-of": "ESD.018J",
            "timeAndPlace":       "MF 13:00-14:30 1-371"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.018J-2",
            "rec-section-of": "ESD.018J",
            "timeAndPlace":   "F 16:00-17:00 1-371"
        },
        {
            "type":          "Class",
            "label":         "ESD.032J - Communicating About Technology:  Colossal Failures in Engineering",
            "id":            "ESD.032J",
            "listing-index": "mESDa-002",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores communication about technological subjects in the context of colossal engineering failures including Three Mile Island, Bhopal, the Columbia Shuttle, 9/11, and Katrina. Examines the basic engineering principles and the social context of several such failures in case studies from various engineering disciplines. Students see how problematic communications, sometimes subtly unrecognizable at the time, significantly contributed to the final failures. Students collaborate to produce a final written and oral research report that anticipates a potential failure and makes recommendations for avoiding it. Multiple sections, each limited to 18 students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.032J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      [
                "HASS Elective",
                "HASS Communication-Intensive"
            ],
            "prereq":        [
                "1.588J",
                "3.070J",
                "22.002J",
                "21W.781J"
            ],
            "in-charge":     [
                "Eagar, T.",
                "Haas, W.",
                "Kadak, A.",
                "Lagace, P."
            ],
            "area":          "Undergraduate"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.032J-1",
            "rec-section-of": "ESD.032J",
            "timeAndPlace":   "MWF 13:00-14:00 1-375"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.032J-2",
            "rec-section-of": "ESD.032J",
            "timeAndPlace":   "MWF 14:00-15:00 1-375"
        },
        {
            "type":          "Class",
            "label":         "ESD.035J - Engineering Design and Rapid Prototyping",
            "id":            "ESD.035J",
            "listing-index": "mESDa-003",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "2-4-0",
            "total-units":   6,
            "has-final":     false,
            "description":   "Develops initial competency in engineering design by taking a holistic view. Conceiving, designing, manufacturing and testing a system component such as a complex structural part. Activities include hand sketching, CAD modeling, CAE analysis, CAM programming, and operation of CNC machining equipment. Focuses on the complementary roles of human creativity as well as the design process itself. Designs are executed by pairs of students who enter their products in a design competition. Enrollment may be limited.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.035J",
            "semester":      "IAP",
            "offering":      "Not offered this year",
            "prereq":        [
                "16.810J",
                "16.01",
                "16.02",
                "2.001",
                "2.002"
            ],
            "in-charge":     "Weck, O. de",
            "area":          "Undergraduate"
        },
        {
            "type":          "Class",
            "label":         "ESD.04 - Frameworks and Models in Engineering Systems",
            "id":            "ESD.04",
            "listing-index": "mESDa-004",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to quantitative models and qualitative frameworks for studying complex engineering systems. The art of abstracting a complex system into a model for purposes of analysis and design while dealing with complexity, emergent behavior, stochasticity, non-linearities and the requirements of many stakeholders with divergent objectives. Architectural system configuration. Semester-long class project deals with critical contemporary issues which require an integrative, interdisciplinary approach using the above models and frameworks.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.04",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        "18.02",
            "in-charge":     "Sussman, J.",
            "area":          "Undergraduate"
        },
        {
            "type":          "Class",
            "label":         "ESD.053J - Environmental Risks for Common Disease",
            "id":            "ESD.053J",
            "listing-index": "mESDa-005",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Analysis of potentially important risk factors for common diseases in the general environment and the workplace:  air-, food- and water-borne chemicals; subclinical infections; diet and lifestyle choices. Analysis of history of changes in common disease rates. General paradigm of environmental sources and exposure of human subpopulations, uptake, internal distribution and metabolism of xenobiotics. Measurement of xenobiotic chemicals and allobiotic life forms in human tissues. Potential pathways of induced pathogenesis: mutagenesis, inflammation, hormonal mimicry.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.053J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "prereq":        [
                "1.081J",
                "20.104J",
                "7.012",
                "7.013",
                "7.014",
                "7.015",
                "5.111",
                "5.112",
                "3.091"
            ],
            "in-charge":     [
                "Thilly, W.",
                "McCunney, R."
            ],
            "area":          "Undergraduate"
        },
        {
            "type":          "Class",
            "label":         "ESD.10 - Introduction to Technology and Policy",
            "id":            "ESD.10",
            "listing-index": "mESDa-006",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Frameworks and Models for Technology and Policy students explore perspectives in the policy process  agenda setting, problem definition, framing the terms of debate, formulation and analysis of options, implementation and evaluation of policy outcomes using frameworks including economics and markets, law, and business and management. Methods include cost/benefit analysis, probabilistic risk assessment, and system dynamics. Exercises include developing skills to work on the interface between technology and societal issues; simulation exercises; case studies; and group projects that illustrate issues involving multiple stakeholders with different value structures, high levels of uncertainty, multiple levels of complexity; and value trade-offs that are characteristic of engineering systems. Emphasis on negotiation, team building and group dynamics, and management of multiple actors and leadership.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.10",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Weigel, A.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.103J - Science, Technology, and Public Policy",
            "id":            "ESD.103J",
            "listing-index": "mESDa-007",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Analysis of issues at the intersection of science, technology, public policy, and business.  Cases drawn from antitrust and intellectual property rights; health and environmental policy; defense procurement and strategy; strategic trade and industrial policy; and R&D funding. Structured around theories of political economy, modified to take account of integration of uncertain technical information into public and private decision-making.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.103J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "17.310J",
                "STS.482J"
            ],
            "in-charge":     "Oye, K.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.123J - Industrial Ecology",
            "id":            "ESD.123J",
            "listing-index": "mESDa-008",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Quantitative techniques for life cycle analysis of the impacts of materials extraction, processing use, and recycling; and economic analysis of materials processing, products, and markets. Student teams undertake a major case study of automobile manufacturing using the latest methods of analysis and computer-based models of materials process.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.123J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.814J",
                "3.560J",
                "ESD.10",
                "3.56"
            ],
            "in-charge":     [
                "Kirchain, R.",
                "Clark, J.",
                "Field, F."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.123J-1",
            "lecture-section-of": "ESD.123J",
            "timeAndPlace":       "TR 9:00-10:30 E51-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.126 - Energy Systems and Economic Development",
            "id":            "ESD.126",
            "listing-index": "mESDa-009",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "A team-based policy research subject focused on evaluation of energy technologies and their implementation within developing countries. Focuses on one or more specific nations, carries out a resource assessment, and develops an energy strategy that is congruent with technical potential, cultural requirements, and environmental constraints.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.126",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "ESD.10",
            "in-charge":     [
                "Tabors, R. D.",
                "Staff"
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.128J - Global Climate Change: Economics, Science, and Policy",
            "id":            "ESD.128J",
            "listing-index": "mESDa-010",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Introduces scientific, economic, and ecological issues underlying the threat of global climate change, and the institutions engaged in negotiating an international response. Develops an integrated approach to analysis of climate change processes, and assessment of proposed policy measures, drawing on research and model development within the MIT Joint Program on the Science and Policy of Global Change.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.128J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "12.848J",
                "15.023J",
                "18.02",
                "5.60",
                "2.005",
                "15.010"
            ],
            "in-charge":     [
                "Jacoby, H. D.",
                "Prinn, R. G."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.128J-1",
            "lecture-section-of": "ESD.128J",
            "timeAndPlace":       "M 15:00-17:00 E25-117"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.128J-2",
            "rec-section-of": "ESD.128J",
            "timeAndPlace":   "W 15:00-16:00 E25-117"
        },
        {
            "type":          "Class",
            "label":         "ESD.129J - Space Policy Seminar",
            "id":            "ESD.129J",
            "listing-index": "mESDa-011",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores current issues in space policy as well as the historical roots for the issues. Emphasis on critical policy discussion combined with serious technical analysis. Covers national security space policy, civil space policy, as well as commercial space policy. Issues explored include the GPS dilemma, the International Space Station choices, commercial launch from foreign countries, and the fate of satellite-based cellular systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.129J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.891J",
            "in-charge":     "Weigel, A.L.",
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.129J-1",
            "lecture-section-of": "ESD.129J",
            "timeAndPlace":       "M 10:00-13:00 33-218"
        },
        {
            "type":          "Class",
            "label":         "ESD.132J - Law, Technology, and Public Policy",
            "id":            "ESD.132J",
            "listing-index": "mESDa-012",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examination of the relationship between law and technological change, and the ways in which law, economics, and technological change shape public policy. Areas addressed include how law can be used to influence and guide technological change; responses of the legal system to environmental, safety, social and ethical problems created by new or existing technology;  how law and markets interact to limit or encourage technological development; and how law can affect the distribution of wealth and social justice. Topics covered include genetic engineering; telecommunications; industrial automation; the effect of health, safety, and environmental regulation on technological innovation; the impacts of intellectual property law on innovation and equity; pharmaceuticals; nanotechnology; cost/benefit analysis as a decision tool; public participation in governmental decisions affecting science and technology; and law and economics as competing paradigms to encourage sustainability.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.132J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "15.655J",
            "in-charge":     [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.132J-1",
            "lecture-section-of": "ESD.132J",
            "timeAndPlace":       "TR 16:00-18:00 E51-145"
        },
        {
            "type":          "Class",
            "label":         "ESD.133J - Environmental Law, Policy, and Economics: Pollution Prevention and Control",
            "id":            "ESD.133J",
            "listing-index": "mESDa-013",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Reviews and analyzes federal and state regulation of air and water pollution and hazardous wastes. Analyzes pollution as an economic problem and the failure of markets. Emphasizes use of legal mechanisms and alternative approaches (such as economic incentives and voluntary approaches) to control pollution and to encourage chemical accident and pollution prevention. Focuses on the major federal legislation, the underlying administrative system, and the common law in analyzing environmental policy, economic consequences, and the role of the courts. Discusses classical pollutants and toxic industrial chemicals, community right-to-know, and environmental justice. Also provides an introduction to basic legal skills.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.133J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.811J",
                "11.630J",
                "1.801J",
                "11.021J",
                "17.393J"
            ],
            "in-charge":     [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.134J - Regulation of Chemicals, Radiation, and Biotechnology",
            "id":            "ESD.134J",
            "listing-index": "mESDa-014",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.134J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.812J",
                "11.631J",
                "1.802J",
                "11.022J"
            ],
            "in-charge":     [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.134J-1",
            "lecture-section-of": "ESD.134J",
            "timeAndPlace":       "W 19:00-22:00 E51-372"
        },
        {
            "type":          "Class",
            "label":         "ESD.136J - Technology, Law, and the Working Environment",
            "id":            "ESD.136J",
            "listing-index": "mESDa-015",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     true,
            "description":   "Addresses relationship between technology-related problems and the law applicable to work environment. National Labor Relations Act, Occupational Safety and Health Act. Toxic Substances Control Act, state worker's compensation, and suits by workers in the courts discussed. Problems related to occupational health and safety, collective bargaining as a mechanism for altering technology in the workplace, job alienation, productivity, and the organization of work addressed. Prior courses or experience in the environmental, public health, or law-related areas.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.136J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "10.805J",
            "in-charge":     [
                "Ashford, N. A.",
                "Caldart, C. C."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.136J-1",
            "lecture-section-of": "ESD.136J",
            "timeAndPlace":       "W 19:00-22:00 E51-372"
        },
        {
            "type":          "Class",
            "label":         "ESD.137J - Sustainability, Trade, and the Environment",
            "id":            "ESD.137J",
            "listing-index": "mESDa-016",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "The Schumpeterian notion of technological innovation as \"the engine of growth\" is being challenged as the globalization of trade is increasingly seen as the driving force of industrial economies. With the establishment of the World Trade Organization implementing the GATT, NAFTA, and other trading regimes, serious questions have been raised concerning the effects of global trade on sustainability, which must be viewed broadly to include not only a healthy economic base, but also a sound environment, stable employment, adequate purchasing power, distributional equity, national self-reliance, and maintenance of cultural integrity. Subject explores the many dimensions of sustainability and the use of national, multinational, and international political and legal mechanisms to further sustainable development.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.137J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.813J",
                "11.466J",
                "15.657J"
            ],
            "in-charge":     "Ashford, N. A.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.141 - Technology Negotiations and Dispute Resolution Systems",
            "id":            "ESD.141",
            "listing-index": "mESDa-017",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-3",
            "total-units":   6,
            "has-final":     false,
            "description":   "Focuses on technology, policy and logistics negotiations, as well as the associated dispute resolution systems. Emphasis on key interactive skills and analytic competencies. Field projects examine dispute resolution systems in organizational and institutional settings. Oriented for students in the technology policy program and the MEng in logistics program. Restricted to students in the LFM, SDM, TPP, MLOG, and ESD SM programs, except by permission of instructor. Half-term subject offered second half of term.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.141",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Cutcher-Gershenfeld, J.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.151J - Chemicals in the Environment: Fate and Transport",
            "id":            "ESD.151J",
            "listing-index": "mESDa-018",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "For Institute students in all departments interested in the behavior of chemicals in the environment (see ESD listings for other subjects). Emphasis on man-made chemicals, their movement through water, air, soil, and their eventual fate. Physical transport, as well as chemical and biological sources and sinks, are discussed. Linkages to health effects, sources and control, and policy aspects. Core requirement for Environmental MEng program.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.151J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "1.725J",
            "in-charge":     "Shanahan, P.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.163J - Managing Nuclear Technology",
            "id":            "ESD.163J",
            "listing-index": "mESDa-019",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines current economic, management, and policy issues concerning nuclear power and its fuel cycle. Introduces methods for analyzing private and public policy alternatives, including techniques in economic and financial analysis. Application to specific problem areas, including nuclear waste management, weapons proliferation, and the economic competitiveness of nuclear power. Other topics include deregulation and restructuring in the electric power industry.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.163J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "22.812J",
            "in-charge":     "Lester, R. K.",
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.163J-1",
            "lecture-section-of": "ESD.163J",
            "timeAndPlace":       "MW 11:00-12:30 24-115"
        },
        {
            "type":          "Class",
            "label":         "ESD.166J - Sustainable Energy",
            "id":            "ESD.166J",
            "listing-index": "mESDa-020",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Assessment of current and potential energy systems, covering extraction, conversion and end-use, with emphasis on meeting regional and global energy needs in the 21st century in a sustainable manner. Examination of energy technologies in each fuel cycle stage for fossil (oil, gas, synthetic), nuclear (fission and fusion) and renewable (solar, biomass, wind, hydro, and geothermal) energy types, along with storage, transmission, and conservation issues. Focus on evaluation and analysis of energy technology systems in the context of political, social, economic, and environmental goals. Open to upper-class undergraduates.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.166J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.818J",
                "2.65J",
                "10.391J",
                "11.371J",
                "22.811J"
            ],
            "in-charge":     [
                "Golay, M. W.",
                "Tester, J. W.",
                "Freidberg, J. P."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.166J-1",
            "lecture-section-of": "ESD.166J",
            "timeAndPlace":       "TR 15:00-17:00 56-114"
        },
        {
            "type":          "Class",
            "label":         "ESD.174 - Applications of Technology in Energy and the Environment",
            "id":            "ESD.174",
            "listing-index": "mESDa-021",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces advanced undergraduates or graduate students in the Schools of Engineering and Science to the integration of technical, economic, political, and environmental consideration required for the successful implementation of new technology. Case studies are drawn from the energy and environment sectors with some emphasis on analytic techniques that serve as a \"tool box\" for students. Technologies considered include fossil, nuclear, solar, wind, fuel cell and energy conservation. International aspects, such as weapons proliferation and global climate effects, also discussed. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.174",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.149",
                "2.63",
                "5.00",
                "10.579",
                "22.813",
                "ESD.174"
            ],
            "in-charge":     [
                "Deutch, J.",
                "Lester, R."
            ],
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.191J - Cities and Regions: Urban Economics and Public Policy",
            "id":            "ESD.191J",
            "listing-index": "mESDa-022",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "The theory of urban land and housing markets, and the spatial development of cities. The roles played by transportation systems and local governments in shaping urban location patterns. Interregional competition, economic development, and the migration of labor and capital.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.191J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.283J",
                "11.410J",
                "14.573J",
                "14.03",
                "14.04"
            ],
            "in-charge":     "Wheaton, W.",
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.191J-1",
            "lecture-section-of": "ESD.191J",
            "timeAndPlace":       "TR 14:30-16:00 E51-063"
        },
        {
            "type":          "Class",
            "label":         "ESD.192J - Analyzing and Accounting for Regional Economic Change",
            "id":            "ESD.192J",
            "listing-index": "mESDa-023",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Surveys theories of regional growth, factor mobility, clustering, industrial restructuring, learning regions, and global supply chains from a political-economy perspective. Examines/critiques accounting frameworks including accounting for the underground economy, multipliers, linkages, and supply chains used to assess employment and environmental impacts, infrastructure investments. Assesses price indices, industrial location and employment measures, and shift-share analyses. Discussions of US and foreign applications.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.192J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.284J",
                "11.481J",
                "14.03",
                "14.04"
            ],
            "in-charge":     "Polenske, K. R.",
            "area":          "Technology and Policy"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.192J-1",
            "lecture-section-of": "ESD.192J",
            "timeAndPlace":       "TR 9:00-10:30 1-246"
        },
        {
            "type":          "Class",
            "label":         "ESD.193J - Regional Socioeconomic Impact Analyses and Modeling",
            "id":            "ESD.193J",
            "listing-index": "mESDa-024",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-1-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Reviews regional economic theories and models and provides students with experience in using alternative economic impact assessment models on microcomputers. Problem sets are oriented around infrastructure, housing, energy, and environmental issues. Students work with a client generally in Boston and make a presentation to the client. Emphasis on written and oral presentation skills.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.193J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.285J",
                "11.482J",
                "11.481J"
            ],
            "in-charge":     "Polenske, K. R.",
            "area":          "Technology and Policy"
        },
        {
            "type":          "Class",
            "label":         "ESD.21J - Transportation Systems Analysis",
            "id":            "ESD.21J",
            "listing-index": "mESDa-025",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Problem-motivated introduction to methods, models and tools for the analysis and design of transportation networks including their planning, operations and control.  Capacity of critical elements of transportation networks.  Traffic flows and deterministic and probabilistic delay models.  Formulation of optimization models for planning and scheduling of freight, transit and airline systems, and their solution using software packages.  User- and system-optimal traffic assignment.  Control of traffic flows on highways, urban grids, and airspace.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.21J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.200J",
                "11.544J",
                "1.010"
            ],
            "in-charge":     [
                "Barnhart, C.",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.210J - Introduction to Transportation Systems",
            "id":            "ESD.210J",
            "listing-index": "mESDa-026",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces transportation as a complex sociotechnical  system, stressing its social and economic aspects. Key issues shaping urban, intercity, and international passenger and freight transportation in the developed and developing world. Principles governing transportation planning, investment, operations and maintenance. Introduction to quantitative models and qualitative frameworks. System performance and level-of-service metrics and the determinants of transportation demand. Introduction to economic concepts central to transportation. Transportation services and facilities for various modes and intermodal operations.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.210J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.201J",
                "11.545J"
            ],
            "in-charge":     [
                "Wilson, N. H. M.",
                "Ben-Akiva, M."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.212J - Demand Modeling",
            "id":            "ESD.212J",
            "listing-index": "mESDa-027",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     true,
            "description":   "Theory and application of modeling and statistical methods for analysis and forecasting of demand for facilities, services, and products. Topics include review of probability and statistics, estimation and testing of linear regression models, theory of individual choice behavior, derivation, estimation, and testing of discrete choice models (including logit, nested logit, GEV, probit, and mixture models), estimation under various sample designs and data collection methods (including revealed and stated preferences), sampling, aggregate forecasting methods, and iterative proportional fitting and related methods. Lectures reinforced with case studies, which require specification, estimation, testing, and analysis of models using data sets from actual applications.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.212J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.202J",
            "in-charge":     "Ben-Akiva, M. E.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.212J-1",
            "lecture-section-of": "ESD.212J",
            "timeAndPlace":       "MW 16:00-17:30 1-150"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.212J-2",
            "rec-section-of": "ESD.212J",
            "timeAndPlace":   "F 11:00-12:00 1-246"
        },
        {
            "type":          "Class",
            "label":         "ESD.213J - Advanced Demand Modeling",
            "id":            "ESD.213J",
            "listing-index": "mESDa-028",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Advanced theories and applications of models for analysis and forecasting of users' behavior and demand for facilities, services, and products. Topics vary each year and typically include linear and nonlinear latent variable models including structural equations and latent class models, estimation techniques with multiple data sources, joint discrete and continuous choice models, dynamic models, analysis of panel data, analysis of complex choices, estimation and forecasting with very large choice sets, multidimensional probabilistic choice models, advanced choice models including probit,logit mixtures, hybrid choice models, simulation methods, survey design, model transferability, and use of stated preference data. Alternate years.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.213J",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.205J",
                "1.202"
            ],
            "in-charge":     "Ben-Akiva, M. E.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.215J - Airline Schedule Planning",
            "id":            "ESD.215J",
            "listing-index": "mESDa-029",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Explores a variety of models and optimization techniques for the solution of airline schedule planning problems. Schedule design, fleet assignment, aircraft maintenance routing, crew scheduling, robust planning, integrated schedule planning, and other topics are addressed. Models and solution techniques are surveyed and state-of-the-art applications of these techniques to airline problems are presented.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.215J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.206J",
                "16.77J"
            ],
            "in-charge":     "Barnhart, C.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.216J - Logistical and Transportation Planning Methods",
            "id":            "ESD.216J",
            "listing-index": "mESDa-030",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Quantitative techniques of operations research with emphasis on applications in transportation systems analysis (urban, air, ocean, highway, and pickup and delivery systems) and in the planning and design of logistically oriented urban service systems (e.g., fire and police departments, emergency medical services, and emergency repair services). Unified study of functions of random variables, geometrical probability, multi-server queuing theory, spatial location theory, network analysis and graph theory, and relevant methods of simulation. Computer exercises and discussions of implementation difficulties.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.216J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.203J",
                "6.281J",
                "15.073J",
                "16.76J",
                "6.431"
            ],
            "in-charge":     [
                "Larson, R. C.",
                "Odoni, A. R.",
                "Barnett, A. I."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.217J - The Airline Industry",
            "id":            "ESD.217J",
            "listing-index": "mESDa-031",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Overview of the global airline industry, focusing on recent industry performance, current issues and challenges for the future. Fundamentals of airline industry structure, airline economics, operations planning, safety, labor relations, airports and air traffic control, marketing, and competitive strategies, with an emphasis on the interrelationships among major industry stakeholders. Recent research findings of the MIT Global Airline Industry Program are showcased, including the impacts of congestion and delays, evolution of information technologies, changing human resource management practices, and competitive effects of new entrant airlines. Taught by faculty participants of the Global Airline Industry Program.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.217J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.232J",
                "15.054J",
                "16.71J"
            ],
            "in-charge":     [
                "Belobaba, P. P.",
                "Barnett, A. I.",
                "Barnhart, C.",
                "Hansman, R. J.",
                "Kochan, T. A.",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.221J - An Introduction to Intelligent Transportation Systems",
            "id":            "ESD.221J",
            "listing-index": "mESDa-032",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Basic elements of intelligent transportation systems. Technological, systems, and institutional aspects of ITS considered, including system architecture, congestion pricing, public/private partnerships, network models, freight, public transportation, ITS and regional strategic transportation planning, environmental aspects of ITS, developing country applications and implementation case studies. Term project required.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.221J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.212J",
            "in-charge":     "Sussman, J.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.222J - Transportation Policy and Environmental Limits",
            "id":            "ESD.222J",
            "listing-index": "mESDa-033",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Through a combination of lectures, cases, and class discussions the subject examines the economic and political conflict between transportation and the environment. Investigates the role of government regulation, green business and transportation policy as a facilitator of economic development and environmental sustainability. Analyzes a variety of international policy problems including government-business relations, the role of interest groups, non-governmental organizations, and the public and media in the regulation of the automobile; sustainable development; global warming; politics of risk and siting of transport facilities; environmental justice; equity; as well as transportation and public health in the urban metropolis. Provides students with an opportunity to apply transportation and planning methods to develop policy alternatives in the context of environmental politics.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.222J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.253J",
                "11.543J"
            ],
            "in-charge":     [
                "Coughlin, J.",
                "Salvucci, F."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.222J-1",
            "lecture-section-of": "ESD.222J",
            "timeAndPlace":       "F 14:00-17:00 1-277"
        },
        {
            "type":          "Class",
            "label":         "ESD.224J - Planning and Design of Airport Systems",
            "id":            "ESD.224J",
            "listing-index": "mESDa-034",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Equal emphasis on current practice and advanced concepts. Airport location and planning with full consideration of economic, environmental, and other impacts. Demand prediction, determination of the capacity of the airfield, and estimation of levels of congestion. Design of terminals. Role of airports in the aviation and transportation system. Airport access problems. Optimal configuration of air transport networks and implications for airport development. Economics of the airport. Financing and institutional aspects. Special attention to international practice and developments. Alternate years.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.224J",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.231J",
                "16.781J"
            ],
            "in-charge":     [
                "Neufville, R. de",
                "Odoni, A. R."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.225J - Urban Transportation Planning",
            "id":            "ESD.225J",
            "listing-index": "mESDa-035",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "History, policy, and politics of urban transportation. The role of the federal government and the \"highway revolt.\" Public transit in the auto era. Analytic tools for transportation planning and policy analysis. The contribution of transportation to air pollution and climate change. Land use and transportation interactions. Bicycles, pedestrians, and traffic calming. Examples from the Boston area.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.225J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.252J",
                "11.540J"
            ],
            "in-charge":     [
                "Salvucci, F.",
                "Murga, M."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.226J - Public Transportation Systems",
            "id":            "ESD.226J",
            "listing-index": "mESDa-036",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     true,
            "description":   "Evolution and role of urban public transportation modes, systems, and services, focussing on bus and rail. Description of technological characteristics and their impacts on capacity, service quality, and cost. Current practice and new methods for data collection and analysis, performance monitoring, route design, frequency determination, and vehicle and crew scheduling. Effect of pricing policy and service quality on ridership. Methods for estimating costs associated with proposed service changes. Organizational models for delivering public transportation service including finance and operations.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.226J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.258J",
                "11.541J",
                "1.201J"
            ],
            "in-charge":     "Wilson, N. H. M.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.226J-1",
            "lecture-section-of": "ESD.226J",
            "timeAndPlace":       "TR 13:00-14:30 1-246"
        },
        {
            "type":          "Class",
            "label":         "ESD.229J - Urban Spatial Structure, Transportation, and Telecommunications I",
            "id":            "ESD.229J",
            "listing-index": "mESDa-037",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-2",
            "total-units":   6,
            "has-final":     false,
            "description":   "Discusses the meanings of urban space and the role of transportation planning in a contemporary metropolitan context. Topics include formation and evolution of land use patterns; job accessibility of low-skilled workers; strategies for improving accessibility; integration of transportation planning with housing, social service, and job placement; and impact of advanced communication and information technologies on urban space. Applies spatial analysis, GIS, and transportation planning methods to a case study of Boston.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.229J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "11.528J",
                "11.204"
            ],
            "in-charge":     "Staff",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.260J - Logistics Systems",
            "id":            "ESD.260J",
            "listing-index": "mESDa-038",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to supply chain management from both analytical and practical perspectives.  Stressing a unified approach, the course allows the student to develop a framework for making intelligent decisions within the supply chain.  Key logistics functions are covered to include demand planning, procurement, inventory theory and control, transportation planning and execution, reverse logistics, and flexible contracting.  Concepts explored include postponement, portfolio management, dual sourcing, and others.  Emphasis is placed on being able to recognize and manage risk, analyze various tradeoffs, and model logistics systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.260J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.260J",
                "15.770J"
            ],
            "in-charge":     [
                "Sheffi, Y.",
                "Caplice, C."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.261J - Case Studies in Logistics and Supply Chain Management",
            "id":            "ESD.261J",
            "listing-index": "mESDa-039",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "A combination of lectures and cases covering the strategic, management, and operating issues in contemporary logistics and integrated supply chain management. Includes: logistics strategy; supply chain restructuring and change management; and distribution, customer service, and inventory policy.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.261J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.261J",
                "15.771J"
            ],
            "in-charge":     "Byrnes, J.",
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.261J-1",
            "lecture-section-of": "ESD.261J",
            "timeAndPlace":       "MW 10:00-11:30 E51-345"
        },
        {
            "type":          "Class",
            "label":         "ESD.262J - Supply Chain Context",
            "id":            "ESD.262J",
            "listing-index": "mESDa-040",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Introduction to theory and practice of the core functions of the enterprises that impact supply chain management. Provides a basic understanding of strategy, industry structure, organization behavior, and marketing highlighted in the context of the supply chain. Uses lectures to introduce core functions and cases to illustrate the relationship and context for supply chain management. This results in a basic tool set to illustrate the theory and practice of analyzing and managing the relationship between supply chain management and the various functions of business. Also provides a solid understanding of supply chain management in practice. Core subject for MEng in Logistics.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.262J",
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.262J",
                "ESD.260"
            ],
            "in-charge":     [
                "Caplice, C.",
                "Goentzel, J."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.263 - Logistics Thesis Seminar",
            "id":            "ESD.263",
            "listing-index": "mESDa-041",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-1 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "The thesis process, technical writing, and presentation skills. Seminar organizes students into groups working on parallel topics. Half-term subject offered in the second half of the term. Limited to MEng in Logistics students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.263",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "in-charge":     [
                "Sheffi, Y.",
                "Caplice, C."
            ],
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.264J - Database, Internet, and Systems Integration Technologies",
            "id":            "ESD.264J",
            "listing-index": "mESDa-042",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-1-7",
            "total-units":   12,
            "has-final":     false,
            "description":   "Information technology fundamentals: software process, data modeling, UML, relational databases and SQL. Internet technologies: http, xhtml, XML, Web services. Introduction to security. Fundamentals of telecommunications. Students complete project that covers requirements/design, data model, database implementation, website, and system architecture. No prior programming experience required.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.264J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.264J",
            "in-charge":     "Kocur, G.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.265J - International Supply Chain Management",
            "id":            "ESD.265J",
            "listing-index": "mESDa-043",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "An overview of globalization and the international environment: the international marketing, international finance and supply chain interface; global strategy for logistics and supply chain management; global supply chain models; role of government intervention and regulations; the role of ports and airports in international product movements; the economics of international air and ocean carriers; and the forwarding industry. First half term subject.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.265J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.265J",
                "2.965J",
                "15.765J",
                "1.260J",
                "1.261J",
                "1.262J",
                "15.760"
            ],
            "in-charge":     [
                "Marcus, H. S.",
                "Weiss, A."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.265J-1",
            "lecture-section-of": "ESD.265J",
            "timeAndPlace":       "MW 13:00-14:30 2-105"
        },
        {
            "type":          "Class",
            "label":         "ESD.267J - Supply Chain Planning",
            "id":            "ESD.267J",
            "listing-index": "mESDa-044",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Focuses on effective supply chain strategies for companies that operate globally, with emphasis on how to plan and integrate supply chain components into a coordinated system.  Students are exposed to concepts and models important in supply chain planning with emphasis on key tradeoffs and phenomena. Introduces and utilizes key tactics such as risk pooling and inventory placement, integrated planning and collaboration, and information sharing. Lectures, computer exercises, and case discussions introduce various models and methods for supply chain analysis and optimization. Recommended for Operations Management concentrators. First half-term subject.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.267J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.273J",
                "15.762J",
                "1.260J",
                "15.760",
                "15.761"
            ],
            "in-charge":     [
                "Graves, S. C.",
                "Simchi-Levi, D."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.267J-1",
            "lecture-section-of": "ESD.267J",
            "timeAndPlace":       "MW 8:00-9:30 1-390"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.267J-2",
            "rec-section-of": "ESD.267J",
            "timeAndPlace":   "F 8:00-9:30 1-390"
        },
        {
            "type":          "Class",
            "label":         "ESD.268J - Manufacturing System and Supply Chain Design",
            "id":            "ESD.268J",
            "listing-index": "mESDa-045",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Focuses on decision making for system design, as it arises in manufacturing systems and supply chains. Students exposed to frameworks and models for structuring the key issues and trade-offs. Presents and discusses new opportunities, issues and concepts introduced by the internet and e-commerce. Introduces various models, methods and software tools for logistics network design, capacity planning and flexibility, make-buy, and integration with product development. Industry applications and cases illustrate concepts and challenges.  Recommended for Operations Management concentrators. Second half-term subject.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.268J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.274J",
                "15.763J",
                "1.260",
                "15.760",
                "15.761"
            ],
            "in-charge":     [
                "Graves, S. C.",
                "Simchi-Levi, D."
            ],
            "area":          "Transportation"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.268J-1",
            "lecture-section-of": "ESD.268J",
            "timeAndPlace":       "MW 8:00-9:30 1-390"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.268J-2",
            "rec-section-of": "ESD.268J",
            "timeAndPlace":   "F 8:00-9:30 1-390"
        },
        {
            "type":          "Class",
            "label":         "ESD.270 - Studies in Transportation",
            "id":            "ESD.270",
            "listing-index": "mESDa-046",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual advanced study of a topic in transportation systems, selected with the approval of the instructor.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.270",
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Staff",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.271 - Research Seminar in Transportation",
            "id":            "ESD.271",
            "listing-index": "mESDa-047",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Discussion of current research at various stages of development, including problem definition, literature review, methodology, and evaluation of results. Intended for advanced doctoral students who have passed the general examination.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.271",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Staff",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.272J - Design and Operation of Logistics Facilities and Networks",
            "id":            "ESD.272J",
            "listing-index": "mESDa-048",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-1",
            "total-units":   3,
            "has-final":     false,
            "description":   "Exploration of the technological and managerial issues involved in the design and operation of distribution and logistics physical facilities and associated information technology in an enterprise wise supply chain. Includes day-long site visits to logistics operations in the local area, as well as day-long software tutorials on commercial-grade software packages used in the design of logistics networks. The curriculum also includes lectures and case studies from faculty and professional logistics consultants focusing on the design and operation of efficient logistics facilities.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.272J",
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.272J",
                "1.260J"
            ],
            "in-charge":     "Caplice, C.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.273J - Logistics and Supply Chain Management",
            "id":            "ESD.273J",
            "listing-index": "mESDa-049",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Survey of Operations Research models and techniques developed for a variety of problems arising in logistical planning of multi-echelon systems. Focus on planning models for production/inventory/distribution strategies in general multi-echelon multi-item systems. Topics include vehicle routing problems, dynamic lot sizing inventory models, stochastic and deterministic multi-echelon inventory systems, the bullwhip effect, pricing models, and integration problems arising in supply chain management.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.273J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "1.270J",
            "in-charge":     "Simchi-Levi, D.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.290 - Special Topics in Supply Chain Management",
            "id":            "ESD.290",
            "listing-index": "mESDa-050",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-3",
            "total-units":   6,
            "has-final":     false,
            "description":   "Subject presents a range of advanced topics in integrated logistics and supply chain management. Conducted in a lecture-discussion format, with participation of corporate executives as guest lecturers. Students prepare industry assessment analyses and make formal classroom presentations. Specific topics alternate from year to year, but basic content includes procurement strategies and strategic sourcing, dynamic pricing and revenue management tactics, mitigation of supply chain risk through supply contracts, strategic outsourcing of supply chain chain functions and operations, management and operation of third party logistics providers, and management of supply chain security.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.290",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "ESD.260J",
                "1.260J",
                "15.770J"
            ],
            "in-charge":     "Sheffi, Y.",
            "area":          "Transportation"
        },
        {
            "type":          "Class",
            "label":         "ESD.30J - Engineering Apollo: The Moon Project as a Complex System",
            "id":            "ESD.30J",
            "listing-index": "mESDa-051",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "A detailed technical and historical exploration of the Apollo project to fly humans to the moon and return them safely to earth as an example of a complex engineering system. Emphasis is on how the systems worked, the technical and social processes that produced them, mission operations, and historical significance. Guest lectures by MIT-affiliated engineers who contributed to and participated in the Apollo missions. Students work in teams on a final project analyzing an aspect of the historical project to articulate and synthesize ideas in engineering systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.30J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.895J",
                "STS.471J"
            ],
            "in-charge":     [
                "Mindell, D.",
                "Young, L. R."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.301 - Probability and Statistics",
            "id":            "ESD.301",
            "listing-index": "mESDa-052",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "1-0-3 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "A highly-condensed review of topics from basic probability through calculus-based statistical analysis. It assumes previous probability and statistics course work, and is designed to be an intensive review for incoming SDM students. Limited to SDM students except by permission of instructor.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.301",
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "in-charge":     "Orloff, J.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.32J - Product Design and Development",
            "id":            "ESD.32J",
            "listing-index": "mESDa-053",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Covers modern tools and methods for product design and development. The cornerstone is a project in which teams of management, engineering, and industrial design students conceive, design, and prototype a physical product. Class sessions employ cases and hands-on exercises to reinforce the key ideas. Topics include: product planning, identifying customer needs, concept generation, product architecture, industrial design, concept design, and design-for-manufacturing.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.32J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.739J",
                "15.783J",
                "2.009",
                "15.760",
                "15.761"
            ],
            "in-charge":     "Seering, W. P.",
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.32J-1",
            "lecture-section-of": "ESD.32J",
            "timeAndPlace":       "TR 13:00-14:30 E51-335"
        },
        {
            "type":          "Class",
            "label":         "ESD.33 - Systems Engineering",
            "id":            "ESD.33",
            "listing-index": "mESDa-054",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-1-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Systems Engineering is an interdisciplinary approach and means to enable the realization of successful systems. It focuses on defining customer needs and required functionality early in the development cycle, documenting requirements, then proceeding with design synthesis and system validation while considering the complete problem including operations, performance, test, manufacturing, cost, and schedule. This subject emphasizes the links of systems engineering to fundamentals of decision theory, statistics, and optimization. Also introduces the most current, commercially successful techniques for systems engineering.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.33",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.880",
            "in-charge":     "Katsikopoulos, K.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.34 - System Architecture",
            "id":            "ESD.34",
            "listing-index": "mESDa-055",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Covers principles and methods for technical System Architecture. Presents a synthetic view including: the resolution of ambiguity to identify system goals and boundaries; the creative process of mapping form to function; and the analysis of complexity and methods of decomposition and re-integration. Industrial speakers and faculty present examples from various industries. Heuristic and formal methods are presented. Restricted to SDM students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.34",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Crawley, E. F.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.341J - Web System Architecting: Building Web Services",
            "id":            "ESD.341J",
            "listing-index": "mESDa-056",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Software architecting and design of web systems in the context of a start-up company. Targeted at future CTOs who must understand both the business and technical issues involved in architecting enterprise-scale web systems. Student teams confront technically challenging problems. Lectures and readings cover core database, XML, web server components and browser issues in a web service environment. Limited enrollment.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.341J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.125J",
                "1.124J",
                "6.001"
            ],
            "in-charge":     "Williams, J. R.",
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.341J-1",
            "lecture-section-of": "ESD.341J",
            "timeAndPlace":       "MW 9:30-11:00 1-150"
        },
        {
            "type":          "Class",
            "label":         "ESD.342 - Advanced System Architecture",
            "id":            "ESD.342",
            "listing-index": "mESDa-057",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focus on deep understanding of engineering systems at a level intended for research on complex engineering systems. Review  and extension of what is known about system architecture and complexity from a theoretical point of view while examining the origins of and recent developments in the field. Studies how and where the theory has been applied, and uses key analytical methods proposed. Examine the level of observational (qualitative and quantitative) understanding necessary for successful use of the theoretical framework for a specific engineering system. Case studies utilized to apply the theory and principles to engineering systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.342",
            "semester":      "Spring",
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "ESD.83",
                "ESD.84"
            ],
            "in-charge":     [
                "Magee, C.",
                "Moses, J.",
                "Whitney, D."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.342-1",
            "lecture-section-of": "ESD.342",
            "timeAndPlace":       "TR 9:00-10:30 E51-063"
        },
        {
            "type":          "Class",
            "label":         "ESD.35J - Aircraft Systems Engineering",
            "id":            "ESD.35J",
            "listing-index": "mESDa-058",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Holistic view of the aircraft as a system, covering basic systems engineering; cost and weight estimation; basic aircraft performance; safety and reliability; life cycle topics; aircraft subsystems; risk analysis and management; and system realization. Small student teams retrospectively analyze an existing aircraft covering: key design drivers and decisions; aircraft attributes and subsystems; operational experience. Oral and written versions of the case study are delivered. Focuses on a systems engineering analysis of the Space Shuttle. Study both design and operations of the shuttle, with frequent lectures by outside experts. Students choose specific shuttle systems for detailed analysis and develop new subsystem designs using state of the art technology.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.35J",
            "semester":      "Fall",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.885J",
            "in-charge":     [
                "Hansman, R. J.",
                "Haggerty, A.",
                "Liebeck, R."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.352J - Space Systems Engineering",
            "id":            "ESD.352J",
            "listing-index": "mESDa-059",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-2-6",
            "total-units":   12,
            "has-final":     false,
            "description":   "Focus on developing space system architectures. Applies subsystem knowledge gained in 16.851 to examine interactions between subsystems in the context of a space system design. Principles and processes of systems engineering including developing space architectures, developing and writing requirements, and concepts of risk are explored and applied to the project. Subject develops, documents, and presents a conceptual design of a space system including a preliminary spacecraft design.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.352J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.851",
                "16.892"
            ],
            "in-charge":     [
                "Hoffman, J. A.",
                "Crawley, E.F.",
                "Weck, O. de"
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.352J-1",
            "lecture-section-of": "ESD.352J",
            "timeAndPlace":       "MW 13:00-15:00 33-218"
        },
        {
            "type":           "LabSection",
            "label":          "BESD.352J-2",
            "lab-section-of": "ESD.352J",
            "timeAndPlace":   "F 13:00-15:00 33-218"
        },
        {
            "type":          "Class",
            "label":         "ESD.353J - Space System Architecture and Design",
            "id":            "ESD.353J",
            "listing-index": "mESDa-060",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Lectures, readings, and discussion on topics in the architecture and design of space systems. Reviews existing space system architectures and the classical methods of designing them. Focuses on use of multiattribute utility theory as a new design paradigm for the space systems when combined with integrated concurrent engineering and efficient searches of large architectural tradespaces. Considers topics such as design of flexibility into the architecture, resolution of uncertainty (technical, economic etc) in the architectures and the integration with policy issues and product development issues. Prepares students for 16.89.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.353J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.892J",
            "in-charge":     "Hastings, D. E.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.355J - Concepts in the Engineering of Software",
            "id":            "ESD.355J",
            "listing-index": "mESDa-061",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "A reading and discussion subject on issues in the engineering of software systems and software development project design. Includes the present state of software engineering, what has been tried in the past, what worked,  what did not, and why. Topics may differ in each offering, but are chosen from the software process and lifecycle; requirements and  specifications; design principles; testing, formal analysis, and reviews; quality management and assessment; product and process metrics; COTS and      reuse; evolution and maintenance; team organization and people management; and software engineering aspects of programming languages.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.355J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.355J",
                "16.35",
                "16.880J",
                "ESD.33J"
            ],
            "in-charge":     "Leveson, N. G.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.36 - System Project Management",
            "id":            "ESD.36",
            "listing-index": "mESDa-062",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Subject focuses on management principles, methods, and tools to effectively plan and implement successful system and product development projects. Material is divided into four major sections: project preparation, planning, monitoring, and adaptation. Brief review of classical techniques such as CPM and PERT. Emphasis on new methodologies and tools such as Design Structure Matrix (DSM), probabilistic project simulation, as well as project system dynamics (SD). Topics are covered from strategic, tactical, and operational perspectives. Industrial case studies expose factors that are typical drivers of success and failure in complex projects with both hardware and software content. Term projects analyze and evaluate past and ongoing projects in student's area of interest. Projects used to apply concepts discussed in class.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.36",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     [
                "Weck, O. de",
                "Lyneis, J."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.37 - The Human Side of Technology",
            "id":            "ESD.37",
            "listing-index": "mESDa-063",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-1-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Examines the human side of managing and leading technical professionals and project teams throughout the innovation process. Covers both micro (individual and group) and macro issues (organizational structure, culture, and inter-functional relationships). Topics include creating and sustaining the motivational commitment and performance of professional employees over time; dealing with complacency and routine performance; understanding the interrelationships among innovation, change, motivation and uncertainty; managing creative individual contributors in team settings; managing reward systems and career paths of professionals; leading decision making processes and effective conflict management; staffing and managing the critical roles and cross-functional relationships for building high commitment cultures and streams of innovation; managing communications and the effective transfer of knowledge and information across organizational structures; and organizational diagnosis for change. Restricted to SDM students; others with permission of instructor.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.37",
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "in-charge":     "Staff",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.379 - Systems Engineering Taxonomy and Semantics in Commercial Domains",
            "id":            "ESD.379",
            "listing-index": "mESDa-064",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "1-0-3 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "The application of systems engineering practices is increasing in commercial enterprises, but the semantics and process frameworks for 'commercial systems engineering' often appear to be quite different from the process and taxonomy developed in defense and aerospace, arguably the birthplace of modern systems engineering. Examines how systems engineering practices are employed in commercial industries, including product and service development and delivery. Special project. Enrollment limited to five students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.379",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "in-charge":     "Hale, P.",
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.38J - Enterprise Architecting",
            "id":            "ESD.38J",
            "listing-index": "mESDa-065",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Topics in architecting holistic and highly networked enterprise structures including: organizational structure; business models; organizational culture/behavior; enterprise architecture frameworks and standards; policy and process infrastructure; information technologies; and knowledge management. Explores how the practices and heuristics of systems architecting may be extended and adapted for enterprise architecting, along with discussions of evolving methods and toolsets.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.38J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.855J",
            "in-charge":     [
                "Nightingale, D.",
                "Rhodes, D."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.38J-1",
            "lecture-section-of": "ESD.38J",
            "timeAndPlace":       "MW 14:30-16:00 33-419"
        },
        {
            "type":          "Class",
            "label":         "ESD.40 - Product Design and Development",
            "id":            "ESD.40",
            "listing-index": "mESDa-066",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Modern tools and methods for product design and development. Teams of SDM and certificate program students conceive, design, and prototype a physical product. Cases and exercises reinforce key ideas. Topics include product planning, identifying customer needs, concept generation, product architecture, industrial design, concept design, and design-for-manufacturing. Restricted to SDM students or permission of instructor.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.40",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     [
                "Whitney, D.",
                "Hale, P."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.40-1",
            "lecture-section-of": "ESD.40",
            "timeAndPlace":       "MW 15:00-16:30 9-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.41 - Infrastructure Systems",
            "id":            "ESD.41",
            "listing-index": "mESDa-067",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Examination of networked infrastructure systems from different sectors including land transport, air transport, electric power and communications. Development of generalizable frameworks, analysis approaches and methodologies for infrastructure planning, design and operation that provide improved flexibility, safety, security, robustness, and operational efficiency.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.41",
            "semester":      "Fall",
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     [
                "Hansman, R. J.",
                "Roos, D."
            ],
            "area":          "Systems Design and Management"
        },
        {
            "type":          "Class",
            "label":         "ESD.51J - Foundations of Software Engineering",
            "id":            "ESD.51J",
            "listing-index": "mESDa-068",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Modern software development techniques for engineering and information technology. Design and development of component-based software (using C# and .NET); data structures and algorithms for modeling, analysis, and visualization; basic problem-solving techniques; web services; and the management and maintenance of software. Treatment of topics such as sorting and searching algorithms; and numerical simulation techniques. Foundation for in-depth exploration of image processing, computational geometry, finite element methods, network methods and e-business applications.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.51J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.124J",
                "2.091J",
                "1.00"
            ],
            "in-charge":     "Williams, J. R.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.52J - Introduction to the History of Technology",
            "id":            "ESD.52J",
            "listing-index": "mESDa-069",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to the consideration of technology as the outcome of particular technical, historical, cultural, and political efforts, especially in the United States during the 19th and 20th centuries. Topics include industrialization of production and consumption, development of engineering professions, the emergence of management and its role in shaping technological forms, the technological construction of gender roles, and the relationship between humans and machines.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.52J",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "STS.340J",
            "in-charge":     "Mindell, D.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.55 - Management of Infrastructure Systems",
            "id":            "ESD.55",
            "listing-index": "mESDa-070",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Infrastructure systems, such as transportation, telecommunication, and electric power systems, have become a crucial aspect of modern society. This course will investigate techniques from control theory and optimization that help develop and manage these systems. Although each system has unique features that need to be understood, we will see how some tools have general applicability. The course will study concepts such as stability, robustness, resource allocation, stakeholder equity, and arguments for centralization/decentralization of components.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.55",
            "semester":      "Fall",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Balakrishnan, H.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.565J - Integrating Information Systems: Technical, Strategic, and Organizational Factors",
            "id":            "ESD.565J",
            "listing-index": "mESDa-071",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Emphasis on modern communications and internet technologies and database and web technologies, and their role in supporting the integration of information systems. Presents frameworks for understanding integrating concepts and the strategic and organizational factors impacting success of IT in business. Issues addressed include technical factors ? local-area, wide-area, and internet communications networks, distributed databases, data extraction from websites, semantic web, semantic reconciliation among heterogeneous sources; strategic factors ? globalization and integration of information, competitive forces, interlinked value chains; organizational factors ? loosely coupled organizations, development of standards, motivating strategic alliances.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.565J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "15.565J",
            "in-charge":     "Madnick, S.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.57 - Technology-based Business Transformation",
            "id":            "ESD.57",
            "listing-index": "mESDa-072",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "How to leverage major technology advances to significantly transform a business in the marketplace. Focus on major issues a business must deal with to transform its technical and market strategies successfully, including the organizational and cultural aspects that often cause such business transformations to fail.Draws from concrete experiences of IBM's major transformation in the late 1990s, when it aggressively embraced the Internet and came up with its e-business strategy.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.57",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Wladawsky-Berger, I.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.58J - Disruptive Technologies: Predator or Prey?",
            "id":            "ESD.58J",
            "listing-index": "mESDa-073",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Focuses on the management of product and process innovation and on economic, management, and technological influences on innovation. Both sustaining and disruptive innovations in products and manufacturing processes covered in lectures and cases presented by the leaders of change in different industries. Emphasis on emerging and disruptive technologies as seen from the points of view of entering firms (predators) and incumbent firms (prey) are covered in a class exercise, and project (preferably done in small groups).",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.58J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        "15.365J",
            "in-charge":     "Utterback, J. M.",
            "area":          "Technology"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.58J-1",
            "lecture-section-of": "ESD.58J",
            "timeAndPlace":       "TR 14:30-16:00 1-390"
        },
        {
            "type":          "Class",
            "label":         "ESD.60 - Lean/Six Sigma Processes",
            "id":            "ESD.60",
            "listing-index": "mESDa-074",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Addresses forces driving lean/six sigma, lean thinking, variance reduction, design of experiments, (pre-stability) factors, team-based work systems, in-station process control, total productive maintenance, synchronous material flow, value stream mapping, knowledge and information flow, pull-based systems in contrasting industry settings, and enterprise alignment. Emphasis on bold visions and harsh realities. Restricted to Leaders for Manufacturing students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.60",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "in-charge":     "Spear, S.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.61J - Integrating The Lean Enterprise",
            "id":            "ESD.61J",
            "listing-index": "mESDa-075",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Addresses some of the important issues involved with the planning, development, and implementation of lean enterprises. People, technology, process, and management dimensions of an effective lean manufacturing company are considered in a unified framework. Particular emphasis on the integration of these dimensions across the entire enterprise, including product development, production, and the extended supply chain. Analysis tools as well as future trends and directions are explored. A key component of this subject is a team project.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.61J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.852J",
            "in-charge":     "Nightingale, D.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.63J - Control of Manufacturing Processes",
            "id":            "ESD.63J",
            "listing-index": "mESDa-076",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Statistical modeling and control in manufacturing processes. Use of experimental design and response surface modeling to understand manufacturing process physics. Defect and parametric yield modeling and optimization. Forms of process control, including statistical process control, run by run and adaptive control, and real-time feedback control. Application contexts include semiconductor manufacturing, conventional metal and polymer processing, and emerging micro-nano manufacturing processes.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.63J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.830J",
                "6.780J",
                "2.008",
                "2.810",
                "6.041",
                "6.152J",
                "15.064J"
            ],
            "in-charge":     [
                "Hardt, D. E.",
                "Boning, D. S."
            ],
            "area":          "Technology"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.63J-1",
            "lecture-section-of": "ESD.63J",
            "timeAndPlace":       "TR 8:00-9:30 8-404"
        },
        {
            "type":          "Class",
            "label":         "ESD.64J - Product Design",
            "id":            "ESD.64J",
            "listing-index": "mESDa-077",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Project-centered subject addressing transformation of ideas into successful products which are properly matched to the user and the market. Students are asked to take a more complete view of a new product and to gain experience with designs judged on their aesthetics, ease of use, and sensitivities to the realities of the marketplace. Lectures on modern design process, industrial design, visual communication, form-giving, mass production, marketing, and environmentally conscious design.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.64J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.744J",
                "2.009"
            ],
            "in-charge":     "Wallace, D. R.",
            "area":          "Technology"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.64J-1",
            "lecture-section-of": "ESD.64J",
            "timeAndPlace":       "TR 14:30-16:00 3-370"
        },
        {
            "type":          "Class",
            "label":         "ESD.65J - Aerospace Biomedical and Life Support Engineering",
            "id":            "ESD.65J",
            "listing-index": "mESDa-078",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Fundamentals of human performance, physiology, and life support impacting engineering design and aerospace systems. Topics include effects of gravity on the muscle, skeletal, cardiovascular, and neurovestibular systems; human/pilot modeling and human/machine design; flight experiment design; and life support engineering for extravehicular activity (EVA). Case studies of current research are presented. Assignments include a design project, quantitative homework sets, and quizzes emphasizing engineering and systems aspects.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.65J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.423J",
                "HST.515J",
                "16.400",
                "16.06",
                "16.060"
            ],
            "in-charge":     "Newman, D. J.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.66J - Receivers, Antennas, and Signals",
            "id":            "ESD.66J",
            "listing-index": "mESDa-079",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Detection and measurement of radio and optical signals encountered in communications, astronomy, remote sensing, instrumentation, and radar. Statistical analysis of signal processing systems, including radiometers, spectrometers, interferometers, and digital correlation systems. Matched filters and ambiguity functions. Communications channel performance. Measurement of random electromagnetic fields. Angular filtering properties of antennas, interferometers, and aperture synthesis systems. Radiative transfer and parameter estimation. Alternate years.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.66J",
            "semester":      "Spring",
            "offering":      [
                "Not offered next year",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "6.661J",
                "6.013",
                "8.03",
                "6.003",
                "16.04",
                "2.004"
            ],
            "in-charge":     "Staelin, D. H.",
            "area":          "Technology"
        },
        {
            "type":          "Class",
            "label":         "ESD.68 - Communications and Information Policy",
            "id":            "ESD.68",
            "listing-index": "mESDa-080",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Introduction to the technology and policy context of public communications networks. Critical discussion of current issues in communications policy and their historical roots. Focuses on underlying rationales and models for government involvement and the complex dynamics introduced by co-evolving technologies, industry structure, and public policy objectives. Cases drawn from cellular, fixed-line, and Internet applications include evolution of spectrum policy and current proposals for reform; the migration to broadband and implications for universal service policies; and property rights associated with digital content. Lays foundation for thesis research in this domain.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.68",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "ESD.10",
            "in-charge":     [
                "Field, F. R.",
                "Clark, D. D.",
                "Lehr, W. H."
            ],
            "area":          "Technology"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.68-1",
            "lecture-section-of": "ESD.68",
            "timeAndPlace":       "M 12:00-15:00 E51-061"
        },
        {
            "type":          "Class",
            "label":         "ESD.70J - Engineering Economy Module",
            "id":            "ESD.70J",
            "listing-index": "mESDa-081",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "1-0-2 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Presentation of the spreadsheet mechanics for the efficient calculation of discounted cash flows and related metrics of project worth; the use of data tables as means of exploring sensitivity analysis; and of simulation to develop the value of options. Intensive module designed for students who are not familiar with the efficient use of this Excel. Half-term subject offered in first half of term.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.70J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        "1.145J",
            "in-charge":     [
                "Neufville, R. de",
                "Staff"
            ],
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.71 - Engineering Systems Analysis for Design",
            "id":            "ESD.71",
            "listing-index": "mESDa-082",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Engineering systems design must have the flexibility to take advantage of new opportunities while avoiding disasters. Subject develops \"real options\" analysis to create design flexibility and measure its value so that it can be incorporated into system optimization. Subject builds on essential concepts of system models, decision analysis, and financial concepts. Emphasis on calculating value of real options with special attention given to efficient analysis and practical applications.  The material is organized and presented to deal with the contextual reality of technological systems, that substantially distinguishes the analysis of real options in engineering systems from that of financial options.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.71",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.146",
                "3.56",
                "16.861",
                "ESD.71",
                "1.145J"
            ],
            "in-charge":     "Neufville, R. de",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.72 - Engineering Risk-Benefit Analysis",
            "id":            "ESD.72",
            "listing-index": "mESDa-083",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Emphasis on three methodologies pertaining to decision making in the presence of uncertainty: reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). Risks of particular interest are those associated with large engineering projects such as the development of new products; the building, maintenance and operation of nuclear reactors and space systems. Presents and interprets some of the frameworks helpful for balancing risks and benefits in the situations that typically involve human safety, potential environmental effects, and large financial and technological uncertainties. Review of elementary probability theory and statistics included.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.72",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.155",
                "2.963",
                "3.577",
                "6.938",
                "10.816",
                "16.862",
                "22.82",
                "ESD.72",
                "18.02"
            ],
            "in-charge":     "Apostolakis, G. E.",
            "area":          "Methods"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.72-1",
            "lecture-section-of": "ESD.72",
            "timeAndPlace":       "MW 9:30-11:00 1-390"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.72-2",
            "rec-section-of": "ESD.72",
            "timeAndPlace":   "T 14:00-15:00 9-338"
        },
        {
            "type":          "Class",
            "label":         "ESD.721 - Engineering Risk-Benefit Analysis (Abridged)",
            "id":            "ESD.721",
            "listing-index": "mESDa-084",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Abbreviated version of ESD.72 with which it shares the lectures on reliability and probabilistic risk assessment (RPRA) and decision analysis (DA). Cost-benefit analysis is omitted.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.721",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "18.02",
            "in-charge":     "Apostolakis, G. E.",
            "area":          "Methods"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.721-1",
            "lecture-section-of": "ESD.721",
            "timeAndPlace":       "MW 9:30-11:00 1-390"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.721-2",
            "rec-section-of": "ESD.721",
            "timeAndPlace":   "T 12:00-13:00 9-338"
        },
        {
            "type":          "Class",
            "label":         "ESD.73J - Materials Selection, Design, and Economics",
            "id":            "ESD.73J",
            "listing-index": "mESDa-085",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "A survey of techniques for analyzing how the choice of materials, processes, and design determine properties, performance, and cost. Topics include production and cost functions, mathematical optimization, evaluation of single and multi-attribute utility, decision analysis, materials property charts, and performance indices. Students use analytical techniques to develop a plan for starting a new materials-related business.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.73J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.57J",
            "in-charge":     "Clark, J.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.730J - Materials Selection, Design, and Economics",
            "id":            "ESD.730J",
            "listing-index": "mESDa-086",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "A survey of techniques for analyzing how the choice of materials, processes, and design determine properties, performance, and cost.  Topics include production and cost functions, evaluation of single and multi-attribute utility, decision analysis, materials property charts, and performance indices.  Students use analytical techniques to develop a plan for starting a new manufacturing-related business. Restricted to Leaders for Manufacturing students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.730J",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "3.575J",
            "in-charge":     "Clark, J. P.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.74 - System Dynamics for Engineers",
            "id":            "ESD.74",
            "listing-index": "mESDa-087",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces the methodology and then develops applications to large-scale engineering systems, such as the design and construction of mega projects; the impacts of organization on system performance; and the interrelationships between technical systems and the social/political context in which such systems operate.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.74",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Lyneis, J.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.750J - System Optimization and Analysis for Manufacturing",
            "id":            "ESD.750J",
            "listing-index": "mESDa-088",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to mathematical modeling, optimization, and simulation, as applied to manufacturing. Specific methods include linear programming, network flow problems, integer and nonlinear programming, discrete-event simulation, heuristics and computer applications for manufacturing processes and systems. Restricted to Leaders for Manufacturing students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.750J",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.851J",
                "15.066J",
                "18.02"
            ],
            "in-charge":     [
                "Graves, S. C.",
                "Clark, J. P.",
                "Gallien, J."
            ],
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.751J - Engineering Probability and Statistics",
            "id":            "ESD.751J",
            "listing-index": "mESDa-089",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Modeling and analysis of uncertainty and variation. Probability models and distributions, regression, and basic statistical procedures pertinent to manufacturing. Introduction to experimental design, Taguchi methods, and statistical process control. Use of a data analysis package such as JMP or Minitab. Primarily for Leaders for Manufacturing students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.751J",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "15.064J",
                "18.02"
            ],
            "in-charge":     [
                "Barnett, A. I.",
                "Welsch, R."
            ],
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.753J - Statistical Learning and Data Mining",
            "id":            "ESD.753J",
            "listing-index": "mESDa-090",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction to theory and application of statistics and data mining, concentrating on techniques used in management science, finance, engineering systems, and bioinformatics. First half builds the statistical foundation for the second half which concentrates on data-mining, supervised learning, and  multivariate analysis. First half topics selected from sampling; theory of estimation; testing; nonparametric statistics; analysis of variance; categorical data analysis; regression analysis; MCMC; EM;  Gibbs sampling; hidden Markov models; and Bayesian methods. Second half topics selected from logistic regression; principal components and dimension reduction; discrimination and classification analysis and trees; partial least squares; nearest neighbor and regularized  methods; support vector machines; boosting and bagging; clustering; independent component analysis; and nonparametric regression. R, S+, Matlab, SAS, or similar statistics package used for data analysis and data mining.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.753J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "15.077J",
                "6.431",
                "15.085J",
                "18.440",
                "18.06",
                "18.700"
            ],
            "in-charge":     "Welsch, R. E.",
            "area":          "Methods"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.753J-1",
            "lecture-section-of": "ESD.753J",
            "timeAndPlace":       "MW 19:00-20:30 3-370"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.753J-2",
            "rec-section-of": "ESD.753J",
            "timeAndPlace":   "T 16:00-17:00 E51-085"
        },
        {
            "type":          "Class",
            "label":         "ESD.755J - Statistical Reasoning and Data Modeling",
            "id":            "ESD.755J",
            "listing-index": "mESDa-091",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Designed for students who have an acquaintance with statistics and want exposure to a wider range of topics and examples such as statistical computing and data analysis. Topics include advanced regression modeling: regression diagnostics, variable selection, and robust regression. Design of experiments and analysis of variance. Introduction to data-mining includes stratified sampling, classification, logistic regression, and clustering; time series analysis and forecasting; process control; and Bayesian methods. Use of statistical computing systems including Excel add-ins and stand-alone packages. Case studies involving finance, management science, and engineering systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.755J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "15.074J",
            "in-charge":     "Welsch, R. E.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.756J - Statistical Methods in Experimental Design",
            "id":            "ESD.756J",
            "listing-index": "mESDa-092",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Statistically based experimental design inclusive of forming hypotheses, planning and conducting experiments, analyzing data, and interpreting and communicating results. Topics include descriptive statistics, statistical inference, hypothesis testing, parametric and nonparametric statistical analyses, factorial ANOVA, randomized block designs, MANOVA, linear regression, repeated measures models, and application of statistical software packages.  Alternate years.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.756J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.470J",
                "6.041"
            ],
            "in-charge":     "Cummings, M. L.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.762 - Systems Optimization",
            "id":            "ESD.762",
            "listing-index": "mESDa-093",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "Application-oriented introduction to systems optimization focusing on understanding system tradeoffs. Introduces modeling methodology (linear, integer and nonlinear programming) and simulation methods, with applications in production planning and scheduling, inventory planning and supply contracts, logistics network design, facility sizing and capacity expansion, yield management, electronic trading and finance.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.762",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Staff",
            "area":          "Methods"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.762-1",
            "lecture-section-of": "ESD.762",
            "timeAndPlace":       "TR 9:30-11:00 9-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.763 - Operations and Supply Chain Management",
            "id":            "ESD.763",
            "listing-index": "mESDa-094",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "Objectives are to develop modeling skills and to provide new concepts and problem-solving tools, applicable to the design and planning of supply chains as well as manufacturing systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.763",
            "semester":      "Summer",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Staff",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.77J - Multidisciplinary System Design Optimization",
            "id":            "ESD.77J",
            "listing-index": "mESDa-095",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Engineering systems modeling for design and optimization. Selection of design variables, objective functions and constraints. Overview of principles, methods and tools in multidisciplinary design optimization (MDO). Subsystem identification, development and interface design. Review of linear and non-linear constrained optimization formulations. Scalar versus vector optimization problems from systems engineering and architecting of complex systems. Heuristic search methods: Tabu search, simulated annealing, genetic algorithms. Sensitivity, tradeoff analysis and isoperformance. Multiobjective optimization and pareto optimality. System design for value. Specific applications from aerospace, mechanical, civil engineering and system architecture.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.77J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "16.888J",
                "18.085"
            ],
            "in-charge":     [
                "Weck, O. de",
                "Willcox, K.E."
            ],
            "area":          "Methods"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.77J-1",
            "lecture-section-of": "ESD.77J",
            "timeAndPlace":       "TR 13:00-14:30 9-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.772J - Quantitative Foundations of Engineering Systems",
            "id":            "ESD.772J",
            "listing-index": "mESDa-096",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "This interdisciplinary subject aims to teach quantitative principles of design and analysis of large complex engineering systems at the beginning graduate level. Topics include principles of modeling, systems design, control and performance analysis using ideas from control, optimization, algorithms and stochastic processes. Designed as more conceptual and less technical (mathematical). That is, use of mathematics (sometimes sophisticated) is taught but the detailed proofs are usually omitted. Concepts supported and explained with examples drawn from the Internet. Provides the necessary background for advanced subjects on foundations of engineering systems.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.772J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "6.282J",
                "6.041"
            ],
            "in-charge":     [
                "Mitter, S.",
                "Shah, D."
            ],
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.78J - Network Optimization",
            "id":            "ESD.78J",
            "listing-index": "mESDa-097",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Network models for industrial logistics systems, transportation systems, communication systems, and other applications. Emphasizes a rigorous treatment of algorithms and their efficiency?algorithms for shortest routes, maximum flows, minimum cost flows, traffic equilibrium, and network design. Implementation issues.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.78J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "6.855J",
                "15.082J",
                "6.046J",
                "6.251J",
                "15.081J"
            ],
            "in-charge":     "Schulz, A. S.",
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.79J - Quantum Computation",
            "id":            "ESD.79J",
            "listing-index": "mESDa-098",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Provides an introduction to the theory and practice of quantum  computation. Topics covered: physics of information processing; quantum algorithms including the factoring algorithm and Grover's search algorithm; quantum error correction; quantum communication and cryptography. Knowledge of quantum mechanics helpful but not required.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.79J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.111J",
                "18.435J"
            ],
            "in-charge":     [
                "Farhi, E.",
                "Lloyd, S.",
                "Shor, P."
            ],
            "area":          "Methods"
        },
        {
            "type":          "Class",
            "label":         "ESD.80 - Seminar in Technology Policy Research",
            "id":            "ESD.80",
            "listing-index": "mESDa-099",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-1",
            "total-units":   3,
            "has-final":     false,
            "description":   "Presentations by students, faculty and guest speakers of ongoing research related to current issues in technology and policy. Specific topics determined by research of participants and by new and important directions in technology and policy.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.80",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "ESD.10",
            "in-charge":     "Kirchain, R.",
            "area":          "Professional Development"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.80-1",
            "lecture-section-of": "ESD.80",
            "timeAndPlace":       "T 12:30-14:30 3-370"
        },
        {
            "type":          "Class",
            "label":         "ESD.801 - Leadership Development",
            "id":            "ESD.801",
            "listing-index": "mESDa-100",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "1-1-1 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Seminar environment created to develop leadership capabilities. An initial Outward Bound experience builds trust, teamwork and communications. Readings and assignments emphasize the characteristics of great leadership. Global leaders participate in the Leadership Lunch series to share their experiences and recommendations. Discussions explore leadership development. Culminates in a personal leadership plan. Restricted to entering students in the Technology and Policy program or instructor permission.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.801",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "in-charge":     "Newman, D.",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.802 - SDM Thesis Seminar",
            "id":            "ESD.802",
            "listing-index": "mESDa-101",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-1 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Designed to assist SDM students in discovering research areas of interest and matching these interests with faculty and organization research projects. At the end of the seminar, the student has faculty advisor, research project, thesis proposal and plan. Restricted to SDM students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.802",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Hale, P.",
            "area":          "Professional Development"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.802-1",
            "lecture-section-of": "ESD.802",
            "timeAndPlace":       "T 16:30-18:00 9-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.803 - Know Thyself Leadership Workshop",
            "id":            "ESD.803",
            "listing-index": "mESDa-102",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-4",
            "total-units":   6,
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.803",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.81 - Studies in Transportation and Logistics",
            "id":            "ESD.81",
            "listing-index": "mESDa-103",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Individual advanced study of a topic in logistics systems selected with the approval of the instructor.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.81",
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Staff",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.811 - Technology Policy Internship Seminar",
            "id":            "ESD.811",
            "listing-index": "mESDa-104",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "1-1-1 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Seminar examines what technology policy is in practice. Considers the question of \"Who achieves what, when, how, and why?\" regarding technology policy. Students who completed summer internships present and dissect their experiences with special reference to specific cases in which they participated.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.811",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "ESD.10",
            "in-charge":     "Field, F.",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.83 - Doctoral Seminar in Engineering Systems",
            "id":            "ESD.83",
            "listing-index": "mESDa-105",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "6-0-6",
            "total-units":   12,
            "has-final":     false,
            "description":   "Examines core theory and contextual applications of the emerging field of Engineering Systems. Focus on doctoral-level analysis of scholarship on key concepts such as complexity, uncertainty, fragility, and robustness, as well as a critical look at the historical roots of the field and related areas such as systems engineering, systems dynamics, agent modeling, and systems simulations. Contextual applications range from aerospace to technology implementation to regulatory systems to large-scale systems change. Special attention given to the interdependence of social and technical dimensions of engineering systems. Restricted to students enrolled in doctoral programs.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.83",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "ESD.10",
            "in-charge":     [
                "Magee, C.",
                "Sussman, J."
            ],
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.832 - Mining Data, Modeling Systems, Making Impact",
            "id":            "ESD.832",
            "listing-index": "mESDa-106",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Seminar on modeling engineering-economic systems for real-world applications. Successful applications require data analysis, systems modeling and judgment of importance. Introduction to data mining techniques and software. Cases of real world applications of systems models used to demonstrate the art.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.832",
            "semester":      "Spring",
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     [
                "Larson, R. C.",
                "Patel, N."
            ],
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.85J - Integrating Doctoral Seminar on Emerging Technologies",
            "id":            "ESD.85J",
            "listing-index": "mESDa-107",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "2-0-7",
            "total-units":   9,
            "has-final":     false,
            "description":   "Team-taught subject for doctoral students working on emerging technologies at the interface of technology, policy and societal issues. Integrates concepts of research strategy and design from a variety of disciplines. Addresses problem identification and formulation of research topics, the role of qualitative and quantitative research methods, and the use of various data collection techniques. Focuses on students' thesis proposals, faculty-student study panels, critical evaluation of research design, and ethical issues in conducting research and gathering data.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.85J",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "17.312J",
                "STS.461J"
            ],
            "in-charge":     "Oye, K.",
            "area":          "Professional Development"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.85J-1",
            "lecture-section-of": "ESD.85J",
            "timeAndPlace":       "W 15:00-17:00 E51-393"
        },
        {
            "type":          "Class",
            "label":         "ESD.86 - Models, Data and Inference for Socio-Technical Systems",
            "id":            "ESD.86",
            "listing-index": "mESDa-108",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Use data and systems knowledge to build models of complex socio-technical systems for improved system design and decision-making. Enhance model-building skills, including: review and extension of functions of random variables, Poisson processes, and Markov processes. Move from applied probability to statistics via Chi-squared t and f tests, derived as functions of random variables. Review classical statistics, hypothesis tests, regression, correlation and causation, simple data mining techniques, and Bayesian vs. classical statistics. Class project. Enrollment limited to 25 students.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.86",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "prereq":        [
                "ESD.83",
                "6.041"
            ],
            "in-charge":     [
                "Larson, R. C.",
                "Frey, D. D."
            ],
            "area":          "Professional Development"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.86-1",
            "lecture-section-of": "ESD.86",
            "timeAndPlace":       "MW 10:30-12:00 66-154"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.86-2",
            "rec-section-of": "ESD.86",
            "timeAndPlace":   "F 10:30-12:00 66-154"
        },
        {
            "type":          "Class",
            "label":         "ESD.863J - System Safety",
            "id":            "ESD.863J",
            "listing-index": "mESDa-109",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Covers important concepts and techniques in designing and operating safety-critical systems. Topics include the nature of risk, formal accident and human error models, causes of accidents, fundamental concepts of system safety engineering, system and software hazard analysis, designing for safety, fault tolerance, safety issues in the design of human-machine interaction, verification of safety, creating a safety culture, and management of safety-critical projects. Includes a class project involving the high-level system design and analysis of a safety-critical system.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.863J",
            "semester":      "Spring",
            "offering":      "Not offered this year",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        "16.863J",
            "in-charge":     "Leveson, N. G.",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.875J - Mechanical Assemblies: Their Design, Manufacture, and Role in Product Development",
            "id":            "ESD.875J",
            "listing-index": "mESDa-110",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces mechanical and economic models of assemblies and assembly automation on two levels. Assembly in the small comprises basic engineering models of rigid and compliant part mating and explains the operation of the Remote Center Compliance. Assembly in the large takes a system view of assembly, including the notion of product architecture, feature-based design and computer models of assemblies, analysis of mechanical constraint, assembly sequence analysis, tolerances, system-level design for assembly and JIT methods, and economics of assembly automation. Case studies and current research included. Class exercises and homework include analyses of real assemblies, the mechanics of part mating, and a semester long project.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.875J",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "2.875J",
                "2.008"
            ],
            "in-charge":     "Whitney, D. E.",
            "area":          "Professional Development"
        },
        {
            "type":          "Class",
            "label":         "ESD.910?ESD.920 - Research in Engineering Systems Division",
            "id":            "ESD.910?ESD.920",
            "listing-index": "mESDa-111",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "For research assistants in the Engineering Systems Division when assigned research is not used for thesis, but is approved for academic credit. Credit for this subject may not be used for any degree granted by ESD.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.910?ESD.920",
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Neufville, Information: R. de",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.921?ESD.929 - Teaching in Engineering Systems Division",
            "id":            "ESD.921?ESD.929",
            "listing-index": "mESDa-112",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.921?ESD.929",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.930 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.930",
            "listing-index": "mESDa-113",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Fall: Information: R. de Neufville",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.930",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "in-charge":     "Saar, S.",
            "area":          "Special Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.930-1",
            "lecture-section-of": "ESD.930",
            "timeAndPlace":       "F 9:00-12:00 4-153"
        },
        {
            "type":           "RecitationSection",
            "label":          "RESD.930-2",
            "rec-section-of": "ESD.930",
            "timeAndPlace":   "F 13:00-16:00 4-153"
        },
        {
            "type":          "Class",
            "label":         "ESD.931?ESD.933 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.931?ESD.933",
            "listing-index": "mESDa-114",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.931?ESD.933",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.934?ESD.938 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.934?ESD.938",
            "listing-index": "mESDa-115",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.934?ESD.938",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "1), F1-4 (BEGINS APRIL",
            "area":          "Special Subjects"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.934?ESD.938-1",
            "lecture-section-of": "ESD.934?ESD.938",
            "timeAndPlace":       "MW 9:00-10:30 4-153"
        },
        {
            "type":               "LectureSection",
            "label":              "LESD.934?ESD.938-2",
            "lecture-section-of": "ESD.934?ESD.938",
            "timeAndPlace":       "F 13:00-16:00 9-057"
        },
        {
            "type":          "Class",
            "label":         "ESD.939 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.939",
            "listing-index": "mESDa-116",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.939",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.940 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.940",
            "listing-index": "mESDa-117",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.940",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.941 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.941",
            "listing-index": "mESDa-118",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.941",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.942 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.942",
            "listing-index": "mESDa-119",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.942",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.943 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.943",
            "listing-index": "mESDa-120",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.943",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.944 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.944",
            "listing-index": "mESDa-121",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.944",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.945 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.945",
            "listing-index": "mESDa-122",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.945",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.946 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.946",
            "listing-index": "mESDa-123",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.946",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.947 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.947",
            "listing-index": "mESDa-124",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.947",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.948 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.948",
            "listing-index": "mESDa-125",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.948",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.949 - Special Graduate Studies in Engineering Systems Division",
            "id":            "ESD.949",
            "listing-index": "mESDa-126",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.949",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.950?ESD.951 - Special Undergraduate Studies in Engineering Systems Division",
            "id":            "ESD.950?ESD.951",
            "listing-index": "mESDa-127",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.950?ESD.951",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.955?ESD.956 - Special Undergraduate Studies in Engineering Systems Division",
            "id":            "ESD.955?ESD.956",
            "listing-index": "mESDa-128",
            "course":        "ESD",
            "level":         "Undergrad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "No description available.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.955?ESD.956",
            "semester":      [
                "Fall",
                "IAP",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "area":          "Special Subjects"
        },
        {
            "type":          "Class",
            "label":         "ESD.ThG - ESD Graduate Thesis",
            "id":            "ESD.ThG",
            "listing-index": "mESDa-129",
            "course":        "ESD",
            "level":         "Grad",
            "units":         "Unknown",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Program of research, leading to the writing of an SM or PhD thesis to be arranged by the student with a member of the ESD faculty. A minimum of 24 thesis units are required for the SM degree.",
            "url":           "http://student.mit.edu/catalog/mESDa.html#ESD.ThG",
            "semester":      [
                "Fall",
                "Spring",
                "Summer"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "category":      "H-LEVEL Grad Credit",
            "in-charge":     "Neufville, R. de",
            "area":          "Special Subjects"
        }
    ]
}