{
    "items": [
        {
            "type":          "Class",
            "label":         "Inventions and Patents",
            "id":            "",
            "listing-index": "mSWEa-000",
            "course":        "",
            "level":         "Undergrad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "History of private and public rights in scientific discoveries and applied engineering, leading to the development of worldwide patent systems. The classes of invention protectable under the patent laws of the US, including the procedures in protecting inventions in the Patent Office and the courts. Reviews of past cases involving inventions and patents in a) the chemical process industry and medical pharmaceutical, biological, and genetic-engineering fields; b) devices in the mechanical, ocean exploration, civil, and/or aeronautical fields; c) the electrical, computer, software, and electronic areas, including key radio, solid-state, computer and software inventions; and also d) software protection afforded under copyright laws. Conducting periodic joint real-time class sessions and discussions by video-audio Internet conferencing, with other universities. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "3.172",
                "6.901",
                "16.652",
                "14.02"
            ],
            "in-charge":     "Rines, R. H."
        },
        {
            "type":          "Class",
            "label":         "Management in Engineering",
            "id":            "",
            "listing-index": "mSWEa-001",
            "course":        "",
            "level":         "Undergrad",
            "units":         "3-1-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduction and overview of engineering management. Financial principles, management of innovation, technical strategy and best management practices. Case study method of instruction emphasizes participation in class discussion. Focus is on the development of individual skills and management tools. Registrants should be juniors or seniors. Students taking graduate subject 2.961 are expected to demonstrate higher level of proficiency in term projects.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "2.961",
                "6.930J",
                "10.806J",
                "16.653J"
            ],
            "in-charge":     [
                "d'Arbeloff, A. V.",
                "Chun, J.-H."
            ]
        },
        {
            "type":          "Class",
            "label":         "Engineering Risk-Benefit Analysis",
            "id":            "",
            "listing-index": "mSWEa-002",
            "course":        "",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Emphasis on three methodologies pertaining to decision making in the presence of uncertainty: reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). Risks of particular interest are those associated with large engineering projects such as the development of new products; the building, maintenance and operation of nuclear reactors and space systems. Presents and interprets some of the frameworks helpful for balancing risks and benefits in the situations that typically involve human safety, potential environmental effects, and large financial and technological uncertainties. Review of elementary probability theory and statistics included.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.155",
                "2.963",
                "3.577",
                "6.938",
                "10.816",
                "16.862",
                "22.82",
                "18.02"
            ],
            "in-charge":     "Apostolakis, G. E."
        },
        {
            "type":          "Class",
            "label":         "Engineering Systems Analysis for Design",
            "id":            "",
            "listing-index": "mSWEa-003",
            "course":        "",
            "level":         "Grad",
            "units":         "3-0-6",
            "total-units":   9,
            "has-final":     false,
            "description":   "",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.146",
                "3.56",
                "16.861",
                "1.145J"
            ],
            "in-charge":     "Neufville, R. de"
        },
        {
            "type":          "Class",
            "label":         "Applications of Technology in Energy and the Environment",
            "id":            "",
            "listing-index": "mSWEa-004",
            "course":        "",
            "level":         "Grad",
            "units":         "3-0-9",
            "total-units":   12,
            "has-final":     false,
            "description":   "Introduces advanced undergraduates or graduate students in the Schools of Engineering and Science to the integration of technical, economic, political, and environmental consideration required for the successful implementation of new technology. Case studies are drawn from the energy and environment sectors with some emphasis on analytic techniques that serve as a \"tool box\" for students. Technologies considered include fossil, nuclear, solar, wind, fuel cell and energy conservation. International aspects, such as weapons proliferation and global climate effects, also discussed. Enrollment limited.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "category":      "H-LEVEL Grad Credit",
            "prereq":        [
                "1.149",
                "2.63",
                "5.00",
                "10.579",
                "22.813"
            ],
            "in-charge":     [
                "Deutch, J.",
                "Lester, R."
            ]
        },
        {
            "type":          "Class",
            "label":         "UPOP IAP Workshop",
            "id":            "",
            "listing-index": "mSWEa-005",
            "course":        "",
            "level":         "Undergrad",
            "units":         "3-0-0 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Provides engineering sophomores the opportunity to build the core foundation of skills necessary to succeed in and prepare for a summer practice experience. Introduces concepts in product development, system dynamics, organizational dynamics, and effective communication. Also introduces concepts in ethics and character, and leadership and teamwork to ensure that students acquire an appreciation of the social, environmental, and ethical implications of organizational decision making. Subject is an interactive experience integrating lectures with role-playing, simulations, and group projects, where students apply these concepts in a case study context. Students are provided with a journal to be used during their summer training practice. Limited enrollment.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "IAP",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.EPW",
                "2.EPW",
                "3.EPW",
                "6.EPW",
                "10.EPW",
                "16.EPW",
                "22.EPW"
            ],
            "in-charge":     "Yue, D. K. P."
        },
        {
            "type":          "Class",
            "label":         "UPOP Summer Practice Experience",
            "id":            "",
            "listing-index": "mSWEa-006",
            "course":        "",
            "level":         "Undergrad",
            "units":         "0-1-0 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Provides engineering students, typically sophomores, the opportunity to participate in engineering practice.  Students gain experience with recruitment and job selection, the job experience, and the assessment and reflection process. Spring term includes seminars and workshops in preparation for internship and management of career path.  With the assistance of UPOP staff, students find and engage in a 10-12 week summer job experience, during which they maintain a journal of their experiences.  In the Fall term, students write essays addressing the topics introduced in UPOP EPW workshop during IAP, complete a post-summer self-evaluation form, and discuss these forms with their regular academic advisor. Students have the opportunity to share their experiences with others in a roundtable discussion.  Can be taken up to two times for credit. Spring term can only be taken in conjunction with the Fall term.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      [
                "Can be repeated for credit",
                "Currently Offered"
            ],
            "prereq":        [
                "1.EPE",
                "2.EPE",
                "3.EPE",
                "10.EPE",
                "16.EPE",
                "22.EPE",
                "2.EPW"
            ],
            "in-charge":     "Yue, D. K. P."
        },
        {
            "type":          "Class",
            "label":         "UPOP Reflective Learning Experience",
            "id":            "",
            "listing-index": "mSWEa-007",
            "course":        "",
            "level":         "Undergrad",
            "units":         "0-0-3 [P/D/F]",
            "total-units":   "Unknown",
            "has-final":     false,
            "description":   "Provides engineering sophomores the opportunity to reflect and share their summer practice experiences as related to the topics of the IAP subject and students' academic subjects through a written report and an oral presentation delivered at a UPOP Symposium in the fall.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Fall",
            "offering":      "Currently Offered",
            "prereq":        [
                "1.EPR",
                "2.EPR",
                "3.EPR",
                "10.EPR",
                "16.EPR",
                "22.EPR",
                "2.EPE"
            ],
            "in-charge":     "Yue, D. K. P."
        },
        {
            "type":          "Class",
            "label":         "Innovation Teams",
            "id":            "",
            "listing-index": "mSWEa-008",
            "course":        "",
            "level":         "Grad",
            "units":         "3-2-4",
            "total-units":   9,
            "has-final":     false,
            "description":   "Innovation teams of science, engineering, and management students evaluate the commercial feasibility of research generated by grants to School of Engineering faculty by the Deshpande Center for Technological Innovation. Projects cover critical aspects of commercialization such as developing an intellectual property strategy, performing competitive analysis, selecting the target application and market for the technology, identifying the appropriate business model for commercialization, designing a go-to-market plan, and choosing the sales approach to garner initial customers. Lectures address key issues of technology transfer, new venture creation, and commercialization. Students develop strong skills in communication and working in teams. Resume and application including a brief statement of objectives are required in advance of registration to enable the best match of students with projects.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      [
                "Fall",
                "Spring"
            ],
            "offering":      "Currently Offered",
            "prereq":        "15.371J",
            "in-charge":     [
                "Cooney, C.",
                "Roberts, E.",
                "Zolot, K."
            ]
        },
        {
            "type":          "Class",
            "label":         "Introduction to Modeling and Simulation",
            "id":            "",
            "listing-index": "mSWEa-009",
            "course":        "",
            "level":         "Undergrad",
            "units":         "4-0-8",
            "total-units":   12,
            "has-final":     false,
            "description":   "Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations.",
            "url":           "http://student.mit.edu/catalog/mSWEa.html#",
            "semester":      "Spring",
            "offering":      "Currently Offered",
            "category":      "Restricted Electives in Science and Technology",
            "prereq":        [
                "1.021",
                "3.021",
                "10.333",
                "18.361",
                "22.00",
                "18.03"
            ],
            "in-charge":     [
                "Buehler, M.",
                "Radovitzky, R.",
                "Thonhauser, T."
            ]
        }
    ]
}