{"items":[{"has-final":false,"semester":"Fall","description":"What kinds of wisdom do other ways of life offer our own? How do other perspectives on the world challenge our assumptions about life? These questions are addressed through the four fields of anthropology: biological, cultural, and linguistic anthropology, and archaeology. We examine family and kinship, religion, economics, politics, survival of indigenous groups, and Western influences from an anthropological perspective to gain appreciation for cultural and ethnic diversity.","label":"21A.100 - Introduction to Anthropology","type":"Class","units":"3-0-9","in-charge":"Howe, J.","offering":"Currently Offered","id":"21A.100","category":"HASS-D 4","area":"Introductory","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.100","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Students are introduced to anthropological fieldwork and the concept of culture from readings, films, and their own research projects in the Boston area. A practice-focused approach to understanding cultural differences and what produces them. Students discover the excitement and challenges of systematically observing human interaction and convincing others of the accuracy of their findings.","label":"21A.109 - Understanding Culture","type":"Class","units":"3-0-9","in-charge":"Paxson, H.","offering":"Currently Offered","id":"21A.109","category":"HASS-D 4","area":"Introductory","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.109","total-units":"12.0"},{"lecture-section-of":"21A.109","timeAndPlace":["TR 11:00-12:30 16-220"],"type":"LectureSection","label":"s21A.109-1"},{"has-final":false,"semester":"Fall","description":"Focuses on core issues and approaches in anthropological theory and method. Studies theoretical frameworks for the analysis and integration of material from other subjects in cultural anthropology. Reading and discussion of classics of anthropological theory and contemporary critiques.  Students prepare and present analyses of texts.","label":"21A.110 - Seminar in Anthropological Theory","type":"Class","units":"3-0-9","in-charge":"Jackson, J.","offering":"Currently Offered","id":"21A.110","category":"HASS Elective","area":"Introductory","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.110","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Introduction to ethnographic practices: the study of and communicating about culture. Subject provides instruction and practice in writing, revision of fieldnotes, and a final paper.","label":"21A.112 - Seminar in Ethnography and Fieldwork","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":"Currently Offered","id":"21A.112","category":"HASS Elective","area":"Introductory","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.112","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explores the relationship between music and the supernatural, focusing on the social history and context of supernatural beliefs as reflected in key literary and musical works from 1600 to the present.  Provides a better understanding of the place of ambiguity and the role of interpretation in culture, science and art.  Explores great works of art by Shakespeare, Verdi, Goethe (in translation), Gounod, Henry James and Benjamin Britten. Readings will also include selections from the most recent scholarship on magic and the supernatural. Writing assignments will range from web-based projects to analytic essays. No previous experience in music is necessary.  Projected guest lectures, musical performances, field trips.","prereq":"21M.013J","label":"21A.113J - The Supernatural in Music, Literature and Culture","type":"Class","units":"3-0-9","in-charge":["Harris, E.","Howe, J.","Shadle, C."],"offering":"Currently Offered","id":"21A.113J","category":["HASS-D 3","HASS Communication-Intensive"],"area":"Introductory","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.113J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Spiritual, magical, and \"occult\" aspects of human behavior in anthropological and historical perspective: magic, ritual curing, trance, spirit possession, sorcery, and accusations of witchcraft. Material drawn from traditional nonwestern societies, medieval and early modern Europe, and colonial and contemporary North America.","label":"21A.211 - Magic, Witchcraft, and the Spirit World","type":"Class","units":"3-0-9","in-charge":"Howe, J.","offering":"Not offered this year","id":"21A.211","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.211","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"How people make sense of their worlds symbolically through myth, ritual, metaphor, and cosmology. The structure of symbols, the natural and social elements they draw on, their social use, and the messages they convey. Students learn to record and analyze myth and ritual.","label":"21A.212 - Myth, Ritual, and Symbolism","type":"Class","units":"3-0-9","in-charge":"Howe, J.","offering":"Not offered this year","id":"21A.212","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.212","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examination of how medicine is practiced cross-culturally, with particular emphasis on Western biomedicine. Analysis of medical practice as a cultural system, focusing on the human, as opposed to the biological, side of things. Also, examines how we and people in other cultures think of disease, health, body, and mind.","label":"21A.215 - Medical Anthropology","type":"Class","units":"3-0-9","in-charge":"Jackson, J.","offering":"Currently Offered","id":"21A.215","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.215","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An introduction to the cross-cultural study of biomedical ethics. Examines moral foundations of the science and practice of western biomedicine through case studies of abortion, contraception, cloning, organ transplantation and other issues.  Evaluates challenges that new medical technologies pose to the practice and availability of medical  services around the globe, and to cross-cultural ideas of kinship and personhood.  Discusses critiques of the biomedical tradition from anthropological, feminist, legal, religious, and cross-cultural theorists. Enrollment limited.","prereq":"SP.622J","label":"21A.216J - Dilemmas in Biomedical Ethics: Playing God or Doing Good?","type":"Class","units":"3-0-9","in-charge":"James, E. C.","offering":"Currently Offered","id":"21A.216J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.216J","total-units":"12.0"},{"lecture-section-of":"21A.216J","timeAndPlace":["MW 11:00-12:30 16-220"],"type":"LectureSection","label":"s21A.216J-1"},{"has-final":false,"semester":"Spring","description":"Examines several theoretical perspectives on human identity and focuses on processes of creating categories of acceptable and deviant identities; how identities are formed, how behaviors are labelled, and how people enter deviant roles and worlds; and responses to differences and strategies for coping with these responses. Describes how identity and difference are inescapably linked. Enrollment limited.","prereq":"SP.454J","label":"21A.218J - Identity and Difference","type":"Class","units":"3-0-9","in-charge":"Jackson, J.","offering":"Currently Offered","id":"21A.218J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.218J","total-units":"12.0"},{"lecture-section-of":"21A.218J","timeAndPlace":["MW 14:30-16:00 56-162"],"type":"LectureSection","label":"s21A.218J-1"},{"has-final":false,"semester":"Spring","description":"Studies legal reasoning, types of law and legal systems, and relationship of law to social class and social change. Emphasis on the profession and practice of law including legal education, stratification within the bar, and the politics of legal services. Investigation of emerging issues in the relationship between institutions of law and science. Enrollment limited.","prereq":["11.163J","17.249J"],"label":"21A.219J - Law and Society","type":"Class","units":"3-0-9","in-charge":"Silbey, S.","offering":"Not offered this year","id":"21A.219J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.219J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"An examination of the problem of mass violence and oppression in the contemporary world, and of the concept of human rights as a defense against such abuse. Explores questions of cultural relativism, race, gender and ethnicity. Examines case studies from war crimes tribunals, truth commissions, anti-terrorist policies and other judicial attempts to redress state-sponsored wrongs. Considers whether the human rights framework effectively promotes the rule of law in modern societies. Students debate moral positions and address ideas of moral relativism. Enrollment limited.","prereq":"SP.621J","label":"21A.225J - Violence, Human Rights, and Justice","type":"Class","units":"3-0-9","in-charge":"James, E. C.","offering":"Not offered this year","id":"21A.225J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.225J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An introduction to the cross-cultural study of ethnic and national identity. Students explore the history of nationalism, focusing on ideologies about the nation-state, and look at the ways gender, religious and racial identities intersect with ethnic and national ones. Ethnic conflict is examined, along with the emergence of social movements based on identity, in particular indigenous rights movements and the ways culture can become highly politicized. Finally, students discuss the effects of globalization, migration, and transnational institutions. Enrollment limited.","label":"21A.226 - Ethnic and National Identity","type":"Class","units":"3-0-9","in-charge":"Jackson, J.","offering":"Currently Offered","id":"21A.226","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.226","total-units":"12.0"},{"lecture-section-of":"21A.226","timeAndPlace":["TR 14:30-16:00 66-154"],"type":"LectureSection","label":"s21A.226-1"},{"has-final":false,"semester":"Spring","description":"An introduction to the anthropological study of human sexuality, gender constructs, and the sociocultural systems that these are embedded in. Examines current critiques of Western philosophical and psychological traditions, and cross-cultural variability and universals of gender and sexuality. Enrollment limited.","prereq":"SP.455J","label":"21A.231J - Gender, Sexuality, and Society","type":"Class","units":"3-0-9","in-charge":"Paxson, H.","offering":"Not offered this year","id":"21A.231J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.231J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines how masculinity is represented in popular culture. Using recent approaches from anthropology, sociology, women\'s studies, minority discourses and cultural studies, popular culture is examined as a place where our identities, roles, pleasures and power are negotiated in everyday life. Topics may include the history of masculinity, masculinity as deviance, masculinity in consumer culture, and virtual masculinity.","prereq":"SP.410J","label":"21A.233J - Masculinity in Popular Culture","type":"Class","units":"3-0-9","in-charge":"Goodman, D.","offering":"Currently Offered","id":"21A.233J","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.233J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Americans have historically preferred to think of the United States in classless terms, as a land of economic opportunity equally open to all. Yet, social class remains a central fault line in the US. Subject explores the experiences and understandings of class among Americans positioned at different points along the US social spectrum. Considers a variety of classic frameworks for analyzing social class and uses memoirs, novels and ethnographies to gain a sense of how class is experienced in daily life and how it intersects with other forms of social difference such as race and gender.","label":"21A.235 - American Dream: Exploring Class in the US","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.235","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.235","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines one of the most enduring and influential forms of identity and experience in the Americas and Europe, and in particular the ways race and racism have been created, justified, or contested in scientific practice and discourse. Drawing on classical and contemporary readings from Du Bois to Gould to Gilroy, we ask whether the logic of race might be changing in the world of genomics and informatics, and with that changed logic, how we can respond today to new configurations of race, science, technology, and inequality. Considered are the rise of evolutionary racism; debates about eugenics in the early twentieth century; Nazi notions of \"racial hygiene\"; nation-building projects and race in Latin America; and the movement in modern biology from race to populations to genes and genomes.","label":"21A.240 - Race and Science","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":"Not offered this year","id":"21A.240","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.240","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Using examples from anthropology and sociology alongside classical and contemporary social theory, subject explores the nature of dominant and subordinate relationships, types of legitimate authority, and practices of resistance.  Examines how we are influenced in subtle ways by the people around us, who makes controlling decisions in the family, how people get ahead at work, and whether democracies, in fact, reflect the will of the people.","prereq":"17.045J","label":"21A.245J - Power: Interpersonal, Organizational and Global Dimensions","type":"Class","units":"3-0-9","in-charge":"Silbey, S.","offering":"Not offered this year","id":"21A.245J","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.245J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines historical and cross-cultural debates about the relationship between mind, brain, emotion, and behavior; memory and recall; sensory experience; and illness and healing. Assesses cultural traditions that challenge scientific interpretations of experience arising from western philosophical and physiological models. Explores how experience itself is culturally mediated, interpreted, and elaborated within symbolic, political, and other fields.","label":"21A.260 - Culture, Embodiment, and the Senses","type":"Class","units":"3-0-9","in-charge":"James, E. C.","offering":"Not offered this year","id":"21A.260","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.260","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Explores cross-cultural issues in food and identity, brought into focus by new attention to connections between what we eat and who we are. Uses anthropological and literary classics as well as recent writing on the politics of food and agriculture. Examines how identities and socialities are built through food production, preparation, and consumption. Considers how people use food to develop a sense of themselves as moral persons through embodying self-control or religious codes, or as a means of preserving the environment, cultural history, or one\'s health.","label":"21A.265 - Food and Culture","type":"Class","units":"3-0-9","in-charge":"Paxson, H.","offering":"Currently Offered","id":"21A.265","category":"HASS Elective","area":"Social Anthropology","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.265","total-units":"12.0"},{"lecture-section-of":"21A.265","timeAndPlace":["W 13:00-16:00 16-220"],"type":"LectureSection","label":"s21A.265-1"},{"has-final":false,"semester":"Spring","description":"Class debates the meaning of globalization and explores economic, social and cultural dynamics in various parts of the world. Questions include: have \"global\" dynamics existed in the past; is the world becoming more homogenous culturally; what is the influence of new technologies; what is capitalism and how is it changing. Subject  addresses issues such as: factory labor in Java; tourism in the Amazon; immigration in France; high-tech workers in the US; the film industry in Bombay, India; and baseball in Japan. Enrollment limited.","label":"21A.336 - Marketing, Microchips and McDonalds: Debating Globalization","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.336","category":["HASS Elective","HASS Communication-Intensive"],"area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.336","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines how and why people seek to capture life on film. Examines the motives of documentary and ethnographic filmmakers, including curiosity about exotic peoples, concern with documentary as a form of science, and an interest in capturing the truth about cultural life. Students view documentaries about people in the US and abroad, examining the relationship between film images and \"reality,\" tensions between art and observation, and the ethical relationship between filmmakers and those they film.","prereq":"CMS.917","label":"21A.337 - Documenting Culture","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.337","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.337","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines some of the root causes of inequality worldwide and the different consequences that poverty, economic transformations, and development policies often have for women and men. Through an exploration of daily life in Africa, Latin America, Asia and Melanesia, students examine the underlying political, economic, social, and gender dynamics that make \"development\" an ongoing, worldwide problem.","prereq":"SP.457J","label":"21A.338J - Gender, Power, and International Development","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.338J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.338J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines relationships among technology, culture, and politics in a variety of social and historical settings in an attempt to answer the question: has technology produced a better world? Contexts range from 19th century factories to 21st century techno dance floors, from hospitals to biotech firms, from colonial Melanesia to capitalist Massachusetts. Discussions organized around three questions: What cultural effects and risks follow from treating biology as technology; how have computers changed the way we think about ourselves; and how are politics built into our infrastructures?","prereq":"STS.075J","label":"21A.340J - Technology and Culture","type":"Class","units":"3-0-9","in-charge":"Downes, K.","offering":"Currently Offered","id":"21A.340J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.340J","total-units":"12.0"},{"lecture-section-of":"21A.340J","timeAndPlace":["R 19:00-10:00 16-220"],"type":"LectureSection","label":"s21A.340J-1"},{"has-final":false,"semester":"Spring","description":"Offers an international perspective on the environment. Using environmental conflict to consider the stakes that groups in various parts of the world have in nature, while also exploring how ecological and social dynamics interact and change over time, subject considers such controversial environmental issues as: nuclear contamination in Eastern Europe; genetic bioprospecting in Mexico; toxic run-off in the rural US; the Bhopal accident in India; and the impact of population growth in the Third World.","label":"21A.342 - Environmental Struggles","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.342","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.342","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines the relationship between drugs, politics, and society in cross-cultural perspective; use of mind-altering and habit-forming substances by \"traditional societies\"; the development of a global trade in sugar, opium, and cocaine with the rise of capitalism; and the use and abuse of alcohol, LSD, and Prozac in the US. Finishes by looking at the war on drugs, shifting attitudes to tobacco, and by evaluating America\'s drug laws.","prereq":"STS.062J","label":"21A.344J - Drugs, Politics, and Culture","type":"Class","units":"3-0-9","in-charge":"Goodman, D.","offering":"Currently Offered","id":"21A.344J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.344J","total-units":"12.0"},{"lecture-section-of":"21A.344J","timeAndPlace":["MW 13:00-14:30 56-154"],"type":"LectureSection","label":"s21A.344J-1"},{"has-final":false,"semester":"Spring","description":"Photographs in anthropology serve many purposes: as primary data, illustrations of words in a book, documentation for disappearing cultures, evidence of fieldwork, material objects for museum exhibitions, and even works of art. Topics include: the relationships between subject and treatment of image, between art and photography and ethnographic documentation, the role of a museum photograph and its caption, the social practice of \"taking pictures\" and a case study of photographing women in the Middle East and North Africa.","prereq":"CMS.835","label":"21A.348 - Photography and Truth","type":"Class","units":"3-0-9","in-charge":"Howe, J.","offering":"Currently Offered","id":"21A.348","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.348","total-units":"12.0"},{"lecture-section-of":"21A.348","timeAndPlace":["T 19:00-10:00 4-145"],"type":"LectureSection","label":"s21A.348-1"},{"has-final":false,"semester":"Spring","description":"Examines computers anthropologically, as highly meaningful tools and artifacts revealing the social and cultural orders that produce them. Classic texts in computer science are read along with works analyzing links between machines and culture. Explores early computation theory and capitalist manufacturing; cybernetics and WWII operations research; artificial intelligence and gendered subjectivity; the hacking aesthetic, commodification, and creation of the personal computer; the growth of the internet as a military, academic, and commercial project; the politics of identity in cyberspace; and the emergence of \"adaptive\" and \"evolutionary\" computation.","prereq":["SP.484J","STS.086J"],"label":"21A.350J - The Anthropology of Computing","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":"Not offered this year","id":"21A.350J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.350J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Applies the tools of anthropology to examine biology in the age of genomics, biotechnological enterprise, biodiversity conservation, pharmaceutical bioprospecting, and synthetic biology. Examine such social concerns such as bioterrorism, genetic modification, and cloning. Offers an anthropological inquiry into how the substances and explanations of biology ? ecological, organismic, cellular, molecular, genetic, informatic ? are changing. Examines such artifacts as cell lines, biodiversity databases, and artificial life models, and using primary sources in biology, social studies of the life sciences, and literary and cinematic materials, asks how we might answer Erwin Schrodinger\'s 1944 question, \"What Is Life?,\" today.","prereq":"STS.060J","label":"21A.355J - The Anthropology of Biology","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":"Currently Offered","id":"21A.355J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.355J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines the ways humans experience sound and how perceptions and technologies of sound emerge from cultural, economic, and historical worlds. Consider how the sound/noise boundary has been imagined, created, and modeled across sociocultural and scientific contexts. Learn how environmental, linguistic, and musical sounds are construed cross-culturally as well as the rise of telephony, architectural acoustics, sound recording, and the globalized travel of these technologies. Questions of sound ownership, property, authorship, and copyright in the digital age are also addressed.","prereq":"STS.065J","label":"21A.360J - The Anthropology of Sound","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":["Not offered next year","Currently Offered"],"id":"21A.360J","category":"HASS Elective","area":"Technology in Cultural Context","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.360J","total-units":"12.0"},{"lecture-section-of":"21A.360J","timeAndPlace":["R 13:00-16:00 16-220"],"type":"LectureSection","label":"s21A.360J-1"},{"has-final":false,"semester":"Spring","description":"Interdisciplinary introduction to contemporary Latin America, drawing on films, literature, popular press accounts, and scholarly research. Topics include economic development, ethnic and racial identity, religion, revolution, democracy, transitional justice, and the rule of law. Examples draw on a range of countries in the region, especially Mexico, Chile, and Brazil. Includes a heavy oral participation component, with regular breakout groups, formal class presentations on pressing social issues (such as criminal justice and land tenure), and a structured class debate.","prereq":["17.55J","21F.084J"],"label":"21A.430J - Introduction to Latin American Studies","type":"Class","units":"3-0-9","in-charge":"Lawson, C.","offering":"Not offered this year","id":"21A.430J","category":["HASS-D 4","HASS Communication-Intensive"],"area":"Areal and Historical Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.430J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"The 500-year encounter between native peoples of the Americas and European power and culture. Exploration and conquest. European ideology and fantasies about \"savages.\" Colonialism, resistance, and adaptation. Missionizing and culture contact. Cases include struggles of Maya, Iroquois, and native New Englanders. Students learn to use primary documents.","label":"21A.441 - The Conquest of America","type":"Class","units":"3-0-9","in-charge":"Kelley, E.","offering":"Currently Offered","id":"21A.441","category":"HASS-D 5","area":"Areal and Historical Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.441","total-units":"12.0"},{"lecture-section-of":"21A.441","timeAndPlace":["TR 13:00-14:30 56-169"],"type":"LectureSection","label":"s21A.441-1"},{"has-final":false,"semester":"Fall","description":"Examines the cultural production of peoples of the Middle East and North Africa. Topics include politics, social organization, gender roles, and the reception and dissemination of sacred narrative. How the West represents the Orient. How power and politics shape culture, narrative, and performance. Also discusses Middle Eastern communities in North America.","label":"21A.453 - Anthropology of the Middle East","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"21A.453","category":["HASS Elective","HASS Communication-Intensive"],"area":"Areal and Historical Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.453","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An introduction to women and gender in the Middle East and North Africa region, as reflected in anthropology, oral history, and literature. Are common themes\u0014e.g., the harem, the desert, the veil\u0014and modes of expression cross-disciplinary? How do readers determine point of view and positionality, ideology and subjectivity, in fictional, autobiographical, and ethnographic texts? Explores how scholarship in women\'s studies and gender studies addresses selected issues\u0014such as activism and human rights\u0014central to contemporary Middle East studies.","prereq":"SP.450J","label":"21A.458J - The Harem and the Veil: Images and Representations of Gender in the Middle East","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"21A.458J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Areal and Historical Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.458J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An exploration of colonial and postcolonial clashes between theories of healing and embodiment in the African world and those of western biomedicine. Examines how Afro-Atlantic religious traditions have challenged western conceptions of illness, healing, and the body, and have offered alternative notions of morality, rationality, kinship, gender and sexuality. Analyzes whether contemporary western biomedical interventions reinforce colonial or imperial power in the effort to promote global health in Africa and the African diaspora.","prereq":"SP.620J","label":"21A.460J - Medicine, Religion and Politics in Africa and the African Diaspora","type":"Class","units":"3-0-9","in-charge":"James, E. C.","offering":"Currently Offered","id":"21A.460J","category":"HASS Elective","area":"Areal and Historical Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.460J","total-units":"12.0"},{"lecture-section-of":"21A.460J","timeAndPlace":["T 13:00-16:00 16-276B"],"type":"LectureSection","label":"s21A.460J-1"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"21A.650, 21A.651 - Special Topics in Anthropology","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"21A.650, 21A.651","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.650, 21A.651","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Seminar for subjects taught outside the regularly-offered curriculum.  Topic for Fall 2007: Reproductive Politics and Technologies.  Instructor: H. Paxson.","label":"21A.660 - Special Seminars in Anthropology","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"21A.660","category":"HASS Elective","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.660","total-units":"12.0"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Seminar for subjects taught outside the regularly-offered curriculum.","label":"21A.661 - Special Seminars in Anthropology","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"21A.661","category":"HASS Elective","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.661","total-units":"12.0"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Seminar for subjects taught outside the regularly-offered curriculum.","label":"21A.662 - Special Seminars in Anthropology","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"21A.662","category":"HASS Elective","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.662","total-units":"12.0"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Seminar for subjects taught outside the regularly-offered curriculum.","label":"21A.663 - Special Seminars in Anthropology","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"21A.663","category":"HASS Elective","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.663","total-units":"12.0"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Seminar for subjects taught outside the regularly-offered curriculum.","label":"21A.664 - Special Seminars in Anthropology","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"21A.664","category":"HASS Elective","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.664","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"21A.URG - Undergraduate Research","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"21A.URG","area":"Special Topics","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.URG","total-units":"Unknown"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Fall","description":"Major theorists and theoretical schools since the late nineteenth century. Marx, Weber, Durkheim, Bourdieu, Levi-Strauss, Geertz, Foucault, Gramsci, and others. Key terms, concepts, and debates.","prereq":"STS.250J","label":"21A.750J - Social Theory and Analysis","type":"Class","units":"3-0-9","in-charge":"Fischer, M.","offering":"Currently Offered","id":"21A.750J","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.750J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Spring","description":"Training in the design and practice of qualitative research. Organized around illustrative texts, class exercises, and student projects. Topics include the process of gaining access to and participating in the social worlds of others; techniques of observation, fieldnote-taking, researcher self-monitoring and reflection; methods of inductive analysis of qualitative data including conceptual coding, grounded theory, and narrative analysis. Discussion of research ethics, the politics of fieldwork, modes of validating researcher accounts, and styles of writing up qualitative field research.","prereq":"STS.401J","label":"21A.760J - Qualitative Research Methods","type":"Class","units":"3-6-3","in-charge":"Silbey, S.","offering":"Not offered this year","id":"21A.760J","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.760J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Spring","description":"Explores theories and production of documentary film and video-making. Topics include how documentaries encapsulate or contest commonplace meanings of reality and truth in everyday life; how the historical use of visual technologies have alternately built upon and contested positivistic scientific understandings; and how historical transformations in film and video technologies periodically restructure the nature of documentary filmmaking, reshaping understandings of everyday truth in the process. Assignments in written and production-oriented exercises.","prereq":"STS.451J","label":"21A.780J - Representing Reality: Theories and Production of Documentary Film and Video","type":"Class","units":"3-0-9","in-charge":["Walley, C.","Boebel, C."],"offering":"Not offered this year","id":"21A.780J","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.780J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Fall","description":"An historical and cross-cultural study of the logics and practices of intervention: the ways that individuals, institutions, and governments identify conditions of need or  states of emergency within and across borders that require a response. Examines when a response is viewed as obligatory, when is it deemed unnecessary, and by whom; when the intercession is considered fulfilled; and the rationales or assumptions that are employed in assessing interventions. Theories of the state, globalization, and humanitarianism; power, policy, and institutions; gender, race, and ethnicity; and law, ethics, and morality are examined.","prereq":"11.238J","label":"21A.790J - Ethics of Intervention: Anthropological Approaches","type":"Class","units":"3-0-9","in-charge":"James, E. C.","offering":"Not offered this year","id":"21A.790J","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.790J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Fall","description":"Explores the complex interrelationships among humans and natural environments, focusing on non-western parts of the world in addition to Europe and the United States. Use of environmental conflict to draw attention to competing understandings and uses of \"nature\" as well as the local, national and transnational power relationships in which environmental interactions are embedded.  In addition to utilizing a range of theoretical perspectives, subject draws upon a series of ethnographic case studies of environmental conflicts in various parts of the world.","prereq":"STS.320J","label":"21A.800J - Environmental Conflict and Social Change","type":"Class","units":"3-0-9","in-charge":"Walley, C.","offering":"Not offered this year","id":"21A.800J","category":"H-LEVEL Grad Credit","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.800J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Spring","description":"Intensive reading and analysis of key works in the theory and methods of the social study of science and technology. Aims at understanding the different questions social scientists have posed in exploring how cultural context and norms influence the work of scientists and engineers. Students read works in the philosophy and sociology of science, the anthropology of laboratory culture, the feminist critique of science, political economic and policy analyses of biotechnology, and in rhetoric of scientific texts.","prereq":"STS.350J","label":"21A.810J - Social Study of Science and Technology","type":"Class","units":"3-0-9","in-charge":"Helmreich, S.","offering":"Not offered this year","id":"21A.810J","category":"H-LEVEL Grad Credit","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.810J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Spring","description":"A practicum-style course in anthropological methods of ethnographic fieldwork and writing, intended especially for STS, CMS, HTC, and Sloan graduate students, but open to others with permission of instructor. Depending on student experience in ethnographic reading and practice, the subject is a mix of reading anthropological and science studies ethnographies; and formulating and pursuing ethnographic work in local labs, companies, or other sites.","prereq":"STS.360J","label":"21A.820J - Ethnography","type":"Class","units":"3-0-9","in-charge":"Fischer, M.","offering":["Not offered next year","Currently Offered"],"id":"21A.820J","category":"H-LEVEL Grad Credit","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.820J","total-units":"12.0"},{"lecture-section-of":"21A.820J","timeAndPlace":["T 12:00-15:00 E51-390"],"type":"LectureSection","label":"s21A.820J-1"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":"Fall","description":"Foundations of good empirical research in the social sciences. Introduction to the basic assumptions and underlying logic of both quantatative and qualitative methodologies. Explore a variety of approaches to research design, evaluate the products of empirical research, and practice several common techniques. Students develop a framework for their own research project.","prereq":"STS.380J","label":"21A.860J - Methods for Graduate Research in the Social Sciences","type":"Class","units":"3-0-9","in-charge":["Silbey, S.","McCants, A."],"offering":"Currently Offered","id":"21A.860J","category":"H-LEVEL Grad Credit","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.860J","total-units":"12.0"},{"subarea":"For Doctoral Program in History, Anthropology, and Science, Technology and Society","has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"21A.998, 21A.999 - Advanced Topics in Anthropology","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"21A.998, 21A.999","area":"Advanced Topics","level":"Grad","url":"http://student.mit.edu/catalog/m21Aa.html#21A.998, 21A.999","total-units":"Unknown"}]}