{"items":[{"has-final":true,"semester":["Fall","Spring"],"description":"Gives students a broad overview of Western music from the Middle Ages to the 20th century, with emphasis on late baroque, classical, romantic, and modernist styles. Enhances the musical experience by developing listening skills and an understanding of diverse forms and genres. Major composers and works placed in social and cultural contexts. Weekly lectures feature demonstrations by professional performers, and introduce topics to be discussed in sections. Enrollment may be limited.","label":"Introduction to Western Music","type":"Class","course":"21M","units":"4-0-8","in-charge":["Ruckert, G.","Neff, T."],"joint":false,"offering":"Currently Offered","id":"21M.011","category":["HASS-D 3","HASS Communication-Intensive"],"area":"Introductory Subjects","listing-index":"m21Ma-000","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.011","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explores the relationship between music and the supernatural, focusing on the social history and context of supernatural beliefs as reflected in key literary and musical works from 1600 to the present.  Provides a better understanding of the place of ambiguity and the role of interpretation in culture, science and art.  Explores great works of art by Shakespeare, Verdi, Goethe (in translation), Gounod, Henry James and Benjamin Britten. Readings will also include selections from the most recent scholarship on magic and the supernatural. Writing assignments will range from web-based projects to analytic essays. No previous experience in music is necessary.  Projected guest lectures, musical performances, field trips.","label":"The Supernatural in Music, Literature and Culture","type":"Class","course":"21M","units":"3-0-9","in-charge":["Harris, E.","Howe, J.","Shadle, C."],"joint":true,"offering":"Currently Offered","id":"21M.013","category":["HASS-D 3","HASS Communication-Intensive"],"area":"Introductory Subjects","listing-index":"m21Ma-001","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.013J","total-units":"12.0"},{"has-final":true,"semester":["Fall","Spring"],"description":"Historical survey from roots in African and American contexts, including spirituals, blues, and ragtime, through early jazz, Swing, bebop, and post-bop movements, with attention to recent developments. Key jazz styles, the relation of music and society, and major figures such as Armstrong, Ellington, Basie, Goodman, Parker, Monk, Mingus, Coltrane, and others are considered. Some investigation of cross-influences with popular, classical, folk, and rock musics. Enrollment may be limited.","label":"Jazz","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harvey, M.","joint":false,"offering":"Currently Offered","id":"21M.026","category":"HASS-D 3","area":"Introductory Subjects","listing-index":"m21Ma-002","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.026","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"An introduction to diverse musical traditions of the world. Music from a wide range of geographical areas is studied in terms of structure, performance practice, social use, aesthetics, and cross-cultural contact. Includes hands-on music making, live demonstrations by guest artists, and ethnographic research projects.","label":"Introduction to World Music","type":"Class","course":"21M","units":"3-0-9","in-charge":["Tang, P.","Ruckert, G."],"joint":false,"offering":"Currently Offered","id":"21M.030","category":["HASS-D 3","HASS Communication-Intensive"],"area":"Introductory Subjects","listing-index":"m21Ma-003","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.030","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Introduces students to the rudiments of Western music through oral, aural, and written practice utilizing rhythm, melody, intervals, scales, chords, and musical notation. Individual skills are addressed through a variety of approaches, including keyboard practice in the required piano labs. Students who have already taken 21M.301 or 21M.302 may not enroll in 21M.051.","label":"Fundamentals of Music","type":"Class","course":"21M","units":"3-3-6","in-charge":"Wood, P.","joint":false,"offering":"Currently Offered","id":"21M.051","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Ma-004","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.051","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Through a progressive series of composition projects, students investigate the sonic organization of musical works and performances, focusing on fundamental questions of unity and variety. Aesthetic issues are considered in the pragmatic context of the instructions that composers provide to achieve a desired musical result, whether these instructions are notated in prose, as graphic images, or in symbolic notation. No formal training is required. Weekly listening, reading, and composition assignments draw on a broad range of musical styles and intellectual traditions, from various cultures and historical periods.","label":"Introduction to Musical Composition","type":"Class","course":"21M","units":"3-0-9","in-charge":"Makan, K.","joint":false,"offering":"Currently Offered","id":"21M.065","category":"HASS-D 3","area":"Introductory Subjects","listing-index":"m21Ma-005","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.065","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"A survey of music in the United States from the colonial period to the present in the context of American cultural history, with an emphasis on Boston\'s musical life whenever feasible.  Listening and writing assignments concern classical, popular, folk, musical theater, and jazz repertories.","label":"American Music","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harvey, M.","joint":false,"offering":"Not offered this year","id":"21M.215","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-006","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.215","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Studies key genres and styles of vocal and instrumental music that developed across Europe in churches, courts, and public venues prior to the age of \"common practice\" harmony. After a survey of the medieval background, focuses on works by great Renaissance and early baroque composers, including Dunstable, Dufay, Ockeghem, Josquin, Willaert, Palestrina, Lasso, Victoria, Byrd, Gibbons, Monteverdi, Gabrieli, Praetorius, and Schutz. Student assignments explore selected repertoires in depth, such as chant, madrigals, motets, species counterpoint models, Lutheran chorales, the first operas, or early styles of keyboard, wind, or string music. Minimal score-reading ability needed for papers, oral presentations, and possible performance projects.","label":"Early Music","type":"Class","course":"21M","units":"3-0-9","in-charge":"Cuthbert, M.","joint":false,"offering":"Currently Offered","id":"21M.220","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-007","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.220","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines  the production, transmission, preservation and the qualities of folk music in the British Isles and North America from the 18th century to the folk revival of the 1960s and the present. Special emphasis on balladry, fiddle styles, and African-American influences.","label":"Folk Music of the British Isles and North America","type":"Class","course":"21M","units":"3-1-8","in-charge":["Ruckert, G.","Perry, R."],"joint":true,"offering":"Currently Offered","id":"21M.223","category":["HASS-D 3","HASS Communication-Intensive"],"area":"History/Literature","listing-index":"m21Ma-008","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.223J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Listening assignments sample all genres composed by the three great masters and by four of their contemporaries.  Reading assignments concern the structural, textural and performance aspects of music and trace contemporary intellectual, artistic and social changes. Written essays and oral presentations are based on assigned listening and reading. Requires some knowledge of score-reading and attendance at two or three performances. Enrollment limited.","label":"Vivaldi, Bach, and Handel","type":"Class","course":"21M","units":"3-0-9","in-charge":"Lindgren, L.","joint":false,"offering":"Currently Offered","id":"21M.230","category":["HASS Elective","HASS Communication-Intensive"],"area":"History/Literature","listing-index":"m21Ma-009","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.230","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Listening assignments sample all genres composed by the three great masters and by a few of their contemporaries.  Reading assignments regard structural, textural and performance aspects of music and its placement within cultural contexts. Written essays and oral presentations concern the assigned repertoire. Requires some knowledge of score-reading and attendance at two or three performances. Enrollment limited.","label":"Haydn, Mozart, and Beethoven","type":"Class","course":"21M","units":"3-0-9","in-charge":"Lindgren, L.","joint":false,"offering":"Currently Offered","id":"21M.240","category":["HASS Elective","HASS Communication-Intensive"],"area":"History/Literature","listing-index":"m21Ma-010","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.240","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"A survey of developments in Western musical style, 1815-1915. Works by 35 composers, including the romantics: Schubert, Chopin, and Schumann; the post-romantics: Wagner, Verdi, and Brahms; the turn-of-the-centurians: Mahler, Debussy, and Ravel; and the Americans: Gottschalk, Beach, and Joplin. Score-reading ability is beneficial.","label":"Schubert to Debussy","type":"Class","course":"21M","units":"3-0-9","in-charge":"Shadle, C.","joint":false,"offering":"Currently Offered","id":"21M.250","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-011","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.250","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"A history of song from the time of Shakespeare to the present, examining ways in which individual composers of different periods and nationalities have responded to great poetry. Songs examined are chosen from a variety of composers, such as Schubert, Debussy, and Stravinsky, and studied in close connection with their texts, which include poetry by Shakespeare, Milton, Goethe, and Verlaine. Performing experience is welcomed but not required. Required reading, listening, and writing assignments. Ability to read music required. Enrollment limited.","label":"Song","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harris, E.","joint":false,"offering":"Not offered this year","id":"21M.252","category":["HASS Elective","HASS Communication-Intensive"],"area":"History/Literature","listing-index":"m21Ma-012","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.252","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"A survey of major works from Europe and America, spanning the first six decades of the 20th century. Divided into three periods: 1900 to World War I; WWI to WWII; and 1945 to the early 1960s. Roughly 15 works represent each period. The following composers receive greatest attention: Schoenberg, Berg, Webern, Ravel, Stravinsky, Prokofiev, Shostakovich, Ives, Britten, Messiaen, Stockhausen, and Carter.","label":"Modern Music: 1900-1960","type":"Class","course":"21M","units":"3-0-9","in-charge":"Cuthbert, M.","joint":false,"offering":"Currently Offered","id":"21M.262","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-013","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.262","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Begins with the premise that the 1960s mark a great dividing point in the history of 20th century Western musical culture, and explores the ways in which various social and artistic concerns of composers, performers, and listeners have evolved since that decade. Focuses on works by classical composers from around the world. Topics include the impact of rock, as it developed during the 1960s--70s; the concurrent emergence of post serial, neotonal, minimalist, and new age styles; the globalization of Western musical traditions; the impact of new technologies; and the significance of music video, video games, and other versions of multimedia. Interweaves discussion of these topics with close study of seminal musical works, evenly distributed across the four decades since 1960. Works by MIT composers included.","label":"Music Since 1960","type":"Class","course":"21M","units":"3-0-9","in-charge":"Cuthbert, M.","joint":false,"offering":"Currently Offered","id":"21M.263","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-014","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.263","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Listening assignments include 34 symphonies and 24 concertos, composed from the 1720s to the 1990s. Class discussion and oral presentations focus on the works in 18 miniature scores. Each of the three written papers reviews a concert attended during the term.","label":"Symphony and Concerto","type":"Class","course":"21M","units":"3-0-9","in-charge":"Lindgren, L.","joint":false,"offering":"Currently Offered","id":"21M.271","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-015","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.271","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Focus on the text, music and staging of excerpts from nearly 50 works, including 15 by Mozart, Wagner and Verdi. Live performances are the basis for four written papers. Works composed during the last 125 years are the basis for two oral presentations. Enrollment limited.","label":"Opera","type":"Class","course":"21M","units":"3-0-9","in-charge":"Lindgren, L.","joint":false,"offering":"Currently Offered","id":"21M.273","category":["HASS Elective","HASS Communication-Intensive"],"area":"History/Literature","listing-index":"m21Ma-016","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.273","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Required reading and listening assignments.","label":"Shakespeare at the Opera","type":"Class","course":"21M","units":"3-0-9","in-charge":["Harris, E.","Ouellette, M."],"joint":false,"offering":"Not offered this year","id":"21M.274","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-017","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.274","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Covers Broadway works and  Hollywood films in depth. Proceeds chronologically, exploring three stage musicals and three films at a time, within four historical categories: breakthrough musicals of the 1920s and \'30s;  classic \"book musicals\" of the \'40s and \'50s; modernist and concept musicals of the \'60s and \'70s; and post modern and cutting-edge works of the \'80s and \'90s. Attention given to the role of music in relation to script, characterization, and dramatic structure. Final papers involve comparison of one stage and one film work, selected in consultation with the instructor. Oral presentations required and in-class performances encouraged.","label":"Musicals of Stage and Screen","type":"Class","course":"21M","units":"3-0-9","in-charge":"Marks, M.","joint":false,"offering":["Not offered next year","Currently Offered"],"id":"21M.283","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-018","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.283","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Surveys the styles and dramatic functions of music in sound films from the 1930s to the present. Predominant attention given to landmark scores by American and European composers, including Korngold, Steiner, Rozsa, Raksin, Prokofiev, Copland, Herrmann, Rota, Morricone, Williams, and Elfman. Subsidiary topics include new trends in contemporary film-scoring; pop scores; the impact of electronics, and specialized genres (e.g., westerns, musicals, documentaries, animated films). Viewing, listening, and reading assignments. Some background in the study of film and/or music is expected.","label":"Film Music","type":"Class","course":"21M","units":"3-3-6","in-charge":"Marks, M.","joint":false,"offering":"Currently Offered","id":"21M.284","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-019","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.284","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Focuses on Hindustani classical music of North India, and also involves learning about the ancient foundations of the rich classical traditions of music and dance of all Indian art and culture. Practice of the ragas and talas through the learning of songs, dance, and drumming compositions. Develops insights through listening, readings, and concert attendance.","label":"Music of India","type":"Class","course":"21M","units":"3-0-9","in-charge":"Ruckert, G.","joint":false,"offering":"Currently Offered","id":"21M.291","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-020","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.291","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides an introduction to the fascinating, intricate music of Indonesia. The Indonesian archipelago is home to a wide variety of cultures and musical traditions, many of them largely unknown in the West. From the Gamelan percussion orchestras of Bali and Java to the indigenous folk traditions of Sumatra and Borneo, and Western-influenced pop and street traditions.","label":"Music of Indonesia","type":"Class","course":"21M","units":"2-2-8","in-charge":"Tang, P.","joint":false,"offering":"Currently Offered","id":"21M.292","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-021","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.292","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Focuses on musical traditions of West Africa. A variety of musical practices and their cultural contexts are explored through listening, reading and writing assignments with an emphasis on class discussion. Subject includes in-class instruction in Senegalese drumming, song and dance, as well as live lecture-demonstrations by guest performers from throughout West Africa.","label":"Music of Africa","type":"Class","course":"21M","units":"3-0-9","in-charge":"Tang, P.","joint":false,"offering":"Currently Offered","id":"21M.293","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-022","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.293","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Focuses on popular music created for and transmitted by mass media. Various popular music genres from around the world are studied through listening and reading assignments, while considering issues of musical change, syncretism, Westernization, globalization, the impact of recording industries, and the post-colonial era.  Case studies include bhangra, Afro-pop, reggae, and global hip-hop","label":"Popular Musics of the World","type":"Class","course":"21M","units":"3-0-9","in-charge":"Tang, P.","joint":false,"offering":"Currently Offered","id":"21M.294","category":"HASS Elective","area":"History/Literature","listing-index":"m21Ma-023","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.294","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Basic writing skills in music of the common-practice period (Bach to Brahms). Work includes regular written assignments leading to the composition of short pieces, analyzing representative works from the literature, keyboard laboratory, and sight-singing choir. It is recommended that entering students have some concert music listening or playing background. Enrollment may be limited.","label":"Harmony and Counterpoint I","type":"Class","course":"21M","units":"3-3-6","in-charge":["Shadle, C.","Harvey, M.","Hughes, C.","Cleveland, S."],"joint":false,"offering":"Currently Offered","id":"21M.301","category":"HASS-D 3","area":"Theory/Composition","listing-index":"m21Ma-024","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.301","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"A continuation of 21M.301, including chromatic harmony and modulation, a more extensive composition project, keyboard laboratory, and musicianship laboratory.","label":"Harmony and Counterpoint II","type":"Class","course":"21M","units":"3-2-7","in-charge":["Shadle, C.","Hughes, C.","Cleveland, S.","Saraydarian, G."],"joint":false,"offering":"Currently Offered","id":"21M.302","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-025","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.302","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Written and analytic exercises based on 18th- and 19th-century small forms and harmonic practice found in music such as the chorale preludes of Bach; minuets and trios of Haydn, Mozart, and Beethoven; and the songs and character pieces of Schubert and Schumann. Musicianship laboratory is required.","label":"Writing in Tonal Forms I","type":"Class","course":"21M","units":"3-1-8","in-charge":["Child, P.","Cleveland, S.","Saraydarian, G."],"joint":false,"offering":"Currently Offered","id":"21M.303","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-026","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.303","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Further written and analytic exercises in tonal music, focusing on larger or more challenging forms. For example, students might compose a sonata-form movement for piano or a two-part invention in the style of Bach. Students have opportunities to write short works that experiment with the expanded tonal techniques of the late 19th and early 20th centuries. Musicianship laboratory is required.","label":"Writing in Tonal Forms II","type":"Class","course":"21M","units":"3-1-8","in-charge":["Shadle, C.","Cleveland, S.","Saraydarian, G."],"joint":false,"offering":"Currently Offered","id":"21M.304","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-027","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.304","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Basic harmony and theory of mainstream jazz and blues; includes required listening in jazz, writing and analysis work, and two full-scale arrangements. Serves as preparation for more advanced work in jazz with application to rock and pop music. Performance of student arrangements.","label":"Jazz Harmony and Arranging","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harvey, M.","joint":false,"offering":"Currently Offered","id":"21M.340","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-028","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.340","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Jazz writing using tonal, modal, and extended compositional approaches as applied to the blues, the 32-bar song form, and post-bop structural designs. Consideration given to a variety of styles and to the ways improvisation informs the compositional process. Study of works by Ellington, Mingus, Parker, Russell, Evans, Nelson, Golson, Coleman, Coltrane, Threadgill, Hemphill, and others. Performance of student compositions.","label":"Jazz Composition","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harvey, M.","joint":false,"offering":"Currently Offered","id":"21M.341","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-029","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.341","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An introduction to the analysis of tonal music. Students develop analytical techniques based upon concepts learned in 21M.301-21M.302. Students study rhythm and form, harmony, line and motivic relationships at local and large scale levels of musical structure. Three papers (totaling 20 pages, one to be revised) and one oral presentation required.","label":"Musical Analysis","type":"Class","course":"21M","units":"3-0-9","in-charge":"Child, P.","joint":false,"offering":"Currently Offered","id":"21M.350","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-030","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.350","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Directed composition of larger forms of original writing involving voices and/or instruments. Includes a weekly seminar in composition for the presentation and discussion of work in progress. Students are expected to produce at least one substantive work, performed in public, by the end of the term. Contemporary compositions and major works from 20th-century music literature are studied.","label":"Music Composition","type":"Class","course":"21M","units":"3-0-9","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.351","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-031","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.351","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"A series of composition projects using various types of recording equipment, editing software, audio hardware, and programming environments. Class culminates in a public concert presenting student work. Instruction in recording, editing, synthesis, sampling, digital sound processing, sequencing, and interactive systems. Close  listening to computer and electronic music from composers and sound  artists including Cage, Eno, Ikeda, Kraftwerk, Lansky, Radiohead, Stockhausen, Varese and Xenakis. Focus on using the computer as a means of musical creativity and intuition. Enrollment limited to 12, with priority given to Music majors, minors, concentrators, and those with previous compositional experience.","label":"Composing with Computers","type":"Class","course":"21M","units":"2-2-8","in-charge":"Whincop, P.","joint":false,"offering":"Currently Offered","id":"21M.361","category":"HASS Elective","area":"Theory/Composition","listing-index":"m21Ma-032","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.361","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Rehearsals and performance of primarily large-scale works for chorus, soloists, and orchestra- from the Passions and Masses of J. S. Bach to oratorios of our own time. Open to graduate and undergraduate students by audition.","label":"MIT Concert Choir","type":"Class","course":"21M","units":"0-4-2","in-charge":"Cutter, W.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.401","area":"Performance","listing-index":"m21Ma-033","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.401","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Rehearsal and performance of choral repertoire for small chorus, involving literature from the Renaissance to contemporary periods. Membership limited to 32 students by audition.","label":"MIT Chamber Chorus","type":"Class","course":"21M","units":"3-0-3","in-charge":"Cutter, W.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.405","area":"Performance","listing-index":"m21Ma-034","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.405","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"For the singer and/or pianist interested in collaborative study of solo vocal performance. Historical study of the repertoire includes listening assignments of representative French, German, Italian, and English works as sung by noted vocal artists of the genre. Topics include diction as facilitated by the study of the International Phonetic Alphabet; performance and audition techniques; and study of body awareness and alignment through the Alexander Technique and yoga. Admission by audition. Required for all Emerson Music Vocal Scholars.","label":"Vocal Repertoire and Performance","type":"Class","course":"21M","units":"3-0-3","in-charge":"Wood, P.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.410","area":"Performance","listing-index":"m21Ma-035","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.410","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Rehearsals prepare works for concerts and recordings. Analyses of musical style, structure, and performance practice are integrated into rehearsals as a means of enriching musical conception and the approach to performance. Likewise, additional scores of particular structural or stylistic interest are read whenever time permits. Admission by audition.","label":"MIT Symphony","type":"Class","course":"21M","units":"0-4-2","in-charge":"Boyles, A.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.421","area":"Performance","listing-index":"m21Ma-036","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.421","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Music for string chamber orchestra drawn from traditional mainstream pieces of the Baroque, Romantic, and 20th-century with at least one world premiere per year. Admission by audition. One on-campus performance each term.","label":"MIT String Chamber Orchestra","type":"Class","course":"21M","units":"0-2-1","in-charge":"Staff","joint":false,"offering":["Not offered this year","Can be repeated for credit"],"id":"21M.422","area":"Performance","listing-index":"m21Ma-037","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.422","total-units":"3.0"},{"has-final":false,"semester":"Spring","description":"Introduces orchestral conducting as a discipline combining advanced ear training, musical analysis, practical musicianship, and score-reading skills. Focuses on mainstream repertoire, with emphasis on music performed by the MIT Symphony and String Chamber Orchestras. Rehearsal attendance required. Opportunities to lead sectional rehearsals depending upon level of ability. Audition required.","label":"Conducting and Score-Reading","type":"Class","course":"21M","units":"3-4-5","in-charge":"A.Boyles","joint":false,"offering":"Currently Offered","id":"21M.423","category":"HASS Elective","area":"Performance","listing-index":"m21Ma-038","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.423","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Open by audition to advanced instrumentalists who are committed to the analysis, performance, and recording of woodwind, brass, and percussion literature from the Renaissance through the 21st century. The repertoire consists primarily of music for small and large wind ensembles. May include ensemble music from Gabrieli to Grainger, Schuller, Mozart, Dvorak, and various mixed media including strings. Performance of newly commissioned works. Opportunities for solo work.","label":"MIT Wind Ensemble","type":"Class","course":"21M","units":"0-4-2","in-charge":"Harris, F.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.426","area":"Performance","listing-index":"m21Ma-039","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.426","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Open by audition to instrumentalists dedicated to the analysis and performance of traditional and contemporary jazz ensemble compositions. Instrumentation includes saxophones, trumpets, trombones, piano, guitar or vibraphone, bass, percussion and occasionally french horn, double reeds, and strings. Experience in improvisation preferred but not required. Opportunities to work with professional jazz artists and perform commissioned works by recognized jazz composers.","label":"MIT Festival Jazz Ensemble","type":"Class","course":"21M","units":"0-4-2","in-charge":"Harris, F.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.442","area":"Performance","listing-index":"m21Ma-040","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.442","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Study of chamber music literature through analysis, rehearsal, and performance. Weekly seminars and coaching. Open to string, piano, brass, woodwind players, and singers. By audition.","label":"Chamber Music Society","type":"Class","course":"21M","units":"0-4-2","in-charge":["Thompson, M.","Deveau, D.","Rife, J.","Harris, F."],"joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.445","area":"Performance","listing-index":"m21Ma-041","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.445","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"A performing ensemble dedicated to the traditional music of Bali and  East Java. Members of the ensemble rehearse and study techniques on  MIT\'s three distinctive sets of gamelan instruments and perform in  conjunction with Gamelan Galak Tika. No previous experience necessary, but prior enrollment in 21M.030 or 21M.292 is strongly recommended. Enrollment limited to 25 students by audition.","label":"MIT Balinese Gamelan","type":"Class","course":"21M","units":"0-3-3","in-charge":"Ziporyn, E.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.450","area":"Performance","listing-index":"m21Ma-042","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.450","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Open by audition to pianists who wish to explore and develop their talents as accompanists.  Pianists are paired with a music scholarship recipient and attend that student\'s private lesson each week.  Accompanists prepare independently, rehearse with the student partner, and provide accompaniment at a juried recital or masterclass each term.  Under supervision for music faculty and private lesson instructors, pianists may work with one or two scholarship students each term at 3 units each or one student in 21M.480/21M.512 for 6 units.  Subject satisfies the performance requirement for pianists receiving music scholarships.","label":"Studio Accompanying for Pianists","type":"Class","course":"21M","units":"Unknown","in-charge":"Deveau, D.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.451","area":"Performance","listing-index":"m21Ma-043","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.451","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"A performance ensemble focusing on the sabar drumming tradition of Senegal, West Africa. Study and rehearse Senegalese drumming techniques and spoken word. Perform in conjunction with MIT Rambax drumming group. No previous experience necessary, but prior enrollment in 21M.030 or 21M.293 strongly recommended. Enrollment limited to 20 students by audition.","label":"MIT Senegalese Drum Ensemble","type":"Class","course":"21M","units":"0-3-3","in-charge":"Toure, L.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.460","area":"Performance","listing-index":"m21Ma-044","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.460","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Open by audition to students who demonstrate considerable technical and musical skills and who wish to develop them through intensive private study. Students must take a weekly lesson, attend a regular performance seminar, and participate in a departmental performing group. Full-year commitment required. Information about lesson fees, scholarships, and auditions available in Music Section Office. Meets with graduate subject 21M.512, but assignments differ.","label":"Advanced Music Performance","type":"Class","course":"21M","units":"1-2-3","in-charge":["Thompson, M.","Deveau, D."],"joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.480","area":"Performance","listing-index":"m21Ma-045","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.480","total-units":"6.0"},{"has-final":false,"semester":"Fall","description":"Develop analytic and research skills in music. Focus upon a small number of important works, which are studied in depth. Strong emphasis upon student presentations and discussion, and a substantial writing project.","label":"Senior Seminar in Music","type":"Class","course":"21M","units":"3-0-9","in-charge":"Child, P.","joint":false,"offering":"Currently Offered","id":"21M.500","category":"HASS Elective","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-046","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.500","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Directed composition of larger forms of original writing involving voices and/or instruments. Includes a weekly seminar in composition for the presentation and discussion of work in progress. Students are expected to produce at least one substantive work, performed in public, by the end of the term. Contemporary compositions and major works from 20th-century music literature are studied.","label":"Advanced Music Composition","type":"Class","course":"21M","units":"3-0-9","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.505","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-047","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.505","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Open by audition to students who demonstrate considerable technical and musical skills and who wish to develop them through intensive private study. Students must take a weekly lesson, attend a regular performance seminar, and participate in a departmental performing group. Full-year commitment required. Information about lesson fees, scholarships, and auditions available in Music Section Office. Meets with graduate subject 21M.512, but assignments differ.","label":"Advanced Music Performance","type":"Class","course":"21M","units":"1-2-3","in-charge":["Thompson, M.","Deveau, D."],"joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.512","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-048","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.512","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"For the singer and/or pianist interested in collaborative study of solo vocal performance. Historical study of the repertoire includes listening assignments of representative French, German, Italian, and English works as sung by noted vocal artists of the genre. Topics include diction as facilitated by the study of the International Phonetic Alphabet; performance and audition techniques; and study of body awareness and alignment through the Alexander Technique and yoga. Admission by audition. Required for all Emerson Music Vocal Scholars.","label":"Vocal Repertoire and Performance","type":"Class","course":"21M","units":"3-0-3","in-charge":"Wood, P.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.515","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-049","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.515","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Special Topics in Music","type":"Class","course":"21M","units":"Unknown","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.531, 21M.533, 21M.536,  21M.538","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-050","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.531, 21M.533, 21M.536,  21M.538","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Fall: Consult","label":"Advanced Topics in Music","type":"Class","course":"21M","units":"Unknown","in-charge":"Byron, D.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.539","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-051","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.539","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Opportunity for study of musical topics not covered in the regular curriculum, particularly experimental subjects offered by permanent and visiting faculty.","label":"Selected Topics in Music","type":"Class","course":"21M","units":"Unknown","in-charge":"Whincop, P.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.540","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-052","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.540","total-units":"Unknown"},{"has-final":false,"semester":"IAP","description":"No description available.","label":"IAP Music Topics","type":"Class","course":"21M","units":"Unknown","joint":false,"offering":"Currently Offered","id":"21M.542","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-053","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.542","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Summer","Fall","Spring","Summer"],"description":"No description available.","label":"Research in Music","type":"Class","course":"21M","units":"Unknown","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.545, 21M.546","area":"Special Topics/Advanced Subjects","listing-index":"m21Ma-054","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.545, 21M.546","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Use of current tools and techniques for creating audio soundtracks that can be synthesized by computer in real time. Techniques of compact definition and efficient, global dissemination, such as via the Web. Development and use of global standards for audio and music rendering on remote sites. Participants are expected to create an original work, performed in at least three remote sites to positive commentary, using the above principles.","label":"Writing for Computer Performance","type":"Class","course":"21M","units":"3-0-6","in-charge":"Vercoe, B.","joint":true,"offering":"Currently Offered","id":"21M.565","category":"H-LEVEL Grad Credit","area":"Music and Media","listing-index":"m21Ma-055","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.565J","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Principles of information processing by the human auditory system, from detection of frequency, intensity, and spectrum, to the development of their perceptual correlates as pitch, loudness, and timbre. Machine models of the human auditory and musical experience using perceptually based sensor and interpretor constructs, sufficient to enable machines to experience sound and music in a manner related to our own. Exploring auditory and music cognition with the aid of real-time audio processors. Modeling musical common sense. Lectures same as MAS.241, with additional readings and a group or individual project.","label":"Audio Processing by People and Machines","type":"Class","course":"21M","units":"3-0-6","in-charge":"Vercoe, B.","joint":true,"offering":"Currently Offered","id":"21M.566","category":"H-LEVEL Grad Credit","area":"Music and Media","listing-index":"m21Ma-056","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.566J","total-units":"9.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Directed composition of larger forms of original writing using computer-processed sound, to be performed either alone or with voices and/or instruments. Includes a weekly seminar in composition for the examination of major works from 20th-century music literature and for the presentation and discussion of student works in progress. Students expected to produce at least one substantive work to be performed in public by the end of the term. Open to qualified undergraduates.","label":"Computer Music Composition","type":"Class","course":"21M","units":"3-6-3","in-charge":"Vercoe, B.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.570","category":"H-LEVEL Grad Credit","area":"Music and Media","listing-index":"m21Ma-057","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.570","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"In-depth exploration of contemporary concepts in music and media. Studies recent music that uses advanced technology, and the artistic motivations and concerns implied by the new media. Practical experience with computer music technology, including MIDI and post-MIDI systems. Special emphasis on the interactive systems for professionals as well as amateurs. Midterm paper and term project required.","label":"Musical Aesthetics and Media Technology","type":"Class","course":"21M","units":"3-3-3","in-charge":"Machover, T.","joint":true,"offering":"Currently Offered","id":"21M.580","category":"H-LEVEL Grad Credit","area":"Music and Media","listing-index":"m21Ma-058","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.580J","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Current computer music concepts and practice. Project-based work on research or production projects using the Media Lab\'s computer music, interactive, and media resources. Requires significant studio work and a term project. Projects based on class interests and skills, and may be individually or group-based. May be repeated for credit with permission of instructor.","label":"Projects in Media and Music","type":"Class","course":"21M","units":"3-3-6","in-charge":"Machover, T.","joint":true,"offering":["Not offered this year","Can be repeated for credit"],"id":"21M.581","category":"H-LEVEL Grad Credit","area":"Music and Media","listing-index":"m21Ma-059","level":"Grad","url":"http://student.mit.edu/catalog/m21Ma.html#21M.581J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Explores the actor\'s tools: body, voice, mind, imagination, and the essential self. Through studio exercises, students address issues of honesty and creativity in the theatrical moment, and begin to have a sense of their strengths and limitations as communicating theatrical artists. Provides an opportunity for students to discover their relationship to \"the other\" in the acting partner, the group, the environment, and the audience.","label":"Introduction to Acting","type":"Class","course":"21M","units":"4-0-5","in-charge":["Brody, A.","Mancuso, K."],"joint":false,"offering":"Currently Offered","id":"21M.600","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-000","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.600","total-units":"9.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Introduces the craft of writing for the theater. Through weekly assignments, in class writing exercises, and work on a sustained piece, students explore scene structure, action, events, voice, and dialogue. Examine produced playscripts and  discuss student work. Emphasis on process, risk-taking, and finding one\'s own voice and vision.","label":"Playwriting I","type":"Class","course":"21M","units":"3-0-9","in-charge":"Harrington, L.","joint":true,"offering":"Currently Offered","id":"21M.604","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-001","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.604J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Concentrates upon freeing the natural voice, culminating in the actor\'s ability to work in any style. The progression of Linklater\'s approach to voice is taught, as time allows. Although the focus is acting, students not primarily interested in theater but interested in developing their voices may find this class useful.","label":"Voice and Speech for the Actor","type":"Class","course":"21M","units":"4-0-5","in-charge":"Eastley, K.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.605","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-002","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.605","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Introduces students to the variety and scope of stagecraft while they learn basic shop skills. Students develop shop vocabulary and learn safe use of all shop machines, basic handwork skills, names and uses of tools, and an overview of the various activities that go on in each shop. In each production area, students complete a project that uses all basic skills. Students build a final project of choice that relates to the skills that stagecraft covers.","label":"Introduction to Stagecraft","type":"Class","course":"21M","units":"3-3-3","in-charge":"Staff, Rinaldi","joint":false,"offering":"Currently Offered","id":"21M.606","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-003","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.606","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Introduces the ideas, skills, and aesthetic issues which comprise the creation of the theatrical event. Guest artists and faculty members introduce the work of different disciplines such as directing, stagecraft, design, acting, dramaturgy, and criticism. Readings, in-class exercises, and scheduled work in design and/or performance studios help students understand and experience the basic creative impulse in each area. Each student develops a portfolio of analysis and research.","label":"Foundations of Theater Practice","type":"Class","course":"21M","units":"3-3-6","in-charge":"Scheib, J.","joint":false,"offering":"Not offered this year","id":"21M.611","category":"HASS-D 3","area":"Introductory Subjects","listing-index":"m21Mb-004","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.611","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Explores the creation (and creativity) of the modern scientific and cultural world through study of western Europe in the 17th century, the age of Descartes and Newton, Shakespeare, Rembrandt and Moliere. Compares period thinking to present-day debates about the scientific method, art, religion, and society. This team-taught, interdisciplinary subject draws on a wide range of literary, dramatic, historical, and  scientific texts and images, and involves theatrical experimentation as well as reading, writing, researching and conversing. Meets most of the time with 21L.016, but differs from it by analyzing theatrical texts.","label":"Learning from the Past:  Performance, Drama, Science","type":"Class","course":"21M","units":"3-0-9","in-charge":"Sonenberg, J.","joint":false,"offering":"Currently Offered","id":"21M.616","category":["HASS-D 3","HASS Communication-Intensive"],"area":"Introductory Subjects","listing-index":"m21Mb-005","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.616","total-units":"12.0"},{"joint":true,"has-final":false,"semester":"Spring","area":"Introductory Subjects","description":"Explores contemporary American theatrical expression around issues of gender, ethnic, and cultural identities. Analyzes performances, scripts, video documentation,and invention of original documents of theatrical expression, and construction of gender within particular formations of American culture. Class lectures and discussions analyze samples of Native American, Chicano, African American, and Asian American theater, considering the historical and political context for the creation of these works. Performance exercises help identify theatrical forms used by these theaters and consider how these techniques contribute to the overall goals of specific theatrical expressions.","category":"HASS-D 3","units":"3-0-9","id":"21M.621","offering":"Currently Offered","label":"Theater and Cultural Diversity in the US","total-units":"12.0","url":"http://student.mit.edu/catalog/m21Mb.html#21M.621J","in-charge":"DeFrantz, T.","type":"Class","prereq":"SP.595J","course":"21M","listing-index":"m21Mb-006","level":"Undergrad"},{"has-final":false,"semester":"Fall","description":"Examines the theatrical event from the perspective of composition in a performance workshop. Studio exercises address the process of developing a theatrical work through an internalized understanding of compositional principles in theater. Examines uses of time, space, and action. Complemented by outside readings, videos, short essays, and in-class discussions, subject provides performer, director, choreographer, designer or writer opportunities to engage with large and small group ensembles in creation of theatrical events. Topics include image, movement, shape, repetition, gesture, and spatial relationship.","label":"Composition for Stage and Performance","type":"Class","course":"21M","units":"4-2-3","in-charge":"Scheib, J.","joint":false,"offering":"Currently Offered","id":"21M.645","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-007","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.645","total-units":"9.0"},{"joint":true,"has-final":false,"semester":"Spring","area":"Introductory Subjects","description":"Explores forms, content, and contexts of world traditions in dance that played a crucial role in shaping American concert dance with attention to issues of gender and autobiography. Explores artistic lives of dance artists Katherine Dunham, Alvin Ailey, Isadora Duncan, Martha Graham, and George Balanchine as American dance innovators. Lectures and discussions analyze these artists\' works, taking into consideration historical and political contexts. Viewing assignments and attendance of Boston-area dance performances help students identify visual, musical, and kinesthetic underpinnings of choreographic structure.","category":["HASS-D 3","HASS Communication-Intensive"],"units":"3-0-9","id":"21M.670","offering":"Currently Offered","label":"Traditions in American Concert Dance: Gender and Autobiography","total-units":"12.0","url":"http://student.mit.edu/catalog/m21Mb.html#21M.670J","in-charge":"Blanco, M.","type":"Class","prereq":"SP.591J","course":"21M","listing-index":"m21Mb-008","level":"Undergrad"},{"has-final":false,"semester":"Spring","description":"Explores aesthetic and technical underpinnings of contemporary dance composition. Basic compositional techniques discussed and practiced with an emphasis on principles such as weight, space, time, effort, and shape. Principles of musicality considered and developed by each student. Working together, students create short compositions to help them understand the range of possibilities available when working with the medium of the human body. Selected viewing and reading exercises augment classroom work. Class attends at least two professional dance events in the Boston area.","label":"Dance Theory and Composition","type":"Class","course":"21M","units":"4-0-5","in-charge":"Andrien, R.","joint":false,"offering":"Currently Offered","id":"21M.675","category":"HASS Elective","area":"Introductory Subjects","listing-index":"m21Mb-009","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.675","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Introduces students to the art and technique of musical theater performance. Movement, singing, and acting are explored during the term, with a focus on the use of the body as an expressive tool. Students develop an understanding of how musicals are composed and the nature of the actor\'s contribution to this dynamic form.","label":"Musical Theater Workshop","type":"Class","course":"21M","units":"4-0-5","in-charge":"DeFrantz, T.","joint":false,"offering":"Currently Offered","id":"21M.704","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-010","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.704","total-units":"9.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Gives students who have begun the process of bringing themselves to a dramatic moment the opportunity to apply their skills to scripted material. Studio work in this class further develops the completeness, spontaneity, and honesty of expression of the actor\'s body, imagination, and voice; and introduces written material and the problems of synthesizing the self, the moment, and the scripted word. Weekly rehearsals with a scene partner.","label":"The Actor and the Text","type":"Class","course":"21M","units":"4-0-5","in-charge":"Ouellette, M.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.705","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-011","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.705","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Explores the process of creating theatrical events through group work and collective creation methodologies. Study of the collective creation techniques of internationally renowned theater groups. Students create original performance works born of their own ideas, concerns, feelings, and motivations.","label":"Theater and Collective Creation","type":"Class","course":"21M","units":"4-0-5","in-charge":"Staff","joint":false,"offering":["Not offered this year","Can be repeated for credit"],"id":"21M.707","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-012","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.707","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Focuses on reading a script theatrically with a view to mounting a coherent production. Through careful, intensive reading of a variety of plays from different periods and different aesthetics, a pattern emerges for discerning what options exist for interpretating a script. Students discuss the consequences of those options for production. Enrollment limited.","label":"Script Analysis","type":"Class","course":"21M","units":"3-0-9","in-charge":"Ouellette, M.","joint":false,"offering":"Currently Offered","id":"21M.710","category":["HASS Elective","HASS Communication-Intensive"],"area":"Intermediate Subjects","listing-index":"m21Mb-013","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.710","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Pursues detailed study of a particular playtext or theme and is related to some planned production activity during the following IAP. Seminar activities may include guest speakers from various disciplines who approach some aspect of the playtext or theme from the perspective of their fields; various theatrical practitioners; and critical and scholarly presentations by seminar members. Participation in the IAP production is not required.","label":"Production Seminar","type":"Class","course":"21M","units":"3-0-6","in-charge":"Staff","joint":false,"offering":"Not offered this year","id":"21M.711","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-014","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.711","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Surveys black modes of performance. Investigates the musicality, movement styles, and structures of oratory central to African-American life. Explores storytelling, tall tales and snapping, the blues aesthetic and soul, minstrelsy and social dance through the prism of plays written by African-American writers. Examines the participatory, communal essence of black performance and how that performance functions as cultural inspiration, as political weaponry, as art, as religion, and as an entertaining social safety valve. Required readings, written essays, and midterm writing project in addition to creation of short performance pieces.","label":"African-American Performance","type":"Class","course":"21M","units":"4-0-8","in-charge":"DeFrantz, T.","joint":false,"offering":"Currently Offered","id":"21M.712","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-015","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.712","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Focuses on specific non-European or North American theater, its practice, and theory. A term\'s work may center on the theater of a particular culture such as Asia, Africa, Latin America, or particular theater forms such as feminist, Afro-American, Latino, and gay and lesbian.","label":"Selected Studies in Theater","type":"Class","course":"21M","units":"3-0-9","in-charge":"Brody, A.","joint":false,"offering":"Currently Offered","id":"21M.713","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-016","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.713","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Fall: Consult Theater Arts office","label":"Selected Topics in Theater Arts","type":"Class","course":"21M","units":"Unknown","in-charge":"Bell, J.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.714","area":"Intermediate Subjects","listing-index":"m21Mb-017","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.714","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"Provides opportunity for study of theater design or technical topics not covered by the regular subject listings.  Experimental subjects, advanced design exploration, advanced craft techniques such as structural design for the stage, or specialty costume designs like chainmail or hat construction.","label":"Topics in Technical Theater Design Exploration","type":"Class","course":"21M","units":"Unknown","in-charge":"Levenson, E.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.715","area":"Intermediate Subjects","listing-index":"m21Mb-018","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.715","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Provides an intermediate workshop designed for students who have a basic understanding of the principles of theatrical design and who want a more intensive study of costume design and the psychology of clothing. Students develop designs that emerge through a process of character analysis, based on the script and directorial concept.  Period research, design, and rendering skills are fostered through practical exercises. Instruction in basic costume construction, including drafting and draping, provide tools for students to produce final projects.","label":"Costume Design for the Theater","type":"Class","course":"21M","units":"3-3-6","in-charge":"Cocuzzo-Held, L.","joint":false,"offering":"Not offered this year","id":"21M.732","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-019","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.732","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines theory of scenic design as currently practiced and alternate traditions in other cultures and eras. Four play scripts and one opera or dance theater piece are designed after being analyzed in depth, exploring their internal workings and relationship to the social, political, artistic, and cultural milieu of their era of creation, and to the current audience. Encourages students to work in a variety of two- and three- dimensional media in developing their ideas.","label":"Design for the Theater: Scenery","type":"Class","course":"21M","units":"3-3-6","in-charge":"Staff","joint":false,"offering":"Not offered this year","id":"21M.733","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-020","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.733","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explores artistry of lighting design.  Students gain overall technical working knowledge of tools and apply it to final design. Stresses artistic, conceptual, and collaborative side of the craft utilizing a \"hands on\" format.  Students take advantage of greater Boston venues with backstage tours of various  theaters to see how architecture affects lighting design choices.  Small projects assigned during term. Final project involves execution of fully realized production, frequently for the Dance Theater Ensemble\'s winter concert.","label":"Lighting Design for the Theater","type":"Class","course":"21M","units":"3-3-3","in-charge":"Perlow, K.","joint":false,"offering":["Not offered next year","Currently Offered"],"id":"21M.734","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-021","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.734","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Looks at special structural and artistic challenges of theatrical scenery, effects, and construction needs. Explores the technical design process and emphasizes safety, budgeting, and problem solving. Work includes actual production assignments and paper design projects. Final project required to explore each student\'s specific interests.","label":"Technical Design: Scenery, Mechanisms, and Special Effects","type":"Class","course":"21M","units":"3-3-6","in-charge":"Katz, M.","joint":false,"offering":["Not offered next year","Currently Offered"],"id":"21M.735","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-022","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.735","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explores the political and aesthetic foundations of hip-hop. Students trace the musical, corporeal, visual, spoken word, and literary manifestations of hip-hop over its 30 year presence in the American cultural imagery. Students also investigate specific black cultural practices that have given rise to its various idioms. Students create material culture related to each thematic section of the course. Scheduled work in performance studio helps students understand how hip-hop is created and assessed.","label":"Hip-Hop","type":"Class","course":"21M","units":"3-3-6","in-charge":"DeFrantz, T.","joint":false,"offering":"Currently Offered","id":"21M.775","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-023","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.775","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Continues work in the development of play scripts for the theater. Writers work on sustained pieces in weekly workshop meetings, individual consultation with the instructor, and in collaboration with student actors, directors, and designers. Fully developed scripts eligible for inclusion in the Playwrights\' Workshop production.","label":"Playwrights\' Workshop","type":"Class","course":"21M","units":"3-2-7","in-charge":"Brody, A.","joint":true,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.785","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-024","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.785J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Continues work in the development of play scripts for the theater. Writers work on sustained pieces in weekly workshop meetings, individual consultation with the instructor, and in collaboration with student actors, directors, and designers. Fully developed scripts eligible for inclusion in the Playwrights\' Workshop production.","label":"Playwrights\' Workshop","type":"Class","course":"21M","units":"3-2-7","in-charge":"Brody, A.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.789","area":"Intermediate Subjects","listing-index":"m21Mb-025","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.789","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explores several models of directing, each with its unique structures, philosophy, terminology, and techniques. Exploration is intended to lead to the development of an individual voice for each student and clarity in his/her directorial point of view. Class sessions concentrate on how a point of view is arrived at through analysis of material and the way the results are rendered with the basic tools of theater. All points of view are honored as long as they can be actively supported by the work.","label":"The Director\'s Craft","type":"Class","course":"21M","units":"4-0-5","in-charge":"Sonenberg, J.","joint":false,"offering":"Currently Offered","id":"21M.790","category":"HASS Elective","area":"Intermediate Subjects","listing-index":"m21Mb-026","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.790","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Explores several models of directing, each with its unique structures, philosophy, terminology, and techniques. Exploration is intended to lead to the development of an individual voice for each student and clarity in his/her directorial point of view. Class sessions concentrate on how a point of view is arrived at through analysis of material and the way the results are rendered with the basic tools of theater. All points of view are honored as long as they can be actively supported by the work.","label":"The Director\'s Craft","type":"Class","course":"21M","units":"4-0-5","in-charge":"Sonenberg, J.","joint":false,"offering":"Currently Offered","id":"21M.791","area":"Intermediate Subjects","listing-index":"m21Mb-027","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.791","total-units":"9.0"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Provides directed practice in acting or directing on a sustained theater piece, either one-act or full length, from pre-rehearsal preparation to workshop production. Consult Theater Arts Office.","label":"Theater Practicum","type":"Class","course":"21M","units":"Unknown","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.805","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-028","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.805","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Provides opportunity to study theater design and technical production subjects including technical theater practica or experimental subjects offered by the permanent or visiting faculty.","label":"Technical Theater Special Topics","type":"Class","course":"21M","units":"Unknown","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.820","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-029","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.820","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Refines the student actor\'s use of the language of the stage with work on text and physical presentation. Explores issues of style, including the understanding and honoring, in performance, of the specific requirements of texts from several different historical periods of the Western theatrical tradition. Periods may differ from term to term.","label":"Acting: Techniques and Style","type":"Class","course":"21M","units":"4-0-8","in-charge":"Ouellette, M.","joint":false,"offering":["Not offered next year","Can be repeated for credit","Currently Offered"],"id":"21M.830","category":"HASS Elective","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-030","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.830","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Refines the student actor\'s use of the language of the stage with work on text and physical presentation. Explores issues of style, including the understanding and honoring, in performance, of the specific requirements of texts from several different historical periods of the Western theatrical tradition. Periods may differ from term to term.","label":"Acting: Techniques and Style","type":"Class","course":"21M","units":"4-0-8","in-charge":"Ouellette, M.","joint":false,"offering":["Not offered next year","Can be repeated for credit","Currently Offered"],"id":"21M.835","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-031","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.835","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Integrates media and communication technologies in performing arts. Studio exercises provide a forum for experimentation. Contemporary and historical techniques for media integration examined through readings, viewing videos and short written essays. Technologies examined include digital imaging, composite and live feed digital video, and web-based performance. Engages the designer, director, choreographer, performer, visual artist or programmer in the practice of integrating media into live art events. Equipment, where necessary, is provided.","label":"Performance Media","type":"Class","course":"21M","units":"4-2-6","in-charge":"Scheib, J.","joint":false,"offering":"Currently Offered","id":"21M.840","category":"HASS Elective","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-032","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.840","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Meets with 21M.840 but assignments differ. Graduate students are expected to complete additional assignments. See description under 21M.840.","label":"Performance Media","type":"Class","course":"21M","units":"4-2-6","in-charge":"Scheib, J.","joint":false,"offering":"Currently Offered","id":"21M.841","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-033","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.841","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Multidisciplinary lecture/workshop engages students in a variety of approaches to the study and practice of performance as an area of aesthetic and social interaction. Special attention paid to the use of diverse media in performance. Interdisciplinary approaches to study encourage students to seek out material histories of performance and  practice. New topics are discussed each year.","label":"Topics in Performance Studies","type":"Class","course":"21M","units":"3-2-7","in-charge":"DeFrantz, T.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.846","category":"HASS Elective","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-034","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.846","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"See description under 21M.846.  Assignments differ.","label":"Topics in Performance Studies","type":"Class","course":"21M","units":"3-2-7","in-charge":"DeFrantz, T.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.847","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-035","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.847","total-units":"12.0"},{"has-final":false,"semester":["Fall","IAP","Spring","Fall","IAP","Spring"],"description":"","label":"Special Topics in Drama","type":"Class","course":"21M","units":"Unknown","in-charge":"TR1-2.30","joint":false,"offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"21M.851","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-036","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.851","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"No description available.","label":"Advanced Topics in Theater Arts","type":"Class","course":"21M","units":"Unknown","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.863","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-037","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.863","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Theater Studies","type":"Class","course":"21M","units":"Unknown","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.864","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-038","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.864","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"Fall: Consult Theater Arts office","label":"Research in Theater","type":"Class","course":"21M","units":"Unknown","in-charge":"Bell, J.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.865","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-039","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.865","total-units":"Unknown"},{"has-final":false,"semester":"IAP","description":"Provides opportunity for the study of theater arts topics not covered by regular subject listings, including experimental subjects offered by permanent and visiting faculty. Students seeking an individual program of study with a faculty member must also obtain the approval of the director of Theater Arts. Consult Theater Arts office for departmental form.","label":"IAP Theater Arts Topics","type":"Class","course":"21M","units":"Unknown","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.873","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-040","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.873","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Meets with 21M.880 but assignments differ.","label":"Dance Production","type":"Class","course":"21M","units":"0-4-2","in-charge":"Staff","joint":false,"offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"21M.880","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-041","level":"Grad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.880","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Definition of and early-stage work on thesis project leading to 21M.ThU Undergraduate Thesis in Music.  Taken during the first term of the student\'s two-term commitment to the thesis project.  Student works closely with an individual faculty tutor.","label":"Music Pre-Thesis Tutorial","type":"Class","course":"21M","units":"1-0-5","in-charge":"Lindgren, Consult L.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.ThT","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-042","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.ThT","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Completion of work on senior major thesis under supervision of a faculty tutor.  Includes oral presentation of thesis progress early in the term, assembling and revising final text, and meeting at the close with a committee of faculty evaluators to discuss successes and limitations of the project.","label":"Undergraduate Thesis in Music","type":"Class","course":"21M","units":"Unknown","in-charge":"Lindgren, Consult L.","joint":false,"offering":["Can be repeated for credit","Currently Offered"],"id":"21M.ThU","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-043","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.ThU","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Individual participation in an ongoing music research project.  For students in the Undergraduate Research Opportunities Progam.","label":"Research in Music","type":"Class","course":"21M","units":"Unknown","in-charge":"Lindgren, Consult L.","joint":false,"offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"21M.UR","area":"Special Advanced Topics and Practica","listing-index":"m21Mb-044","level":"Undergrad","url":"http://student.mit.edu/catalog/m21Mb.html#21M.UR","total-units":"Unknown"}]}