{"items":[{"has-final":true,"semester":["Fall","Spring","Spring","Spring"],"description":"Application of the fundamental principles toward an understanding of microorganisms as geochemical agents responsible for the evolution and renewal of the biosphere and of their role in human health and disease. Spring Term: 7.015.  Emphasis on computational and genomic approaches to biology including analysis of genome structure, definition of regulatory networks, and relevance to biomedical issues and evolution.","label":"Introductory Biology","type":"Class","course":"7","units":"5-0-7","in-charge":["Jacks, 7.013: T.","Sive, H."],"offering":["Not offered this year","Not offered this year"],"id":"7.012","category":["Biology","Biology","Biology","Biology"],"area":"Undergraduate Subjects","listing-index":"m7a-000","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.012","total-units":"12.0"},{"has-final":true,"semester":["Fall","Spring"],"description":"Application of experimental techniques in microbiology, biochemistry, and cell and developmental biology. Emphasizes integrating factual knowledge with understanding the design of experiments and data analysis to prepare students for research projects. Development of skills critical for writing about scientific findings in modern biology. Instruction and practice in written communication provided. Twelve units may be applied to the General Institute Laboratory Requirement. Enrollment limited.","prereq":["10.702","7.012","7.013","7.014","7.015"],"label":"Introduction to Experimental Biology and Communication","type":"Class","course":"7","units":"4-8-6","in-charge":["Kim, D.","Schwartz, T."],"offering":"Currently Offered","id":"7.02","category":"Institute LAB","area":"Undergraduate Subjects","listing-index":"m7a-001","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.02","total-units":"18.0"},{"has-final":false,"semester":"Fall","description":"The principles of genetics with application to the study of biological function at the level of molecules, cells, and multicellular organisms, including humans. Structure and function of genes, chromosomes, and genomes. Biological variation resulting from recombination, mutation, and selection. Population genetics. Use of genetic methods to analyze protein function, gene regulation, and inherited disease.","prereq":["7.012","7.013","7.014","7.015"],"label":"Genetics","type":"Class","course":"7","units":"4-0-8","in-charge":["Kaiser, C.","Fink, G.","Reddien, P."],"offering":"Currently Offered","id":"7.03","category":"Restricted Electives in Science and Technology","area":"Undergraduate Subjects","listing-index":"m7a-002","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.03","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Contributions of biochemistry toward an understanding of the structure and functioning of organisms, tissues, and cells. Chemistry and functions of constituents of cells and tissues and the chemical and physical-chemical basis for the structures of nucleic acids, proteins, and carbohydrates. General metabolism of carbohydrates, fats, and nitrogen-containing materials such as amino acids, proteins, and related compounds.","prereq":["5.12","7.012","7.013","7.014","7.015","5.07"],"label":"General Biochemistry","type":"Class","course":"7","units":"5-0-7","in-charge":["Yaffe, M.","Bartel, D.","Brown, G. M."],"offering":"Currently Offered","id":"7.05","category":"Restricted Electives in Science and Technology","area":"Undergraduate Subjects","listing-index":"m7a-003","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.05","total-units":"12.0"},{"has-final":true,"semester":["Fall","Spring"],"description":"Biology of cells of higher organisms: structure, function, and biosynthesis of cellular membranes and organelles; cell growth and oncogenic transformation; transport, receptors, and cell signaling; the cytoskeleton, the extracellular matrix, and cell movements; chromatin structure and RNA synthesis.","prereq":"7.03","label":"Cell Biology","type":"Class","course":"7","units":"4-0-8","in-charge":["Orr-Weaver, T.","Ploegh, H."],"offering":"Currently Offered","coreq":"7.05","id":"7.06","area":"Undergraduate Subjects","listing-index":"m7a-004","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.06","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"More advanced treatment of biochemical mechanisms that underlie biological processes.  Topics include macromolecular machines such as the ribosome, the proteosome, fatty acid synthases as a paradigm for polyketide synthases and non-ribosomal polypeptide synthases, metal cluster assembly and oxidative stress. Emphasis is on experimental methods used to unravel these processes and how these processes fit into the cellular context and coordinate regulation.","prereq":["5.08J","7.80","5.12","5.07","7.05"],"label":"Biological Chemistry II","type":"Class","course":"7","units":"4-0-8","in-charge":["Ting, A. Y.","Stubbe, J."],"offering":"Currently Offered","id":"7.08J","area":"Undergraduate Subjects","listing-index":"m7a-005","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.08J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Biology Teaching","type":"Class","course":"7","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"7.11","area":"Undergraduate Subjects","listing-index":"m7a-006","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.11","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Molecular genetics used to examine how bacteria can be used in novel and relevant processes, for example, to synthesize precursors to the drug Crixivan, a potent inhibitor of HIV replication, to synthesize metabolites as food supplements, or to synthesize biodegradable polymers. Students engage in independent research projects to address questions relating to these processess. Techniques used include plasmid manipulation, genetic complementation, mutagenesis, PCR, DNA sequencing, enzyme assays, and gene expression studies. Instruction and practice in written and oral communication are also emphasized.","prereq":["7.02","7.03","7.05"],"label":"Experimental Microbial Genetics","type":"Class","course":"7","units":"4-16-10","in-charge":"Sinskey, A. J.","offering":"Currently Offered","id":"7.13","area":"Undergraduate Subjects","listing-index":"m7a-007","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.13","total-units":"30.0"},{"has-final":false,"semester":"Spring","description":"RNA interference (RNAi) as a core technique to study gene regulatory pathways in eukaryotic cells. Projects focus on dissecting the pathways controlling apoptosis (programmed cell death) and/or other regulatory pathways, such as those controlling the cell cycle or alternative splicing, in Drosophila S2 cells. Some projects involve the use of DNA-damaging agents or other cytotoxic chemicals or drugs to help understand the pathways that control a cell\'s decision to undergo apoptosis. Instruction and practice in written and oral communication provided.","prereq":["7.02","7.03","7.05"],"label":"Experimental Molecular Biology: Biotechnology II","type":"Class","course":"7","units":"4-16-10","in-charge":"Staff","offering":"Not offered this year","id":"7.16","area":"Undergraduate Subjects","listing-index":"m7a-008","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.16","total-units":"30.0"},{"has-final":false,"semester":"Spring","description":"Cell and molecular biology lab that uses recombinant DNA methods and optical microscopy to study cellular mechanisms in eukaryotic cells. Projects focus on mechanisms of intracellular protein translocation and cytoskeletal rearrangement. Students explore the recombinant fluorescent proteins using imaging techniques and describe the effects of the expressed protein on cell motility, the cell cycle, or the organization and function of cytoplasmic organelles and the cyoskeleton. Projects involve many techniques, such as DNA sequence analysis, RNAi, RT-PCR, and Western blotting. Instruction and practice in written and oral communication provided.","prereq":["7.02","7.03","7.05"],"label":"Experimental Molecular Biology: Biotechnology III","type":"Class","course":"7","units":"4-16-10","in-charge":["Gertler, F.","Pardue, M. L."],"offering":"Currently Offered","id":"7.17","area":"Undergraduate Subjects","listing-index":"m7a-009","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.17","total-units":"30.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Independent experimental study under the direction of a member of the Biology Department faculty. Allows students with a strong interest in independent research to fulfill the project laboratory requirement for the Biology Department Program in the context of a research laboratory at MIT. The research should be a continuation of a previous project. Written and oral presentation of the research results is required. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the faculty research supervisor and the Biology Education Office must be obtained in advance.","prereq":["7.19","7.02","7.03","7.05","7.19"],"label":"Topics in Experimental Biology","type":"Class","course":"7","units":"4-16-10","in-charge":["Chen, J.","Sinskey, A. J."],"offering":"Currently Offered","id":"7.18","area":"Undergraduate Subjects","listing-index":"m7a-010","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.18","total-units":"30.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Students carry out independent literature research. Meets with the seminar and writing tutorial portions of 7.18. Journal club discussions are used to help students evaluate and write scientific papers. Instruction and practice in written and oral communication is provided. Permission of the instructor and the Biology Education Office must be obtained in advance.","prereq":["7.18","7.02","7.03","7.05","7.18"],"label":"Communication in Experimental Biology","type":"Class","course":"7","units":"4-4-4","in-charge":["Chen, J.","Sinskey, A. J."],"offering":"Currently Offered","id":"7.19","area":"Undergraduate Subjects","listing-index":"m7a-011","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.19","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Comprehensive subject in human physiology, emphasizing the molecular basis and applied aspects of organ function and regulation in health and disease. Includes a review of cell structure and function, as well as the mechanisms by which the endocrine and nervous systems integrate cellular metabolism. Special emphasis on examining the cardiovascular, pulmonary, gastrointestinal, and renal systems.","prereq":"7.05","label":"Human Physiology","type":"Class","course":"7","units":"5-0-7","in-charge":["Krieger, M.","Sabatini, D."],"offering":"Not offered this year","id":"7.20J","area":"Undergraduate Subjects","listing-index":"m7a-012","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.20J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Biochemical properties of bacteria and other microorganisms that enable them to grow under a variety of conditions. Interaction between bacteria and bacteriophages. Genetic and metabolic regulation of enzyme action and enzyme formation. Structure and function of components of the bacterial cell envelope. Protein secretion with a special emphasis on its various roles in pathogenesis. Additional topics include symbiosis, quorum sensing, global responses to DNA damage, and biofilms.  Students taking the graduate version are expected to explore the subject in greater depth.","prereq":["7.62","7.03","7.05"],"label":"Microbial Physiology","type":"Class","course":"7","units":"4-0-8","in-charge":["Walker, G. C.","Magasanik, B."],"offering":"Currently Offered","id":"7.21","area":"Undergraduate Subjects","listing-index":"m7a-013","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.21","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Covers animal development and evolution.  Topics include origins of multicellularity, the germline, formation of early body plans, cell type determination, organogenesis, morphogenesis, stem cells, cloning, evolution of developmental diversity and processes, developmental genetics, and issues in human development.  Experimental approaches to problems of development and evolution, including the study of vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models, will be covered.","prereq":["7.03","7.06"],"label":"Development and Evolution","type":"Class","course":"7","units":"5-0-7","in-charge":["Constantine-Paton, M.","Reddien, P."],"offering":"Currently Offered","id":"7.22","area":"Undergraduate Subjects","listing-index":"m7a-014","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.22","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"A comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) genes and structure; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention is paid to the development and function of the immune system as a whole as studied by modern methods and techniques.","prereq":["7.63","7.03","7.05","7.06"],"label":"General Immunology","type":"Class","course":"7","units":"5-0-7","in-charge":["Chen, J.","Ploegh, H.","Steiner, L."],"offering":"Currently Offered","id":"7.23","area":"Undergraduate Subjects","listing-index":"m7a-015","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.23","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"; folding intermediates aggregation and competing off-pathway reactions; role of chaperonins, isomerases, and other helper proteins; protein recovery problems in the biotechnology industry; diseases associated with protein folding defects.","prereq":["5.48J","7.88J","10.543J","7.05","5.07"],"label":"The Protein Folding Problem","type":"Class","course":"7","units":"4-2-6","in-charge":"King, J. A.","offering":"Currently Offered","id":"7.24","area":"Undergraduate Subjects","listing-index":"m7a-016","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.24","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Cells utilize a variety of mechanisms to regulate gene expression, growth, development, and behavior in response to both external and internal conditions. Examines basic principles of biological regulation, focusing on several well-studied examples, usually drawn from microbial species. Reading includes primary literature and review articles with emphasis on how we know what we know, and how to think experimentally. Enrollment limited to 40.","prereq":["7.02","7.03","7.05"],"label":"Biological Regulatory Mechanisms","type":"Class","course":"7","units":"4-0-8","in-charge":["Magasanik, B.","RajBhandary, U."],"offering":"Currently Offered","id":"7.25","area":"Undergraduate Subjects","listing-index":"m7a-017","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.25","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Covers current understanding of and modern approaches to human disease, emphasizing the molecular and cellular basis of both genetic disease and cancer. Topics include the genetics of simple and complex traits; karyotypic analysis and positional cloning; genetic diagnosis; the roles of oncogenes and tumor suppressors in tumor initiation, progression, and treatment; the interaction between genetics and environment; animal models of human disease; cancer; and conventional and gene therapy treatment strategies.","prereq":["7.03","7.05","7.06"],"label":"Principles of Human Disease","type":"Class","course":"7","units":"4-0-8","in-charge":["Housman, D.","Guarente, L."],"offering":"Currently Offered","id":"7.27","area":"Undergraduate Subjects","listing-index":"m7a-018","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.27","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics include gene regulation, DNA replication, genetic recombination, and mRNA translation. Logic of experimental design and data analysis emphasized. Presentations include both lectures and group discussions of representative papers from the literature.  Students taking the graduate version are expected to explore the subject in greater depth.","prereq":["7.58","7.03"],"label":"Molecular Biology","type":"Class","course":"7","units":"5-0-7","in-charge":["Baker, T.","Bell, S."],"offering":"Currently Offered","coreq":"7.05","id":"7.28","area":"Undergraduate Subjects","listing-index":"m7a-019","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.28","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Introduction to the structure and function of the nervous system. Emphasizes the cellular properties of neurons and other excitable cells. Includes the structure and biophysical properties of excitable cells, synaptic transmission, neurochemistry, neurodevelopment, integration of information in simple systems, and detection and information coding during sensory transduction.","prereq":["9.09J","7.05"],"label":"Cellular Neurobiology","type":"Class","course":"7","units":"4-0-8","in-charge":["Quinn, W. G.","Littleton, J. T."],"offering":"Currently Offered","id":"7.29J","area":"Undergraduate Subjects","listing-index":"m7a-020","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.29J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Fundamentals of ecology, considering Earth as an integrated dynamic system. Coevolution of the biosphere, geosphere, atmosphere and oceans. Introduction to thermodynamics.  The Earth\'s energy budget. Photosynthesis and respiration.  The hydrologic, carbon and nitrogen cycles. Flow of energy and materials through ecosystems, regulation of the distribution and abundance of organisms, structure and function of ecosystems. Evolution and natural selection; metabolic diversity; productivity. Trophic dynamics; models of population growth, competition, mutualism and predation. 7.012-7.015 recommended.","prereq":"1.018J","label":"Ecology I: The Earth System","type":"Class","course":"7","units":"3-1-8","in-charge":["Chisholm, S. W.","Delong, E."],"offering":"Currently Offered","id":"7.30J","category":"Restricted Electives in Science and Technology","area":"Undergraduate Subjects","listing-index":"m7a-021","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.30J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Covers recent advances in mammalian cell and developmental biology with particular emphasis on approaches that utilize mouse genetics. Combines formal lectures on selected topics with readings of original papers which are discussed in class. Major emphasis on the implications of mechanisms of human genetic diseases. Topics include early mammalian development; genomic imprinting; X inactivation; embryonic stem cells; mammalian cloning by nuclear transplantation; cell migration; nervous system development; and central nervous system degenerative diseases such as Alzheimer\'s and Huntington\'s disease. Enrollment limited to 20.","prereq":["7.05","7.06"],"label":"Current Topics in Mammalian Biology: Medical Implications","type":"Class","course":"7","units":"4-0-8","in-charge":["Gertler, F.","Jaenisch, R."],"offering":"Currently Offered","id":"7.31","area":"Undergraduate Subjects","listing-index":"m7a-022","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.31","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Seminars covering topics of current interest in biology with a focus on how to understand experimental methods and design and how to critically read the primary research literature. Small class size facilitates discussions and interactions with an active research scientist. Students visit research laboratories to see first-hand how biological research is done. Contact Biology Education Office for topics.","prereq":["7.03","7.05","7.06","7.28"],"label":"Advanced Undergraduate Seminars","type":"Class","course":"7","units":"2-0-4 [P/D/F]","in-charge":["Horvitz, H. R.","Staff"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.340?7.349","area":"Undergraduate Subjects","listing-index":"m7a-023","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.340?7.349","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Topics include major metabolic pathways for the biosynthesis of certain cellular constituents and oxidative metabolism. Emphasizes enzymology and methods used to understand metabolism and enzymatic processes.","prereq":["5.77J","7.75J","7.05","5.07"],"label":"Topics in Metabolic Biochemistry","type":"Class","course":"7","units":"4-0-8","in-charge":"Brown, G. M.","offering":"Currently Offered","id":"7.35","area":"Undergraduate Subjects","listing-index":"m7a-024","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.35","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Introduction to computational biology emphasizing the fundamentals of nucleic acid and protein sequence and structural analysis, as well as the analysis of complex biological systems. Principles and methods used for sequence alignment, motif finding, expression array analysis, structural modeling, structure prediction and network modeling. Techniques include dynamic programming, Markov models, clustering techniques, dead-end elimination and energy minimization approaches. Exposure to currently emerging research areas. Designed for advanced undergraduates and graduate students with strong backgrounds in either molecular biology or computer science. Some foundational material covering basic programming skills, probability and statistics is provided for students with non-quantitative backgrounds. Enrollment limited to 90.","prereq":["7.91J","20.390","20.490J","7.05","5.07","7.01x","1.00","1.001","6.00","6.001"],"label":"Foundations of Computational and Systems Biology","type":"Class","course":"7","units":"3-0-9","in-charge":["Burge, C.","Keating, A."],"offering":"Currently Offered","id":"7.36","area":"Undergraduate Subjects","listing-index":"m7a-025","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.36","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"cultivation; site-specific mutation of proteins; protein pharmacology and delivery.","prereq":["10.441J","20.361J","20.110J","2.772J","2.005","3.012","5.60","7.06"],"label":"Molecular and Engineering Aspects of Biotechnology","type":"Class","course":"7","units":"4-0-8","in-charge":["Lodish, H.","Griffith, L. G."],"offering":"Not offered this year","id":"7.37J","area":"Undergraduate Subjects","listing-index":"m7a-026","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.37J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Program of study or research to be arranged with a Department faculty member. Written report required. Consult Biology Education Office.","label":"Selected Topics in Biology for Undergraduates","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"7.39","area":"Undergraduate Subjects","listing-index":"m7a-027","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.39","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Topics of current or special interest.","label":"Special Topics in Biology for Undergraduates","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"7.391","area":"Undergraduate Subjects","listing-index":"m7a-028","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.391","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Fundamentals of genetics and biochemical principles for the synthesis, design, engineering, and application of biopolymers such as polyesters and polysaccharides. Principles underlying structure-function properties of biopolymers. Topics include conformation, image, and nanostructure analysis; behavior of polymers in solution; structure, topography, and functional performance of biopolymers; and biopolymer complexes and assemblies.","prereq":"7.05","label":"Biotechnology: Engineering of Macromolecules","type":"Class","course":"7","units":"3-0-6","in-charge":["Rha, C. K.","Sinskey, A. J."],"offering":"Not offered this year","id":"7.40","area":"Undergraduate Subjects","listing-index":"m7a-029","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.40","total-units":"9.0"},{"has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Undergraduate research opportunities in the Department of Biology. For further information, consult departmental coordinator, Gene Brown. Permission of department required.","label":"Undergraduate Research","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"7.UR","area":"Undergraduate Subjects","listing-index":"m7a-030","level":"Undergrad","url":"http://student.mit.edu/catalog/m7a.html#7.UR","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Applied statistics covers probability and distributions (normal binomial, poisson, exponential, lognormal, and uniform), estimation and hypothesis testing, parametric and nonparametric one-sample and two-sample tests of means, analysis of variance for crossed and nested designs, linear and multiple regression with residual analysis, correlation and discrete data analysis using chi-squared tests. Discussion of experimental and sampling designs are included. Examples use data from biological studies.","label":"Applied Statistics","type":"Class","course":"7","units":"3-0-9 [P/D/F]","in-charge":"(WHOI), V. Starczak","offering":["Not offered this year","Can be repeated for credit"],"id":"7.410","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-031","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.410","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Seminars in Biological Oceanography","type":"Class","course":"7","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"7.411?7.419","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-032","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.411?7.419","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Special Problems in Biological Oceanography","type":"Class","course":"7","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"7.421","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-033","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.421","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on quantitative marine ecology.  Topics vary from year to year.","label":"Topics in Quantitative Marine Science","type":"Class","course":"7","units":"2-0-4","in-charge":["Solow, A.","(WHOI), M. Neubert"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.430","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-034","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.430","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on ecological principles and processes in marine populations, communities, and ecosystems. Topics vary from year to year.","label":"Topics in Marine Ecology","type":"Class","course":"7","units":"2-0-4","in-charge":["Caswell, H.","(WHOI), R. Harbison"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.431","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-035","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.431","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on physiological and biochemical processes in marine organisms. Topics vary from year to year.","label":"Topics in Marine Physiology and Biochemistry","type":"Class","course":"7","units":"2-0-4","in-charge":["Hahn, M.","McDowell, J.","(WHOI), J. Stegeman"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.432","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-036","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.432","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on biological oceanography.  Topics vary from year to year.","label":"Topics in Biological Oceanography","type":"Class","course":"7","units":"2-0-4","in-charge":"(WHOI), R. Gast","offering":["Can be repeated for credit","Currently Offered"],"id":"7.433","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-037","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.433","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on the biology of marine zooplankton. Topics vary from year to year.","label":"Topics in Zooplankton Biology","type":"Class","course":"7","units":"2-0-4","in-charge":["Madin, L.","(WHOI), R. Harbison"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.434","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-038","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.434","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussions on the biology of marine benthos. Topics vary from year to year.","label":"Topics in Benthic Biology","type":"Class","course":"7","units":"2-0-4","in-charge":["Mullineaux, L.","Scheltema, R.","(WHOI), T. Shank"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.435","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-039","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.435","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussion on the biology of marine phytoplankton. Topics vary from year to year.","label":"Topics in Phytoplankton Biology","type":"Class","course":"7","units":"2-0-4","in-charge":["Olson, R.","Sosik, H.","Anderson, D.","(WHOI), S. Dyhrman"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.436","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-040","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.436","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussion on molecular biological oceanography. Topics vary from year to year.","label":"Topics in Molecular Biological Oceanography","type":"Class","course":"7","units":"2-0-4","in-charge":["Hahn, M.","Shank, T.","Gast, R.","Anderson, D.","(WHOI), S. Sievert"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.437","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-041","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.437","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussion on the behavioral biology of marine animals. Topics vary from year to year.","label":"Topics in the Behavior of Marine Animals","type":"Class","course":"7","units":"2-0-4","in-charge":["Tyack, P.","(WHOI), M. Moore"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.438","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-042","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.438","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Lectures and discussion on the biology of marine prokaryotes. Topics vary from year to year.","label":"Topics in Marine Microbiology","type":"Class","course":"7","units":"2-0-4","in-charge":["Waterbury, J.","Sievert, S.","(WHOI), E. Webb"],"offering":["Can be repeated for credit","Currently Offered"],"id":"7.439","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-043","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.439","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Covers the basic models of population growth, demography, population interaction (competition, predation, mutualism), food webs, harvesting, and infectious disease, and the mathematical tools required for their analysis. Because these tools are also basic to the analysis of models in biochemistry, physiology, and behavior, subject also broadly relevant to students whose interests are not limited to ecological problems.","prereq":["18.01","1.018J"],"label":"An Introduction to Mathematical Ecology","type":"Class","course":"7","units":"3-0-6","in-charge":["Neubert, M.","(WHOI), H. Caswell"],"offering":["Not offered next year","Currently Offered"],"id":"7.440","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-044","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.440","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Intensive overview of biological oceanography. Major paradigms discussed, and dependence of biological processes in the ocean on physical and chemical aspects of the environment examined. Surveys the diversity of marine habitats, major groups of taxa inhabiting those habitats, and the general biology of the various taxa: the production and consumption of organic material in the ocean, as well as factors controlling those processes. Species diversity, structure of marine food webs, and the flow of energy within different marine habitats are detailed and contrasted.","label":"Biological Oceanography","type":"Class","course":"7","units":"3-0-9","in-charge":["Mullineaux, L.","Sosik, H.","Pineda, J.","Dyhrman, S.","(WHOI), E. Webb "],"offering":"Currently Offered","id":"7.47","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-045","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.47","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Directed research in biological oceanography not leading to graduate thesis and generally done before the qualifying examination. Possible areas include population dynamics, physiology, and cytology of marine microorganisms; physiology, nutrition, and productivity of phytoplankton; influence of organisms on the composition of seawater; systematics, physiology, and ecology of pelagic larvae, zooplankton, benthos, and mesopelagic fishes; physiology and migration of large fishes; diving physiology; and use of sound by marine mammals.","label":"Research in Biological Oceanography","type":"Class","course":"7","units":"Unknown","in-charge":"Staff, Woods Hole","offering":["Can be repeated for credit","Currently Offered"],"id":"7.491","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-046","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.491","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Logic and experimental design: an in-depth discussion and assessment of biochemical, physical, genetic, and cell biological methods employed in testing hypotheses. Limited to Course 7 graduate students.","label":"Method and Logic in Molecular Biology","type":"Class","course":"7","units":"4-0-8 [P/D/F]","in-charge":["Guarente, L.","Hemann, M.","Housman, D.","Hynes, R. O.","Lees, J.","Sabatini, D."],"offering":"Currently Offered","coreq":["7.51","7.52"],"id":"7.50","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-047","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.50","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Fundamental principles of biochemistry. Analysis of the structure and mechanism of catalytic and regulatory macromolecules.","label":"Principles of Biochemical Analysis","type":"Class","course":"7","units":"6-0-6","in-charge":["Baker, T.","Sauer, R. T.","Solomon, F."],"offering":"Currently Offered","id":"7.51","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-048","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.51","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Principles and approaches of genetic analysis, including Mendelian inheritance and prokaryotic genetics, developmental genetics, neurogenetics, human genetics, genomics, and epigenetics.  Recitations and problem sets supplement lectures.","label":"Genetics for Graduate Students","type":"Class","course":"7","units":"4-0-8","in-charge":["Horvitz, H. R.","Housman, D.","Amon, A."],"offering":"Currently Offered","id":"7.52","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-049","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.52","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Description and critical assessment of the major issues and stages of developing a pharmaceutical or biopharmaceutical. Drug discovery, preclinical development, clinical investigation, manufacturing and regulatory issues considered for small and large molecules. Economic and financial considerations of the drug development process. Multidisciplinary perspective from faculty in clinical; life; and management sciences; as well as industry guests.","prereq":["10.547J","15.136J"],"label":"Principles and Practice of Drug Development","type":"Class","course":"7","units":"3-0-6","in-charge":["Allen, T. J.","Cooney, C. L.","Finkelstein, S. N.","Rubin, R. H.","Sinskey, A. J."],"offering":"Currently Offered","id":"7.547J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-050","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.547J","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"An in-depth presentation of how engineering and biological approaches can be combined to solve problems in science and technology, emphasizing integration of biological information and methodologies with engineering analysis, synthesis, and design. Emphasis on molecular mechanisms underlying cellular processes, including signal transduction, gene expression networks, and functional responses. Enrollment restricted to Biological Engineering and Biology graduate students.","prereq":"20.400J","label":"Perspectives in Biological Engineering","type":"Class","course":"7","units":"4-0-8","in-charge":["White, F.","Fraenkel, E."],"offering":"Currently Offered","id":"7.548J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-051","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.548J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"The stages in drug discovery and development begin with target identification and end with the submission of preclinical and clinical data to the regulatory authorities. Following identification of a lead compound, there is optimization of structures for pharmaceutical properties, bioavailability, and safety. Subject relies on actual cases of drug development. A major goal is to analyze the cases and determine how the discovery and development process might be influenced by new and future technologies.","prereq":["15.137J","20.486J"],"label":"Case Studies and Strategies in Drug Discovery and Development","type":"Class","course":"7","units":"2-0-4","in-charge":["Tannenbaum, S. R.","Sinskey, A. J."],"offering":"Currently Offered","id":"7.549J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-052","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.549J","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Designed for graduate students interested in understanding biological processes at the cellular level. Intended to be useful to biologists working in a wide range of areas and to provide the foundation to approach the current literature. The goals are to discuss fundamental topics in cell and molecular biology; demonstrate how the major questions have been approached, technically and intellectually; analyze how one interprets the data produced by those approaches; and identify the questions that remain. Topics include macromolecular synthesis, assembly of cellular complexes and structures, control of cell division, and cell signaling. Familiarity with the basics of biochemistry and genetics is assumed.","label":"Foundations of Cell Biology","type":"Class","course":"7","units":"5-0-7","in-charge":["Bell, S.","Solomon, F."],"offering":"Currently Offered","id":"7.56","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-053","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.56","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Introduces the fundamental concepts and tools of quantitative approaches to molecular and cellular biology.  Covers a wide range of mathematical, computational, and statistical methods, although no previous expertise in these areas is required. Focuses on understanding quantitative approaches through the analysis of particular problems and examples drawn from classical genetics, molecular biology, cell biology, genomics, and systems biology.","label":"Quantitative Biology for Graduate Students","type":"Class","course":"7","units":"4-0-8","in-charge":["Laub, M.","Regev, A."],"offering":"Currently Offered","id":"7.57","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-054","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.57","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics covered in lecture and readings of relevant literature include: gene regulation, DNA replication, genetic recombination, and mRNA translation. Logic of experimental design and data analysis are emphasized. Presentations include both lectures and group discussions of representative papers from the literature. Graduate students are expected to explore the subject in greater depth.","prereq":["7.28","7.03","7.05"],"label":"Molecular Biology","type":"Class","course":"7","units":"5-0-7","in-charge":["Baker, T.","Bell, S."],"offering":"Currently Offered","id":"7.58","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-055","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.58","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Participatory seminar focuses on the knowledge and skills necessary for teaching science in higher education. Topics include: theories of adult learning; course development; promoting active learning, problem solving, and critical thinking in students; communicating with a diverse student body; using educational technology to further learning; lecturing; creating effective tests and assignments; and assessment and evaluation. Students research and present a relevant topic of particular interest. Subject is appropriate for both novices and those with teaching experience.","prereq":["5.95J","8.395J","18.094J"],"label":"Teaching College-Level Science","type":"Class","course":"7","units":"2-0-2 [P/D/F]","in-charge":"Breslow, L.","offering":"Currently Offered","id":"7.59J","area":"Graduate Subjects","listing-index":"m7a-056","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.59J","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Eukaryotic genome structure, function, and expression, processing of RNA, and regulation of the cell cycle.  Emphasis on the techniques and logic used to address important problems in nuclear cell biology. Lectures on broad topic areas in nuclear cell biology and discussions on representative recent papers.","prereq":"7.06","label":"Cell Biology: Structure and Functions of the Nucleus","type":"Class","course":"7","units":"4-0-8","in-charge":["Sharp, P.","Young, R."],"offering":"Currently Offered","id":"7.60","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-057","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.60","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Emphasizes methods and logic used to analyze eukaryotic cells in diverse systems (e.g., yeast, fly, worm, mouse, human; development, neurons). Subject combines lectures and in-depth roundtable discussions of literature readings with active participation of faculty experts. Focuses on membranes, organelles, the cell surface, cytoskeleton and extracellular matrix. Topics include membrane protein structure, cell surface receptors and transporters; signal transduction pathways; membrane trafficking/sorting/secretion; adhesion and its effects on organization, migration and polarity of cells; regulation of the cell cycle; integration of cells into tissues and organs. Ranges from basic studies to applications to human disease, while emphasizing critical analysis of experimental approaches. Limited enrollment.","label":"Eukaryotic Cell Biology: Principles and Practice","type":"Class","course":"7","units":"4-0-8","in-charge":["Hynes, R. O.","Staff"],"offering":"Currently Offered","id":"7.61","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-058","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.61","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Biochemical properties of bacteria and other microorganisms that enable them to grow under a variety of conditions. Interaction between bacteria and bacteriophages. Genetic and metabolic regulation of enzyme action and enzyme formation. Structure and function of components of the bacterial cell envelope. Protein secretion with a special emphasis on its various roles in pathogenesis. Additional topics include symbiosis, quorum sensing, global responses to DNA damage, and biofilms. Students taking the graduate version are expected to explore the subject in greater depth.","prereq":["7.21","7.03","7.05"],"label":"Microbial Physiology","type":"Class","course":"7","units":"4-0-8","in-charge":["Walker, G. C.","Magasanik, B."],"offering":"Currently Offered","id":"7.62","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-059","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.62","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"A comprehensive survey of molecular, genetic, and cellular aspects of the immune system. Topics include innate and adaptive immunity; cells and organs of the immune system; immunoglobulin, T cell receptor, and major histocompatibility complex (MHC) genes and structure; development and functions of B and T lymphocytes; immune responses to infections and tumors; hypersensitivity, autoimmunity, and immunodeficiencies. Particular attention is paid to the development and function of the immune system as a whole as studied by modern methods and techniques.","prereq":"7.23","label":"Immunology","type":"Class","course":"7","units":"5-0-7","in-charge":["Chen, J.","Ploegh, H.","Steiner, L."],"offering":"Currently Offered","id":"7.63","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-060","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.63","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Specific functions of neurons, the interactions of neurons in development, and the organization of neuronal ensembles to produce behavior, by functional analysis of mutations and molecular analysis of their genes. Concentrates on work with nematodes, fruit flies, mice, and humans.","prereq":"9.322J","label":"Genetic Neurobiology","type":"Class","course":"7","units":"3-0-6","in-charge":["Quinn, W. G.","Littleton, J. T."],"offering":"Currently Offered","id":"7.67J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-061","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.67J","total-units":"9.0"},{"has-final":true,"semester":"Spring","description":"Major areas of cellular and molecular neurobiology including excitable cells and membranes, ion channels and receptors, synaptic transmission, cell-type determination, axon guidance, neuronal cell biology, neurotrophin signaling and cell survival, synapse formation and neural plasticity. Includes lectures and exams, and involves presentation and discussion of primary literature. Focuses on major concepts and recent advances in experimental neuroscience.","prereq":["9.013J","9.011"],"label":"Cellular and Molecular Neurobiology","type":"Class","course":"7","units":"6-0-12","in-charge":["Sheng, M.","Constantine-Paton, M.","Quinn, W."],"offering":"Currently Offered","id":"7.68J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-062","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.68J","total-units":"18.0"},{"has-final":true,"semester":"Spring","description":"Considers molecular control of neural specification, formation of neuronal connections, construction of neural systems, and the contributions of experience to shaping brain structure and function. Topics include: neural induction and pattern formation, cell lineage and fate determination, neuronal migration, axon guidance, synapse formation and stabilization, activity-dependent development and critical periods, development of behavior. In addition to final exam, analysis and presentation of  research papers required for final grade. Additional readings required for graduate credit.","prereq":["9.181J","9.18","9.011"],"label":"Developmental Neurobiology","type":"Class","course":"7","units":"4-0-8","in-charge":"Nedivi, E.","offering":["Not offered next year","Currently Offered"],"id":"7.69J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-063","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.69J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Cells utilize a variety of mechanisms to regulate gene expression, growth, development, and behavior in response to both external and internal conditions. Examines basic principles of biological regulation, focusing on several well-studied examples, usually drawn from microbial species. Readings include primary literature and review articles with emphasis on how we know what we know, and how to think experimentally. Enrollment limited to 40.","label":"Regulation of Gene Expression","type":"Class","course":"7","units":"4-0-8","in-charge":["Fink, G.","Young, R."],"offering":"Currently Offered","id":"7.70","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-064","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.70","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"For students who want to understand the benefits and caveats of biophysical techniques used to ascertain the structure of macromolecules, especially on the 3-D level.  The first half of the course focuses on X-ray crystallography, the single most important technique used in determining the 3-D structure of macromolecules. Discussion of crystallographic theory is complemented with exercises such as crystallization, data processing, and model building. In the second half of the course, biophysical techniques are covered that supplement the 3-D characterization of biological macromolecules. Topics include CD spectroscopy, isothermal calorimetry, analytical ultracentrifugation, dynamic light and small-angle X-ray scattering. Theoretical principles behind the techniques are covered, and students are given practical exercise using instrumentation available at MIT.","prereq":["5.78","5.13","5.60","5.07","7.05"],"label":"Biophysical Chemistry Techniques","type":"Class","course":"7","units":"5-0-7","in-charge":["Drennan, C.","Schwartz, T."],"offering":"Currently Offered","id":"7.71","area":"Graduate Subjects","listing-index":"m7a-065","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.71","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Lectures and literature discussion cover animal development and evolution. Focus on molecular mechanisms, experimental approaches, and relevant disorders. Comparison of vertebrate (mouse, chick, frog, fish) and invertebrate (fly, worm) models. Topics include the early body plan, cell type determination and diversity, organogenesis, morphogenesis, stem cells, cloning, and issues in human development.","label":"Development and Evolution","type":"Class","course":"7","units":"5-0-7 [P/D/F]","in-charge":["Sive, H.","Orr-Weaver, T."],"offering":"Currently Offered","id":"7.72","area":"Graduate Subjects","listing-index":"m7a-066","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.72","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Topics include major metabolic pathways for the biosynthesis of certain cellular constituents and oxidative metabolism. Emphasis is on enzymology and methods used to understand metabolism and enzymatic processes.","prereq":["5.77J","7.35","7.05","5.07"],"label":"Topics in Metabolic Biochemistry","type":"Class","course":"7","units":"4-0-8","in-charge":"Brown, G. M.","offering":"Currently Offered","id":"7.75J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-067","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.75J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"In-depth analysis and discussion of classic and current literature with emphasis on the relationship between protein structure and function. Topics include binding specificity; cooperativity and allostery; protein folding and macromolecular assembly; sequence homology and prediction of structure; and protein engineering and design. Undergraduates should have taken 7.71 or 5.64.","label":"Topics in Protein Biochemistry","type":"Class","course":"7","units":"2-0-7","in-charge":["Keating, A.","Sauer, R. T."],"offering":"Currently Offered","id":"7.76","area":"Graduate Subjects","listing-index":"m7a-068","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.76","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Lectures, analysis, and discussion of current literature, student presentations. Biochemical, biophysical, and genetic approaches to understanding nucleic acids. General properties, functions, and structural motifs of DNA and RNA. DNAs and RNAs as catalysts. Interaction of nucleic acids with proteins such as repressors, restriction and modification enzymes, aminoacyl-tRNA synthetases and other proteins of the translational machinery. RNA protein recognition. Selection and engineering approaches for generating nucleic acid molecules with novel catalytic and binding properties.","prereq":["7.05","7.51"],"label":"Nucleic Acids, Structure, Function, Evolution and Their Interactions with Proteins","type":"Class","course":"7","units":"3-0-9","in-charge":["Bartel, D.","RajBhandary, U."],"offering":"Currently Offered","id":"7.77","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-069","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.77","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"More advanced treatment of biochemical mechanisms that underlie biological processes. Topics include macromolecular machines such as the ribosome, the proteosome, fatty acid synthases as a paradigm for polyketide synthases and non-ribosomal polypeptide synthases, metal cluster assembly and oxidative stress. Emphasis is on experimental methods used to unravel these processes and how these processes fit into the cellular context and coordinate regulation.  Students taking the graduate version are expected to explore the subject in greater depth.","prereq":["5.08J","7.08J","5.12","5.07","7.05"],"label":"Biological Chemistry II","type":"Class","course":"7","units":"4-0-8","in-charge":["Ting, A. Y.","Stubbe, J."],"offering":"Currently Offered","id":"7.80","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-070","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.80","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"development.","prereq":["8.591J","9.531J"],"label":"Systems Biology","type":"Class","course":"7","units":"3-0-9","in-charge":"Oudenaarden, A. Van","offering":"Currently Offered","id":"7.81J","area":"Graduate Subjects","listing-index":"m7a-071","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.81J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Seminar covering embryologic, molecular, and genetic approaches to development in mice and humans. Topics include preimplantation development; gastrulation; embryonic stem cells, gene targeting and nuclear cloning; genomic imprinting; X-inactivation; sex determination; germ cells; association and linkage analysis.","label":"Topics of Mammalian Development and Genetics","type":"Class","course":"7","units":"3-0-9 [P/D/F]","in-charge":["Jaenisch, R.","Page, D."],"offering":"Currently Offered","id":"7.82","area":"Graduate Subjects","listing-index":"m7a-072","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.82","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"; folding intermediates aggregation and competing off-pathway reactions; role of chaperonins, isomerases, and other helper proteins; protein recovery problems in the biotechnology industry; diseases associated with protein folding defects.","prereq":["5.48J","10.543J","7.24","5.07","7.05"],"label":"The Protein Folding Problem","type":"Class","course":"7","units":"4-2-6","in-charge":"King, J. A.","offering":"Currently Offered","id":"7.88J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-073","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.88J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Seminar based on research literature. Papers covered are selected to illustrate important problems and different approaches in the field of computational and systems biology, and provide students a framework from which to evaluate new developments. Required of, and restricted to, first-year CSB PhD students.","label":"Topics in Computational and Systems Biology","type":"Class","course":"7","units":"2-0-10","in-charge":"Burge, C.","offering":"Currently Offered","id":"7.89J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-074","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.89J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Focuses on casting contemporary problems in systems biology and functional genomics in computational terms and providing appropriate tools and methods to solve them. Topics include genome structure and function, transcriptional regulation, and stem cell biology in particular; measurement technologies such as microarrays (expression, protein-DNA interactions, chromatin structure); statistical data analysis, predictive and causal inference, and experiment design. Emphasis on coupling problem structures (biological questions) with appropriate computational approaches.","prereq":["6.874J","6.807","7.012","7.013","7.014","7.015"],"label":"Computational Functional Genomics","type":"Class","course":"7","units":"3-0-9","in-charge":["Gifford, D. K.","Jaakkola, T. S."],"offering":"Currently Offered","id":"7.90J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-075","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.90J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Introduction to computational biology emphasizing the fundamentals of nucleic acid and protein sequence and structural analysis, as well as the analysis of complex biological systems. Principles and methods used for sequence alignment, motif finding, expression array analysis, structural modeling, structure prediction, and network modeling. Techniques include dynamic programming, Markov models, clustering techniques, dead-end elimination and energy minimization approaches. Exposure to currently emerging research areas. Designed for advanced undergraduates and graduate students with strong backgrounds in either molecular biology or computer science. Some foundational material covering basic programming skills, probability and statistics is provided for students with non-quantitative backgrounds. Enrollment limited to 90.","prereq":["20.490J","7.36","20.390","7.05","5.07","7.01x","1.00","1.001","6.00","6.001"],"label":"Foundations of Computational and Systems Biology","type":"Class","course":"7","units":"3-0-9","in-charge":["Burge, C.","Keating, A."],"offering":"Currently Offered","id":"7.91J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-076","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.91J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Lectures and discussions explore the clinical, behavioral, and molecular aspects of brain aging processes in humans. Topics include loss of memory and other cognitive abilitites in normal aging; neurodegenerative conditions such as Parkinson\'s and Alzheimer\'s diseases. Based on lectures, readings taken from the primary literature, and discussions. Students are expected to present topics based on their readings. One written midterm test and one final examination. Alternate years.","prereq":"9.110J","label":"Molecular Pathology and Cognitive Sequelae of Age-dependent Neurological Disease","type":"Class","course":"7","units":"3-0-9","in-charge":["Corkin, S.","Tsai, L.-H."],"offering":"Not offered this year","id":"7.92J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-077","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.92J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Classwork in various fields of biology not covered by the regular subjects of instruction.","label":"Selected Topics in Biology for Graduate Students","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"7.93","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-078","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.93","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Topics of current or special interest.","label":"Special Topics in Biology for Graduate Students","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"7.931","category":["H-LEVEL Grad Credit","H-LEVEL Grad Credit"],"area":"Graduate Subjects","listing-index":"m7a-079","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.931","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"Research Problems","type":"Class","course":"7","units":"Unknown","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"7.941","category":["H-LEVEL Grad Credit","H-LEVEL Grad Credit"],"area":"Graduate Subjects","listing-index":"m7a-080","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.941","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Intensive analysis of historical and current developments in cancer biology.  Topics include principles of transformation, viral and cellular oncogenes, tumor suppressor genes, tumor-cell growth, apoptosis, principles of cancer biology, and cancer genetics. Detailed analyses of the current research literature including important research reports published in recent years. Limited enrollment.","prereq":["7.03","7.06"],"label":"Cancer Biology","type":"Class","course":"7","units":"3-0-9 [P/D/F]","in-charge":["Lees, J.","Weinberg, R."],"offering":"Currently Offered","id":"7.95","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-081","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.95","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Examination of the role of neural plasticity during learning and memory of invertebrates and mammals. Detailed critical analysis of the current literature of molecular, cellular, genetic, electrophysiological, and behavioral studies. Student-directed presentations and discussions of original papers supplemented by introductory lectures. Juniors and seniors require instructor\'s permission.","prereq":"9.301J","label":"Neural Plasticity in Learning and Memory","type":"Class","course":"7","units":"3-0-6","in-charge":["Tonegawa, S.","Bear, M.","Quinn, W.","Wilson, M."],"offering":"Currently Offered","id":"7.98J","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-082","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.98J","total-units":"9.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Program of research leading to the writing of a Ph.D. thesis; to be arranged by the student and an appropriate MIT faculty member.","label":"Graduate Biology Thesis","type":"Class","course":"7","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"7.ThG","category":"H-LEVEL Grad Credit","area":"Graduate Subjects","listing-index":"m7a-083","level":"Grad","url":"http://student.mit.edu/catalog/m7a.html#7.ThG","total-units":"Unknown"}]}