{"items":[{"has-final":true,"semester":["Fall","Spring"],"description":"Fundamental software development and computational methods for engineering, scientific and managerial applications. Emphasis on object-oriented software design and development. Active learning using laptop computers (available on loan). Assignments cover programming concepts, graphical user interfaces, numerical methods, data structures, sorting and searching, computer graphics and selected advanced topics. The Java programming language is used.","prereq":["1.001","18.01"],"label":"1.00 - Introduction to Computers and Engineering Problem Solving","type":"Class","units":"5-1-6","in-charge":"Kocur, G.","offering":"Currently Offered","id":"1.00","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.00","total-units":"12.0"},{"lecture-section-of":"1.00","timeAndPlace":["MWF 15:00-16:30 26-100"],"type":"LectureSection","label":"s1.00-1"},{"has-final":true,"semester":["Fall","Spring"],"description":"Fundamental software development and computational methods for engineering, scientific and managerial applications. Emphasis on object-oriented software design and development. Active learning using laptop computers (available on loan). Assignments cover programming concepts, graphical user interfaces, numerical methods, data structures, sorting and searching, computer graphics and selected advanced topics. The Java programming language is used.","prereq":["1.00","18.01"],"label":"1.001 - Introduction to Computers and Engineering Problem Solving","type":"Class","units":"5-1-3","in-charge":"Kocur, G.","offering":"Currently Offered","id":"1.001","area":"Fundamentals","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.001","total-units":"9.0"},{"lecture-section-of":"1.001","timeAndPlace":["MWF 15:00-16:30 26-100"],"type":"LectureSection","label":"s1.001-1"},{"has-final":false,"semester":"Fall","description":"Introduction to probability and statistics, with emphasis on engineering applications. First segment discusses events and their probability, Bayes\' Theorem, discrete and continuous random variables and vectors, univariate and multivariate distributions, Bernoulli trials and Poisson point processes, and full-distribution uncertainty propogation and conditional analysis. Second segment deals with second-moment representation of uncertainty and second-moment uncertainty propogation and conditional analysis. Last segment covers random sampling, point and interval estimation, hypothesis testing, and linear regression. Concepts illustrated with examples from various areas of engineering.","prereq":"18.02","label":"1.010 - Uncertainty in Engineering","type":"Class","units":"3-2-7","in-charge":"Veneziano, D.","offering":"Currently Offered","id":"1.010","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.010","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Methodologies for evaluating civil engineering projects, which typically are large-scale, long-lived projects involving many economic, financial, social, and environmental factors. Basic techniques of engineering economics, including net present value analysis, life-cycle costing, benefit-cost analysis, and other approaches to project evaluation. Resource and cost estimation procedures appropriate for large-scale infrastructure systems. Examples drawn from building design and construction, transportation systems, urban development, environmental projects, water resource management, and other elements of both the public and private infrastructure.","label":"1.011 - Project Evaluation","type":"Class","units":"3-0-6","in-charge":"Staff","offering":"Currently Offered","id":"1.011","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.011","total-units":"9.0"},{"lecture-section-of":"1.011","timeAndPlace":["TR 9:00-10:30 1-277"],"type":"LectureSection","label":"s1.011-1"},{"has-final":false,"semester":"Fall","description":"Introduces students to the techniques, tools, and theory of engineering design and creative problem-solving, as well as design issues and practices in civil and environmental engineering.  Includes several design cases.  The design approaches explicitly consider technical issues as well as the existing built environment, natural environment, economic and social factors, and expected life span.  A large design case is introduced which is used in subsequent specialty area design subjects and the capstone design subject (1.013).  Students also start to develop their design portfolio.","label":"1.012 - Approaches to Civil and Environmental Engineering Design:  Principles and Practice","type":"Class","units":"1-2-3","in-charge":"Einstein, H. H.","offering":"Not offered this year","id":"1.012","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.012","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"The project synthesizes prior design education. Students who have specialized in structural, geotechnical, engineering systems and environmental areas form teams to design and plan a major project in a specific location. Students formulate the problem and demonstrate creativity in applying theories and methodologies from their design and analysis subjects to develop the facility, with consideration of its technical, environmental, and social feasibility. Parallel to this major design project are smaller projects involving actual building. Lectures on a variety of civil and environmental engineering projects as well as field trips are also part of the subject. Instruction and practice in oral and written communication provided.","label":"1.013 - Senior Civil and Environmental Engineering Design","type":"Class","units":"2-4-8","in-charge":["Einstein, H. H.","Shanahan, P.","O\'Donnell, L."],"offering":"Currently Offered","id":"1.013","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.013","total-units":"14.0"},{"lecture-section-of":"1.013","timeAndPlace":["TR 12:00-13:00 1-371"],"type":"LectureSection","label":"s1.013-1"},{"timeAndPlace":["W 12:00-16:00 1-050"],"type":"LabSection","label":"s1.013-2","lab-section-of":"1.013"},{"has-final":false,"semester":"Spring","description":"Design, construction and testing of a field robotic system, involving team projects with each student responsible for a specific subsystem. Projects focus on electronics, instrumentation, and machine elements. Design for operation in uncertain conditions is considered, with ocean waves and marine structures as a central theme. Use basic statistics, linear systems, Fourier transforms, random processes, spectra and extreme events with applications in design. Lectures on ethics in engineering practice included. Enrollment may be limited due to laboratory capacity. Subject offered in Spring 2008 to accommodate current majors; after that it will be offered every fall term starting with Fall 2008.","prereq":["2.017J","2.003J"],"label":"1.015J - Design of Electromechanical Robotic Systems","type":"Class","units":"3-4-5","in-charge":["Triantafyllou, M. S.","Hover, F. S."],"offering":"Currently Offered","id":"1.015J","category":"Institute LAB","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.015J","total-units":"12.0"},{"lecture-section-of":"1.015J","timeAndPlace":["TR 11:00-12:30 1-136"],"type":"LectureSection","label":"s1.015J-1"},{"timeAndPlace":["M 13:00-17:00 5-007"],"type":"LabSection","label":"s1.015J-2","lab-section-of":"1.015J"},{"has-final":false,"semester":"Spring","description":"Provides an opportunity to develop additional depth of knowledge on issues related to the Earth System problem studied during the Fall term Terrascope subject, 12.000. Student teams  conceptualize, design, prototype and execute interactive museum exhibits to articulate and communicate their knowledge of the subject. Concepts of design are developed with professionals from local museums. Products are open to the public. The Terrascope field trip provides first hand experience and shapes the final exhibit design. Limited to Terrascope students.","prereq":"12.000","label":"1.016 - Communicating Complex Environmental Issues: Designing and Building Interactive Museum Exhibits","type":"Class","units":"3-1-5","in-charge":["Bras, R. L.","Epstein, A."],"offering":"Currently Offered","id":"1.016","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.016","total-units":"9.0"},{"lecture-section-of":"1.016","timeAndPlace":["MW 15:00-16:30 16-168"],"type":"LectureSection","label":"s1.016-1"},{"rec-section-of":"1.016","timeAndPlace":["F 15:00-16:00 16-168"],"type":"RecitationSection","label":"s1.016-2"},{"has-final":false,"semester":"Fall","description":"Fundamentals of ecology, considering Earth as an integrated dynamic system. Coevolution of the biosphere, geosphere, atmosphere and oceans. Introduction to thermodynamics.  The Earth\'s energy budget. Photosynthesis and respiration.  The hydrologic, carbon and nitrogen cycles. Flow of energy and materials through ecosystems, regulation of the distribution and abundance of organisms, structure and function of ecosystems. Evolution and natural selection; metabolic diversity; productivity. Trophic dynamics; models of population growth, competition, mutualism and predation. 7.012-7.015 recommended.","prereq":"7.30J","label":"1.018J - Ecology I: The Earth System","type":"Class","units":"3-1-8","in-charge":["Chisholm, S. W.","Delong, E."],"offering":"Currently Offered","id":"1.018J","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.018J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Use of ecological and thermodynamic principles to examine interactions between humans and the natural environment.  Fluxes and states, conservation and constitutive laws, chemical equilibrium and kinetics, life cycle analysis, economic methods for evaluating benefits and costs, externalities. Topics such as renewable energy, sustainable agriculture and green buildings illustrated through case studies. Case studies are team-oriented and may include numerical simulations and design exercises as well as reviews of relevant research. Instruction and practice in oral and written communication provided.","label":"1.020 - Ecology II: Engineering for Sustainability","type":"Class","units":"3-2-7","in-charge":["McLaughlin, D.","Entekhabi, D.","Marks, D. H."],"offering":"Currently Offered","id":"1.020","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.020","total-units":"12.0"},{"lecture-section-of":"1.020","timeAndPlace":["MW 9:30-11:00 48-316"],"type":"LectureSection","label":"s1.020-1"},{"rec-section-of":"1.020","timeAndPlace":["F 9:00-11:00 48-316"],"type":"RecitationSection","label":"s1.020-2"},{"has-final":false,"semester":"Spring","description":"Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations.","prereq":["1.021","3.021","10.333","18.361","22.00","18.03"],"label":"1.021 - Introduction to Modeling and Simulation","type":"Class","units":"4-0-8","in-charge":["Buehler, M.","Radovitzky, R.","Thonhauser, T."],"offering":"Currently Offered","id":"1.021","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.021","total-units":"12.0"},{"lecture-section-of":"1.021","timeAndPlace":["TR 15:00-16:30 4-231"],"type":"LectureSection","label":"s1.021-1"},{"rec-section-of":"1.021","timeAndPlace":["M 16:00-17:00 4-231"],"type":"RecitationSection","label":"s1.021-2"},{"has-final":false,"semester":"Fall","description":"Presentation and application of principles of soil mechanics. Considers the topics: the origin and nature of soils; soil classification; the effective stress principle; hydraulic conductivity and seepage; stress-strain-strength behavior of cohesionless and cohesive soils and application to lateral earth stresses, bearing capacity and slope stability; consolidation theory and settlement analyses; laboratory and field methods for evaluation of soil properties in design practice. Same lectures as 1.361.","prereq":["1.361","1.366","1.010","1.011","1.035"],"label":"1.032 - Geomaterials and Geomechanics","type":"Class","units":"3-0-9","in-charge":"Jen, L. C.","offering":"Currently Offered","id":"1.032","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.032","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduction to continuum mechanics and material modeling of engineering materials based on first energy principles: deformation and strain; momentum balance, stress and stress states; elasticity and elasticity bounds; plasticity and yield design. Overarching theme is a unified mechanistic language using thermodynamics, which allows understanding, modeling and design of a large range of engineering materials. Next offered in 2009-2010.","prereq":["1.57","1.030"],"label":"1.033 - Mechanics of Material Systems: An Energy Approach","type":"Class","units":"3-2-7","in-charge":"Ulm, F. J.","offering":"Currently Offered","id":"1.033","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.033","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Analysis of determinate and indeterminate structures including beams, plates, cables and arches. Introduction to matrix methods of structural analysis. Mechanical properties of construction materials, including steel, concrete and soils. Behavior of steel and concrete structural systems. Sources of stress concentrations and nonlinearities in steel and concrete structures; composite behavior of reinforced concrete elements, prestressing of concrete. Groundwater seepage, effective stress and consolidation of soils, principles of slope stability. Interaction of structures and soils in foundations and earth retaining systems. Integrated laboratory sessions introduce concepts and techniques to measure properties of materials and to understand structural behavior.","prereq":["1.060","1.050"],"label":"1.035 - Mechanics of Structures and Soils","type":"Class","units":"5-3-10","in-charge":["Kausel, E.","Whittle, A. J.","Germaine, J. T."],"offering":"Currently Offered","id":"1.035","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.035","total-units":"18.0"},{"has-final":true,"semester":"Spring","description":"Basic philosophy of planning and design of structures. Loading conditions, design criteria and factors of safety. Application of principles of structural mechanics and soil mechanics in design. Structural system design concepts.  Design of reinforced concrete structural elements using the ultimate strength design method. Load factor design of structural steel members and connections.  Selection of soil parameters from laboratory and in situ tests.  Stability and ground deformations in geotechnical design.  Design with soil-structure interaction. Emphasis on problem-based learning through team design projects.","prereq":"1.035","label":"1.036 - Structural and Geotechnical Engineering Design","type":"Class","units":"3-1-8","in-charge":["Buyukozturk, O.","Whittle, A. J."],"offering":"Currently Offered","id":"1.036","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.036","total-units":"12.0"},{"lecture-section-of":"1.036","timeAndPlace":["TR 10:30-12:00 1-242"],"type":"LectureSection","label":"s1.036-1"},{"rec-section-of":"1.036","timeAndPlace":["T 15:00-16:00 1-242"],"type":"RecitationSection","label":"s1.036-2"},{"has-final":false,"semester":"Spring","description":"Introduction to project management for custom designed projects, including analytical techniques and practical applications. Topics include resource management, risk analysis and management, financial evaluation and controls, and construction management for all phases of facility life cycle. Experience with software tools and discussion of more novel techniques including risk management sensitivity analysis, process and system dynamics simulation. Visits to ongoing and completed projects. Meets with 1.401J; students taking the graduate version are expected to complete additional assignments.","prereq":["1.401J","ESD.018J"],"label":"1.040 - Project Management","type":"Class","units":"3-1-8","in-charge":"Staff","offering":"Currently Offered","id":"1.040","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.040","total-units":"12.0"},{"lecture-section-of":"1.040","timeAndPlace":["MF 13:00-14:30 1-371"],"type":"LectureSection","label":"s1.040-1"},{"rec-section-of":"1.040","timeAndPlace":["F 16:00-17:00 1-371"],"type":"RecitationSection","label":"s1.040-2"},{"has-final":false,"semester":"Spring","description":"Deals with the design of complex, large, interconnected,  open  sociotechnical(CLIOS) systems, where \"open\" denotes systems that directly interact with the social/political/economic context. Introduces the CLIOS process, defining the concept and distinguishing between quantitative and qualitative analyses of such systems, including introductions of models and frameworks. Systems are characterized, measures of system performance are developed, and key CLIOS system concepts (including sustainability, equity, mobility, and accessibility) are introduced. Class-wide project, with students working in teams on the design of a CLIOS system, taking a broad systems perspective in that design. Examples include the urban ring, a proposed new transit line for Boston; Tren Urbano in San Juan, Puerto Rico; the Central Artery/Ted Williams Tunnel project in Boston; and the transportation of spent nuclear fuel.","prereq":["ESD.01J","1.011"],"label":"1.041J - Engineering System Design","type":"Class","units":"3-1-8","in-charge":"J.Sussman","offering":"Currently Offered","id":"1.041J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.041J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduction to energy fundamentals important to buildings. Conservation of energy. Air-water vapor mixtures. Thermal comfort. Heat pumps and refrigeration cycles, limiting thermodynamic performance. Heat transfer within buildings and major components. Several creative design projects are assigned.","prereq":["2.66J","4.42J","8.01","18.02"],"label":"1.044J - Fundamentals of Energy in Buildings","type":"Class","units":"3-2-7","in-charge":"Glicksman, L. R.","offering":"Not offered this year","id":"1.044J","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.044J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Consideration of societal problems of importance to civil and environmental engineers, including those arising in the context of ecology, manufacturing, energy efficient buildings, transportation and logistics, and water and infrastructure systems. Introduction to modeling of these civil and environmental engineering systems and their optimization using state-of-the-art software. Methods include both deterministic and stochastic optimization approaches, including network flows, linear, nonlinear and integer programming, risk management and decision analysis, and optimal control.","prereq":["1.010","1.00"],"label":"1.045 - Systems Design and Optimization","type":"Class","units":"3-0-9","in-charge":["Barnhart, C.","Jaillet, P."],"offering":"Currently Offered","id":"1.045","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.045","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Basic principles of mechanics to describe the behavior of materials, structures and fluids. Dimensional analysis, conservation of momentum, static equilibrium, stress and stress states, hydrostatics, moments and forces. Material and structural strength criteria. Deformation and strain. Conservation of energy in solid mechanics, elasticity and elasticity bounds. Energy dissipation, plasticity and fracture. Open-ended geotechnical and structural engineering studio exercises and experiments with natural and man-made physical systems.","prereq":"8.01","label":"1.050 - Engineering Mechanics I","type":"Class","units":"3-2-7","in-charge":["Ulm, F. J.","Buehler, M. J."],"offering":"Currently Offered","id":"1.050","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.050","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Mechanics of materials, elastic and plastic behavior, fatigue, fracture. Analytical and computational techniques to assess response of complex structures under static loads (beams, shafts, trusses, frames, cables).  Energy methods to explain the concepts of equilibrium, stability, principle of virtual work, and to develop approximate methods for deflections and buckling loads. Examples using Matlab and PC versions of commercial finite element codes.  Mechanical, ocean and civil engineering applications.","prereq":["2.012J","2.001","1.050"],"label":"1.052J - Mechanics of Structures","type":"Class","units":"4-1-7","in-charge":["Wierzbicki, T.","Patrikalakis, N. M.","Schmidt, H."],"offering":"Currently Offered","id":"1.052J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.052J","total-units":"12.0"},{"lecture-section-of":"1.052J","timeAndPlace":["MW 11:00-12:30 3-270"],"type":"LectureSection","label":"s1.052J-1"},{"timeAndPlace":["T 14:00-17:00 1-307"],"type":"LabSection","label":"s1.052J-2","lab-section-of":"1.052J"},{"has-final":true,"semester":["Fall","Spring"],"description":"Introduction to the dynamics and vibrations of lumped-parameter models of mechanical systems. Kinematics. Force-momentum formulation for systems of particles and rigid bodies in planar motion. Work-energy concepts.  Virtual displacements and virtual work. Lagrange\'s equations for systems of particles and rigid bodies in planar motion. Linearization of equations of motion. Linear stability analysis of mechanical systems. Free and forced vibration of linear multi-degree of freedom models of mechanical systems; matrix eigenvalue problems.  Introduction to numerical methods and MATLAB to solve dynamics and vibrations problems.","prereq":["2.003J","8.01","18.03"],"label":"1.053J - Dynamics and Control I","type":"Class","units":"4-1-7","in-charge":["Hadjiconstantinou, N. G.","Makris, N. C.","Patrikalakis, N. M.","Peacock, T."],"offering":"Currently Offered","id":"1.053J","category":"Restricted Electives in Science and Technology","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.053J","total-units":"12.0"},{"lecture-section-of":"1.053J","timeAndPlace":["MW 9:30-11:00 3-370"],"type":"LectureSection","label":"s1.053J-1"},{"timeAndPlace":["F 13:00-14:00 3-343","F 14:00-15:00 3-343"],"type":"LabSection","label":"s1.053J-2","lab-section-of":"1.053J"},{"rec-section-of":"1.053J","timeAndPlace":["R 14:00-15:00 1-379","R 16:00-17:00 1-242","F 10:00-11:00 1-242"],"type":"RecitationSection","label":"s1.053J-3"},{"has-final":false,"semester":"Fall","description":"Strength and deformation of concrete under various states of stress; failure criteria; concrete plasticity; and fracture mechanics concepts. Fundamental behavior of reinforced concrete structural systems and their members. Basis for design and code constraints. High-performance concrete materials and their use in innovative design solutions. Slabs: yield line theory. Behavior models and nonlinear analysis. Complex systems: bridge structures, concrete shells, and containments.","prereq":["1.541","1.035"],"label":"1.054 - Mechanics and Design of Concrete Structures","type":"Class","units":"3-0-9","in-charge":"Buyukozturk, O.","offering":"Currently Offered","id":"1.054","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.054","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Concepts of mechanical vibration, including free and forced vibration of single- and multi-degree of freedom systems. Modal analysis and matrix formulation of vibration problems. Approximate solution techniques. Vibration and modal analysis of continuous systems: beams, rods, and strings. Introduction to the response of linear systems to random excitation. Numerous examples and applications of vibration measurement and analysis, including vibration isolation and dynamic absorbers, ships, offshore structures, engines, and rotating machinery.","prereq":"2.003J","label":"1.058J - Mechanical Vibration","type":"Class","units":"4-0-8","in-charge":["Kausel, E. A.","Vandiver, J. K."],"offering":"Not offered this year","id":"1.058J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.058J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Mechanics principles for incompressible fluids and their interactions with solid materials. Review of hydrostatics. Conservation of mass, momentum and energy in fluid mechanics. Flow nets, velocity distributions in laminar and turbulent flows, groundwater flows. Momentum and energy principles in hydraulics, with emphasis on open channel flow and hydraulic structures. Analysis of pipe systems, pumps and turbines. Gradually varied flow in open channels, significance of the Froude number, backwater curves. Application of principles through open-ended studio exercises and experiments.","prereq":"1.050","label":"1.060 - Engineering Mechanics II","type":"Class","units":"3-2-7","in-charge":["Madsen, O. S.","Stocker, R."],"offering":"Currently Offered","id":"1.060","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.060","total-units":"12.0"},{"lecture-section-of":"1.060","timeAndPlace":["MWF 11:00-12:00 48-316"],"type":"LectureSection","label":"s1.060-1"},{"rec-section-of":"1.060","timeAndPlace":["R 14:00-16:00 48-316","F 14:00-16:00 48-316"],"type":"RecitationSection","label":"s1.060-2"},{"has-final":false,"semester":"Fall","description":"Introduction to mass transport in environmental flows, with emphasis given to river and lake systems. Derivation and solutions to the differential form of mass conservation equations. Topics include: molecular and turbulent diffusion, boundary layers, dissolution, bed-water exchange, air-water exchange and particle transport.","prereq":["1.61","1.060"],"label":"1.061 - Transport Processes in the Environment","type":"Class","units":"3-1-8","in-charge":"Nepf, H. M.","offering":"Currently Offered","id":"1.061","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.061","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduction to the global water and energy cycles and the earth system including the atmosphere, oceans, land, and biosphere. Fundamentals of hydrologic science and its applications. Covers bases for the characterization of hydrologic processes such as precipitation, evaporation, transpiration by vegetation, infiltration, and storm runoff. Understanding and modeling of groundwater flow, hydraulics of wells, and subsurface transport of pollutants. Probabilistic analysis and risk estimation for hydrologic variables.","prereq":["12.320J","1.060"],"label":"1.070J - Introduction to Hydrology","type":"Class","units":"3-0-9","in-charge":"Entekhabi, D.","offering":"Currently Offered","id":"1.070J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.070J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduces the basic relevant principles and concepts in atmospheric physics, climate dynamics, biogeochemistry, and water and energy balance at the land-atmosphere boundary, through an examination of two current problems in the global environment: carbon dioxide and global warming; and tropical deforestation and regional climate. An introduction to global environmental problems for students in basic sciences and engineering.","prereq":["12.300J","18.03","5.60"],"label":"1.071J - Global Change Science","type":"Class","units":"3-0-9","in-charge":"Eltahir, E. A. B.","offering":"Not offered this year","id":"1.071J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.071J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Spacecraft and Earth-based remote sensing techniques used to study the Earth and other planets, satellites, asteroids, and comets. Emphasizes the physics of electromagnetic radiation to achieve an understanding of remote sensing applications including visible and infrared imaging, spectroscopy, microwave, radar, lidar, and in situ measurements. Recent results from spacecraft emphasized.","prereq":["12.421J","1.718J","12.621J","8.03"],"label":"1.076J - Physical Principles of Remote Sensing","type":"Class","units":"3-0-9","in-charge":"Binzel, R. P.","offering":"Currently Offered","id":"1.076J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.076J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Covers basic environmental chemistry and biology with a focus on understanding the principles governing the function of both natural systems and systems perturbed or engineered by humans. Topics include acid-base, complexation, reduction/oxidation, precipitation, hydrolysis and sorption reactions, population growth and limiting factors, microbial community structure, and the interactions between microbes and their chemical environment. 1.018J is a suggested prerequisite.","prereq":["5.111","5.112","3.091","7.012","7.013","7.014","7.015"],"label":"1.080 - Environmental Chemistry and Biology","type":"Class","units":"4-0-8","in-charge":["Polz, M. F.","Staff"],"offering":"Currently Offered","id":"1.080","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.080","total-units":"12.0"},{"lecture-section-of":"1.080","timeAndPlace":["M 13:00-14:30 48-316"],"type":"LectureSection","label":"s1.080-1"},{"timeAndPlace":["F 13:00-14:30 48-308"],"type":"LabSection","label":"s1.080-2","lab-section-of":"1.080"},{"rec-section-of":"1.080","timeAndPlace":["T 11:00-12:00 48-308"],"type":"RecitationSection","label":"s1.080-3"},{"has-final":false,"semester":"Spring","description":"Analysis of potentially important risk factors for common diseases in the general environment and the workplace:  air-, food- and water-borne chemicals; subclinical infections; diet and lifestyle choices. Analysis of history of changes in common disease rates. General paradigm of environmental sources and exposure of human subpopulations, uptake, internal distribution and metabolism of xenobiotics. Measurement of xenobiotic chemicals and allobiotic life forms in human tissues. Potential pathways of induced pathogenesis: mutagenesis, inflammation, hormonal mimicry.","prereq":["20.104J","ESD.053J","7.012","7.013","7.014","7.015","5.111","5.112","3.091"],"label":"1.081J - Environmental Risks for Common Disease","type":"Class","units":"3-0-9","in-charge":["Thilly, W.","McCunney, R."],"offering":"Not offered this year","id":"1.081J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.081J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Solving air pollution problems requires a multi-disciplinary approach. Effects of air pollutants on human health and the environment. Origins of atmospheric pollutants and methods to estimate emissions from anthropogenic sources. Atmospheric chemistry and pollutant removal processes. Meteorological phenomena and pollutant dispersion modeling. Laws and regulations to control air pollution. Technologies and methods used to control air pollution. Regional and global issues such as acid rain, ozone depletion, and global climate change.","label":"1.082 - Air Pollution: Processes and Controls","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"1.082","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.082","total-units":"12.0"},{"lecture-section-of":"1.082","timeAndPlace":["MW 10:30-12:00 48-308"],"type":"LectureSection","label":"s1.082-1"},{"has-final":true,"semester":"Spring","description":"Consideration of human health issues associated with environmental engineering for air, land, and water systems; fate and transport of environmental contaminants; toxicology, exposure pathways, and risk assessment; treatment technology, and basis for environmental regulation of chemical exposure. Case studies illustrate concepts and issues.","prereq":["1.061","1.080"],"label":"1.083 - Environmental Health Engineering","type":"Class","units":"3-0-9","in-charge":["Shanahan, P.","Staff"],"offering":"Currently Offered","id":"1.083","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.083","total-units":"12.0"},{"lecture-section-of":"1.083","timeAndPlace":["TR 9:30-11:00 48-308"],"type":"LectureSection","label":"s1.083-1"},{"has-final":false,"semester":"Fall","description":"Introductory microbiology from a systems perspective. Considers microbial diversity, population dynamics, and genomics.  Emphasize the delicate balance between microbes and humans, and changes that result in the emergence of infectious diseases and antimicrobial resistance.  Case study approach covers topics such as vaccines, toxins, biodefense, and infections including Legionnaire?s disease, tuberculosis, Helicobacter pylori, and plague.","prereq":["20.106J","5.111","5.112","3.091","7.012","7.013","7.014","7.015"],"label":"1.084J - Systems Microbiology","type":"Class","units":"3-0-9","in-charge":["Schauer, D. B.","DeLong, E."],"offering":"Currently Offered","id":"1.084J","area":"Fundamentals","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.084J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Project-oriented introduction to the principles and practice of engineering design. Design projects and exercises relating to the built and natural environments. Emphasis on achieving function and sustainability through choice of materials and processes, compatibility with natural cycles, and the use of active or adaptive systems. Development of hands-on skills, teamwork, and communication using both images and texts. Exercises and projects engage students in the building, implemenation, and testing of their designs.","prereq":["1.018","1.050"],"label":"1.101 - Introduction to Civil and Environmental Engineering Design I","type":"Class","units":"1-3-2","in-charge":"Staff","offering":"Currently Offered","id":"1.101","category":"Institute LAB","area":"Undergraduate Laboratory Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.101","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Continuation of 1.101 with emphasis on construction and deployment of designs. Performance testing used to determine if designs behave as expected. Further development of hands-on, teamwork and communication skills.","prereq":"1.101","label":"1.102 - Introduction to Civil and Environmental Engineering Design II","type":"Class","units":"1-3-2","in-charge":["Hemond, H. F.","Germaine, J.","Staff"],"offering":"Currently Offered","id":"1.102","category":"Institute LAB","area":"Undergraduate Laboratory Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.102","total-units":"6.0"},{"lecture-section-of":"1.102","timeAndPlace":["T 13:00-14:00 1-050"],"type":"LectureSection","label":"s1.102-1"},{"timeAndPlace":["T 14:00-17:00 1-050","R 14:00-17:00 1-050"],"type":"LabSection","label":"s1.102-2","lab-section-of":"1.102"},{"has-final":false,"semester":"Fall","description":"Builds on the lecture subjects 1.061 and 1.070. Fundamentals of mass and flow measurements in field and laboratory settings, and application of these measurement techniques to analyze real and model environmental systems. Enrollment limited.  Priority given to 1E and 1A students.","label":"1.106 - Environmental Fluid Transport Processes and Hydrology Laboratory","type":"Class","units":"0-4-2","in-charge":["Nepf, H. M.","Entekhabi, D."],"offering":"Currently Offered","id":"1.106","category":"Institute LAB","area":"Undergraduate Laboratory Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.106","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Laboratory and field techniques in biogeochemistry and environmental engineering and their application to the understanding of natural and engineered ecosystems. Exercises demonstrate data acquisition and modeling suited to identifying and quantifying physical, chemical, and biological processes that govern the effects of human activity on the functioning of natural systems and/or the efficacy of engineered approaches to environmental problems. Applications include chemical and biological remediation, measurement of contaminants, and detection of biogeochemical activity in natural environments. An independently designed final project is required. Space limited; preference to majors.","label":"1.107 - Environmental Chemistry and Biology Laboratory","type":"Class","units":"0-4-2","in-charge":["Polz, M.","Frankel, S.","Gschwend, P."],"offering":"Currently Offered","id":"1.107","category":"Institute LAB","area":"Undergraduate Laboratory Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m1a.html#1.107","total-units":"6.0"},{"lecture-section-of":"1.107","timeAndPlace":["T 13:00-14:00 48-316"],"type":"LectureSection","label":"s1.107-1"},{"timeAndPlace":["T 14:00-17:00 48-109"],"type":"LabSection","label":"s1.107-2","lab-section-of":"1.107"},{"has-final":false,"semester":"Fall","description":"Modern software development techniques for engineering and information technology. Design and development of component-based software (using C# and .NET); data structures and algorithms for modeling, analysis, and visualization; basic problem-solving techniques; web services; and the management and maintenance of software. Treatment of topics such as sorting and searching algorithms; and numerical simulation techniques. Foundation for in-depth exploration of image processing, computational geometry, finite element methods, network methods and e-business applications.","prereq":["2.091J","ESD.51J","1.00"],"label":"1.124J - Foundations of Software Engineering","type":"Class","units":"3-0-9","in-charge":"Williams, J. R.","offering":"Currently Offered","id":"1.124J","category":"H-LEVEL Grad Credit","area":"Engineering Information Systems and Computation","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.124J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Software architecting and design of web systems in the context of a start-up company. Targeted at future CTOs who must understand both the business and technical issues involved in architecting enterprise-scale web systems. Student teams confront technically challenging problems. Lectures and readings cover core database, XML, web server components and browser issues in a web service environment. Limited enrollment.","prereq":["ESD.341J","1.124J","6.001"],"label":"1.125J - Web System Architecting: Building Web Services","type":"Class","units":"3-0-9","in-charge":"Williams, J. R.","offering":"Currently Offered","id":"1.125J","category":"H-LEVEL Grad Credit","area":"Engineering Information Systems and Computation","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.125J","total-units":"12.0"},{"lecture-section-of":"1.125J","timeAndPlace":["MW 9:30-11:00 1-150"],"type":"LectureSection","label":"s1.125J-1"},{"has-final":false,"semester":"Fall","description":"Fundamentals of characterizing and recognizing patterns and features of interest in numerical data. Basic tools and theory for signal understanding problems with applications to user modeling, affect recognition, speech recognition and understanding, computer vision, physiological analysis, and more. Decision theory, statistical classification, maximum likelihood and Bayesian estimation, nonparametric methods, unsupervised learning and clustering. Additional topics on machine and human learning from active research. Enrollment limited.","prereq":"MAS.622J","label":"1.126J - Pattern Recognition and Analysis","type":"Class","units":"3-0-9","in-charge":"Picard, R. W.","offering":"Not offered this year","id":"1.126J","category":"H-LEVEL Grad Credit","area":"Engineering Information Systems and Computation","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.126J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Topics in surface modeling: b-splines, non-uniform rational b-splines, physically based deformable surfaces, sweeps and generalized cylinders, offsets, blending and filleting surfaces. Non-linear solvers and intersection problems. Solid modeling: constructive solid geometry, boundary representation, non-manifold and mixed-dimension boundary representation models, octrees. Robustness of geometric computations. Interval methods. Finite and boundary element discretization methods for continuum mechanics problems. Scientific visualization. Variational geometry. Tolerances. Inspection methods. Feature representation and recognition. Shape interrogation for design, analysis, and manufacturing. Involves analytical and programming assignments.","prereq":["2.089J","16.940J"],"label":"1.128J - Computational Geometry","type":"Class","units":"3-0-9","in-charge":["Patrikalakis, N. M.","Gossard, D. C."],"offering":"Not offered this year","id":"1.128J","category":"H-LEVEL Grad Credit","area":"Engineering Information Systems and Computation","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.128J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Core requirement for the M.Eng. program designed to teach students about the roles of today\'s professional engineer and expose them to team-building skills through lectures, team workshops, and seminars. Topics include: written and oral communication, job placement skills, trends in the engineering and construction industry, risk analysis and risk management, managing public information, proposal preparation, project evaluation, project management, liability, professional ethics, and negotiation. Draws on relevant large-scale projects to illustrate each component of the subject. Grading is based on both individual and team exercises involving written and oral presentations. Limited to Course 1 MEng students.","label":"1.133 - MEng Concepts of Engineering Practice","type":"Class","units":"3-0-6","in-charge":"Adams, E. E.","offering":"Currently Offered","id":"1.133","category":"H-LEVEL Grad Credit","area":"Engineering Analysis Methods","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.133","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Theoretical concepts and analysis of wave problems in science and engineering with examples chosen from elasticity, acoustics, geophysics, hydrodynamics, blood flow, nondestructive evaluation, and other applications.  Progressive waves, group velocity and dispersion, energy density and transport.  Reflection, refraction and transmission of plane waves by an interface.  Mode conversion in elastic waves.  Rayleigh waves.  Waves due to a moving load.  Scattering by a two dimensional obstacle.  Reciprocity theorems.  Parabolic approximation.  Waves on the sea surface.  Capillary-gravity waves.  Wave resistance. Radiation of surface waves.  Internal waves in stratified fluids.  Waves in rotating media.  Waves in random media.","prereq":["2.062J","18.376J","2.003J","18.075"],"label":"1.138J - Wave Propagation","type":"Class","units":"3-0-9","in-charge":["Akylas, T. R.","Mei, C. C.","Rosales, R. R."],"offering":"Currently Offered","id":"1.138J","category":"H-LEVEL Grad Credit","area":"Engineering Analysis Methods","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.138J","total-units":"12.0"},{"lecture-section-of":"1.138J","timeAndPlace":["TR 13:00-14:30 1-277"],"type":"LectureSection","label":"s1.138J-1"},{"has-final":false,"semester":"Spring","description":"A computational and application-oriented introduction to the modeling of large-scale systems in a wide variety of decision-making domains and the optimization of such systems using state-of-the-art optimization software. Application domains include transportation and logistics, pattern classification, structural design, financial engineering, and telecommunications system planning. Modeling tools and techniques covered include linear, network, discrete, and nonlinear programming, heuristic methods, sensitivity and postoptimality analysis, decomposition methods for large-scale systems, and stochastic programming.","prereq":["15.094J","15.093","15.081J","6.251J"],"label":"1.142J - Systems Optimization: Models and Computation","type":"Class","units":"4-0-8","in-charge":"Freund, R. M.","offering":"Currently Offered","id":"1.142J","category":"H-LEVEL Grad Credit","area":"Engineering Systems, Economics, and Optimization","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.142J","total-units":"12.0"},{"lecture-section-of":"1.142J","timeAndPlace":["TR 14:30-16:00 E51-057"],"type":"LectureSection","label":"s1.142J-1"},{"rec-section-of":"1.142J","timeAndPlace":["F 15:00-16:00 14-0637"],"type":"RecitationSection","label":"s1.142J-2"},{"has-final":false,"semester":"Fall","description":"Presentation of the spreadsheet mechanics for the efficient calculation of discounted cash flows and related metrics of project worth; the use of data tables as means of exploring sensitivity analysis; and of simulation to develop the value of options. Intensive module designed for students who are not familiar with the efficient use of this Excel. Half-term subject offered in first half of term.","prereq":"ESD.70J","label":"1.145J - Engineering Economy Module","type":"Class","units":"1-0-2 [P/D/F]","in-charge":["Neufville, R. de","Staff"],"offering":"Currently Offered","id":"1.145J","area":"Engineering Systems, Economics, and Optimization","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.145J","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Engineering systems design must have the flexibility to take advantage of new opportunities while avoiding disasters. Subject develops \"real options\" analysis to create design flexibility and measure its value so that it can be incorporated into system optimization. Subject builds on essential concepts of system models, decision analysis, and financial concepts. Emphasis on calculating value of real options with special attention given to efficient analysis and practical applications.  The material is organized and presented to deal with the contextual reality of technological systems, that substantially distinguishes the analysis of real options in engineering systems from that of financial options.","prereq":["1.146","3.56","16.861","ESD.71","1.145J"],"label":"1.146 - Engineering Systems Analysis for Design","type":"Class","units":"3-0-6","in-charge":"Neufville, R. de","offering":"Currently Offered","id":"1.146","category":"H-LEVEL Grad Credit","area":"Engineering Systems, Economics, and Optimization","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.146","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Introduces advanced undergraduates or graduate students in the Schools of Engineering and Science to the integration of technical, economic, political, and environmental consideration required for the successful implementation of new technology. Case studies are drawn from the energy and environment sectors with some emphasis on analytic techniques that serve as a \"tool box\" for students. Technologies considered include fossil, nuclear, solar, wind, fuel cell and energy conservation. International aspects, such as weapons proliferation and global climate effects, also discussed. Enrollment limited.","prereq":["1.149","2.63","5.00","10.579","22.813","ESD.174"],"label":"1.149 - Applications of Technology in Energy and the Environment","type":"Class","units":"3-0-9","in-charge":["Deutch, J.","Lester, R."],"offering":"Currently Offered","id":"1.149","category":"H-LEVEL Grad Credit","area":"Engineering Systems, Economics, and Optimization","level":"Grad","url":"http://student.mit.edu/catalog/m1a.html#1.149","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Quantitative analysis of uncertainty and risk for engineering applications. Fundamentals of probability, random processes, statistics, and decision analysis. Random variables and vectors, uncertainty propagation, conditional distributions, and second-moment analysis. Introduction to system reliability. Bayesian analysis and risk-based decision. Estimation of distribution parameters, hypothesis testing, and simple and multiple linear regressions. Poisson and Markov processes. Emphasis on application to engineering problems.","label":"1.151 - Probability and Statistics in Engineering","type":"Class","units":"3-0-9","in-charge":"Veneziano, D.","offering":"Currently Offered","id":"1.151","category":"H-LEVEL Grad Credit","area":"Engineering Risk Assessment and Probabilistic Analysis","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.151","total-units":"12.0"},{"lecture-section-of":"1.151","timeAndPlace":["TR 11:00-12:30 5-134"],"type":"LectureSection","label":"s1.151-1"},{"has-final":false,"semester":"Spring","description":"Emphasis on three methodologies pertaining to decision making in the presence of uncertainty: reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). Risks of particular interest are those associated with large engineering projects such as the development of new products; the building, maintenance and operation of nuclear reactors and space systems. Presents and interprets some of the frameworks helpful for balancing risks and benefits in the situations that typically involve human safety, potential environmental effects, and large financial and technological uncertainties. Review of elementary probability theory and statistics included.","prereq":["1.155","2.963","3.577","6.938","10.816","16.862","22.82","ESD.72","18.02"],"label":"1.155 - Engineering Risk-Benefit Analysis","type":"Class","units":"3-0-9","in-charge":"Apostolakis, G. E.","offering":"Currently Offered","id":"1.155","category":"H-LEVEL Grad Credit","area":"Engineering Risk Assessment and Probabilistic Analysis","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.155","total-units":"12.0"},{"lecture-section-of":"1.155","timeAndPlace":["MW 9:30-11:00 1-390"],"type":"LectureSection","label":"s1.155-1"},{"rec-section-of":"1.155","timeAndPlace":["T 14:00-15:00 9-338"],"type":"RecitationSection","label":"s1.155-2"},{"has-final":false,"semester":"Fall","description":"Problem-motivated introduction to methods, models and tools for the analysis and design of transportation networks including their planning, operations and control.  Capacity of critical elements of transportation networks.  Traffic flows and deterministic and probabilistic delay models.  Formulation of optimization models for planning and scheduling of freight, transit and airline systems, and their solution using software packages.  User- and system-optimal traffic assignment.  Control of traffic flows on highways, urban grids, and airspace.","prereq":["11.544J","ESD.21J","1.010"],"label":"1.200J - Transportation Systems Analysis","type":"Class","units":"3-1-8","in-charge":["Barnhart, C.","Odoni, A. R."],"offering":"Currently Offered","id":"1.200J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.200J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduces transportation as a complex sociotechnical  system, stressing its social and economic aspects. Key issues shaping urban, intercity, and international passenger and freight transportation in the developed and developing world. Principles governing transportation planning, investment, operations and maintenance. Introduction to quantitative models and qualitative frameworks. System performance and level-of-service metrics and the determinants of transportation demand. Introduction to economic concepts central to transportation. Transportation services and facilities for various modes and intermodal operations.","prereq":["11.545J","ESD.210J"],"label":"1.201J - Introduction to Transportation Systems","type":"Class","units":"3-1-8","in-charge":["Wilson, N. H. M.","Ben-Akiva, M."],"offering":"Currently Offered","id":"1.201J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.201J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Theory and application of modeling and statistical methods for analysis and forecasting of demand for facilities, services, and products. Topics include review of probability and statistics, estimation and testing of linear regression models, theory of individual choice behavior, derivation, estimation, and testing of discrete choice models (including logit, nested logit, GEV, probit, and mixture models), estimation under various sample designs and data collection methods (including revealed and stated preferences), sampling, aggregate forecasting methods, and iterative proportional fitting and related methods. Lectures reinforced with case studies, which require specification, estimation, testing, and analysis of models using data sets from actual applications.","prereq":"ESD.212J","label":"1.202J - Demand Modeling","type":"Class","units":"3-1-8","in-charge":"Ben-Akiva, M. E.","offering":"Currently Offered","id":"1.202J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.202J","total-units":"12.0"},{"lecture-section-of":"1.202J","timeAndPlace":["MW 16:00-17:30 1-150"],"type":"LectureSection","label":"s1.202J-1"},{"rec-section-of":"1.202J","timeAndPlace":["F 11:00-12:00 1-246"],"type":"RecitationSection","label":"s1.202J-2"},{"has-final":false,"semester":"Fall","description":"Quantitative techniques of operations research with emphasis on applications in transportation systems analysis (urban, air, ocean, highway, and pickup and delivery systems) and in the planning and design of logistically oriented urban service systems (e.g., fire and police departments, emergency medical services, and emergency repair services). Unified study of functions of random variables, geometrical probability, multi-server queuing theory, spatial location theory, network analysis and graph theory, and relevant methods of simulation. Computer exercises and discussions of implementation difficulties.","prereq":["6.281J","15.073J","16.76J","ESD.216J","6.431"],"label":"1.203J - Logistical and Transportation Planning Methods","type":"Class","units":"3-0-9","in-charge":["Larson, R. C.","Odoni, A. R.","Barnett, A. I."],"offering":"Currently Offered","id":"1.203J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.203J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Concepts of computation in analysis of engineering systems.  Data structures, relational database representations of engineering data. Algorithms for the solution and optimization of engineering system designs: greedy, dynamic programming, branch and bound, graph algorithms. Complexity analysis. Mini-projects of applications in engineering systems. The Java programming language is used. First Taught in Spring 2008.","prereq":"1.001","label":"1.204 - Computer Algorithms in Systems Engineering","type":"Class","units":"3-0-9","in-charge":"Kocur, G.","offering":"Currently Offered","id":"1.204","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.204","total-units":"12.0"},{"lecture-section-of":"1.204","timeAndPlace":["MW 13:00-14:30 1-150"],"type":"LectureSection","label":"s1.204-1"},{"has-final":false,"semester":"Fall","description":"Advanced theories and applications of models for analysis and forecasting of users\' behavior and demand for facilities, services, and products. Topics vary each year and typically include linear and nonlinear latent variable models including structural equations and latent class models, estimation techniques with multiple data sources, joint discrete and continuous choice models, dynamic models, analysis of panel data, analysis of complex choices, estimation and forecasting with very large choice sets, multidimensional probabilistic choice models, advanced choice models including probit,logit mixtures, hybrid choice models, simulation methods, survey design, model transferability, and use of stated preference data. Alternate years.","prereq":["ESD.213J","1.202"],"label":"1.205J - Advanced Demand Modeling","type":"Class","units":"3-0-9","in-charge":"Ben-Akiva, M. E.","offering":["Not offered next year","Currently Offered"],"id":"1.205J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.205J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Explores a variety of models and optimization techniques for the solution of airline schedule planning problems. Schedule design, fleet assignment, aircraft maintenance routing, crew scheduling, robust planning, integrated schedule planning, and other topics are addressed. Models and solution techniques are surveyed and state-of-the-art applications of these techniques to airline problems are presented.","prereq":["16.77J","ESD.215J"],"label":"1.206J - Airline Schedule Planning","type":"Class","units":"3-0-9","in-charge":"Barnhart, C.","offering":"Not offered this year","id":"1.206J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.206J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Basic elements of intelligent transportation systems. Technological, systems, and institutional aspects of ITS considered, including system architecture, congestion pricing, public/private partnerships, network models, freight, public transportation, ITS and regional strategic transportation planning, environmental aspects of ITS, developing country applications and implementation case studies. Term project required.","prereq":"ESD.221J","label":"1.212J - An Introduction to Intelligent Transportation Systems","type":"Class","units":"3-0-6","in-charge":"Sussman, J.","offering":["Not offered next year","Currently Offered"],"id":"1.212J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.212J","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Equal emphasis on current practice and advanced concepts. Airport location and planning with full consideration of economic, environmental, and other impacts. Demand prediction, determination of the capacity of the airfield, and estimation of levels of congestion. Design of terminals. Role of airports in the aviation and transportation system. Airport access problems. Optimal configuration of air transport networks and implications for airport development. Economics of the airport. Financing and institutional aspects. Special attention to international practice and developments. Alternate years.","prereq":["16.781J","ESD.224J"],"label":"1.231J - Planning and Design of Airport Systems","type":"Class","units":"3-0-9","in-charge":["Neufville, R. de","Odoni, A. R."],"offering":["Not offered next year","Currently Offered"],"id":"1.231J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.231J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Overview of the global airline industry, focusing on recent industry performance, current issues and challenges for the future. Fundamentals of airline industry structure, airline economics, operations planning, safety, labor relations, airports and air traffic control, marketing, and competitive strategies, with an emphasis on the interrelationships among major industry stakeholders. Recent research findings of the MIT Global Airline Industry Program are showcased, including the impacts of congestion and delays, evolution of information technologies, changing human resource management practices, and competitive effects of new entrant airlines. Taught by faculty participants of the Global Airline Industry Program.","prereq":["15.054J","16.71J","ESD.217J"],"label":"1.232J - The Airline Industry","type":"Class","units":"3-0-9","in-charge":["Belobaba, P. P.","Barnett, A. I.","Barnhart, C.","Hansman, R. J.","Kochan, T. A.","Odoni, A. R."],"offering":"Currently Offered","id":"1.232J","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.232J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Overview of airline management decision processes, with a focus on economic issues and their relationship to operations planning models and decision support tools. Application of economic models of demand, pricing, costs, and supply to airline markets and networks. Examination of industry practice and emerging methods for fleet planning, route network design, scheduling, pricing and revenue management, with emphasis on the interactions between the components of airline management and profit objectives in competitive environments. Students participate in a competitive airline management simulation game as part of the subject requirements.","prereq":["16.75J","16.71J"],"label":"1.234J - Airline Management","type":"Class","units":"3-0-9","in-charge":"Belobaba, P. P.","offering":"Currently Offered","id":"1.234J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.234J","total-units":"12.0"},{"lecture-section-of":"1.234J","timeAndPlace":["MW 13:00-14:30 33-418"],"type":"LectureSection","label":"s1.234J-1"},{"has-final":false,"semester":"Spring","description":"Focuses on the integration of land use and transportation planning, drawing from cases in both industrialized and developing countries. Reviews underlying theories, analytical techniques, and the empirical evidence of the land use-transportation relationship at the metropolitan, intra-metropolitan, and micro-scales.  Also covers the various ways of measuring urban structure, form, and the \"built environment.\"  Develops students? skills to assess relevant policies, interventions and impacts.","prereq":"11.526J","label":"1.251J - Comparative Land Use and Transportation Planning","type":"Class","units":"3-0-9","in-charge":"Zegras, C.","offering":"Currently Offered","id":"1.251J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.251J","total-units":"12.0"},{"lecture-section-of":"1.251J","timeAndPlace":["TR 11:00-12:30 1-135"],"type":"LectureSection","label":"s1.251J-1"},{"has-final":false,"semester":"Fall","description":"History, policy, and politics of urban transportation. The role of the federal government and the \"highway revolt.\" Public transit in the auto era. Analytic tools for transportation planning and policy analysis. The contribution of transportation to air pollution and climate change. Land use and transportation interactions. Bicycles, pedestrians, and traffic calming. Examples from the Boston area.","prereq":["11.540J","ESD.225J"],"label":"1.252J - Urban Transportation Planning","type":"Class","units":"3-0-9","in-charge":["Salvucci, F.","Murga, M."],"offering":"Currently Offered","id":"1.252J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.252J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Through a combination of lectures, cases, and class discussions the subject examines the economic and political conflict between transportation and the environment. Investigates the role of government regulation, green business and transportation policy as a facilitator of economic development and environmental sustainability. Analyzes a variety of international policy problems including government-business relations, the role of interest groups, non-governmental organizations, and the public and media in the regulation of the automobile; sustainable development; global warming; politics of risk and siting of transport facilities; environmental justice; equity; as well as transportation and public health in the urban metropolis. Provides students with an opportunity to apply transportation and planning methods to develop policy alternatives in the context of environmental politics.","prereq":["11.543J","ESD.222J"],"label":"1.253J - Transportation Policy and Environmental Limits","type":"Class","units":"3-0-9","in-charge":["Coughlin, J.","Salvucci, F."],"offering":"Currently Offered","id":"1.253J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.253J","total-units":"12.0"},{"lecture-section-of":"1.253J","timeAndPlace":["F 14:00-17:00 1-277"],"type":"LectureSection","label":"s1.253J-1"},{"has-final":true,"semester":"Spring","description":"Evolution and role of urban public transportation modes, systems, and services, focussing on bus and rail. Description of technological characteristics and their impacts on capacity, service quality, and cost. Current practice and new methods for data collection and analysis, performance monitoring, route design, frequency determination, and vehicle and crew scheduling. Effect of pricing policy and service quality on ridership. Methods for estimating costs associated with proposed service changes. Organizational models for delivering public transportation service including finance and operations.","prereq":["11.541J","ESD.226J","1.201J"],"label":"1.258J - Public Transportation Systems","type":"Class","units":"3-0-9","in-charge":"Wilson, N. H. M.","offering":"Currently Offered","id":"1.258J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.258J","total-units":"12.0"},{"lecture-section-of":"1.258J","timeAndPlace":["TR 13:00-14:30 1-246"],"type":"LectureSection","label":"s1.258J-1"},{"has-final":false,"semester":"Fall","description":"Introduction to supply chain management from both analytical and practical perspectives.  Stressing a unified approach, the course allows the student to develop a framework for making intelligent decisions within the supply chain.  Key logistics functions are covered to include demand planning, procurement, inventory theory and control, transportation planning and execution, reverse logistics, and flexible contracting.  Concepts explored include postponement, portfolio management, dual sourcing, and others.  Emphasis is placed on being able to recognize and manage risk, analyze various tradeoffs, and model logistics systems.","prereq":["15.770J","ESD.260J"],"label":"1.260J - Logistics Systems","type":"Class","units":"3-0-9","in-charge":["Sheffi, Y.","Caplice, C."],"offering":"Currently Offered","id":"1.260J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.260J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"A combination of lectures and cases covering the strategic, management, and operating issues in contemporary logistics and integrated supply chain management. Includes: logistics strategy; supply chain restructuring and change management; and distribution, customer service, and inventory policy.","prereq":["15.771J","ESD.261J"],"label":"1.261J - Case Studies in Logistics and Supply Chain Management","type":"Class","units":"3-0-6","in-charge":"Byrnes, J.","offering":"Currently Offered","id":"1.261J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.261J","total-units":"9.0"},{"lecture-section-of":"1.261J","timeAndPlace":["MW 10:00-11:30 E51-345"],"type":"LectureSection","label":"s1.261J-1"},{"has-final":false,"semester":"IAP","description":"Introduction to theory and practice of the core functions of the enterprises that impact supply chain management. Provides a basic understanding of strategy, industry structure, organization behavior, and marketing highlighted in the context of the supply chain. Uses lectures to introduce core functions and cases to illustrate the relationship and context for supply chain management. This results in a basic tool set to illustrate the theory and practice of analyzing and managing the relationship between supply chain management and the various functions of business. Also provides a solid understanding of supply chain management in practice. Core subject for MEng in Logistics.","prereq":["ESD.262J","ESD.260"],"label":"1.262J - Supply Chain Context","type":"Class","units":"2-0-4 [P/D/F]","in-charge":["Caplice, C.","Goentzel, J."],"offering":"Currently Offered","id":"1.262J","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.262J","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Information technology fundamentals: software process, data modeling, UML, relational databases and SQL. Internet technologies: http, xhtml, XML, Web services. Introduction to security. Fundamentals of telecommunications. Students complete project that covers requirements/design, data model, database implementation, website, and system architecture. No prior programming experience required.","prereq":"ESD.264J","label":"1.264J - Database, Internet, and Systems Integration Technologies","type":"Class","units":"4-1-7","in-charge":"Kocur, G.","offering":"Currently Offered","id":"1.264J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.264J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"An overview of globalization and the international environment: the international marketing, international finance and supply chain interface; global strategy for logistics and supply chain management; global supply chain models; role of government intervention and regulations; the role of ports and airports in international product movements; the economics of international air and ocean carriers; and the forwarding industry. First half term subject.","prereq":["2.965J","15.765J","ESD.265J","1.260J","1.261J","1.262J","15.760"],"label":"1.265J - International Supply Chain Management","type":"Class","units":"2-0-4","in-charge":["Marcus, H. S.","Weiss, A."],"offering":"Currently Offered","id":"1.265J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.265J","total-units":"6.0"},{"lecture-section-of":"1.265J","timeAndPlace":["MW 13:00-14:30 2-105"],"type":"LectureSection","label":"s1.265J-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"Individual advanced study of a topic in transportation systems, selected with the approval of the instructor.","label":"1.27 - Studies in Transportation","type":"Class","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"1.27","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.27","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Survey of Operations Research models and techniques developed for a variety of problems arising in logistical planning of multi-echelon systems. Focus on planning models for production/inventory/distribution strategies in general multi-echelon multi-item systems. Topics include vehicle routing problems, dynamic lot sizing inventory models, stochastic and deterministic multi-echelon inventory systems, the bullwhip effect, pricing models, and integration problems arising in supply chain management.","prereq":"ESD.273J","label":"1.270J - Logistics and Supply Chain Management","type":"Class","units":"3-0-9","in-charge":"Simchi-Levi, D.","offering":"Not offered this year","id":"1.270J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.270J","total-units":"12.0"},{"has-final":false,"semester":"IAP","description":"Exploration of the technological and managerial issues involved in the design and operation of distribution and logistics physical facilities and associated information technology in an enterprise wise supply chain. Includes day-long site visits to logistics operations in the local area, as well as day-long software tutorials on commercial-grade software packages used in the design of logistics networks. The curriculum also includes lectures and case studies from faculty and professional logistics consultants focusing on the design and operation of efficient logistics facilities.","prereq":["ESD.272J","1.260J"],"label":"1.272J - Design and Operation of Logistics Facilities and Networks","type":"Class","units":"2-0-1","in-charge":"Caplice, C.","offering":"Currently Offered","id":"1.272J","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.272J","total-units":"3.0"},{"has-final":false,"semester":"Spring","description":"Focuses on effective supply chain strategies for companies that operate globally, with emphasis on how to plan and integrate supply chain components into a coordinated system.  Students are exposed to concepts and models important in supply chain planning with emphasis on key tradeoffs and phenomena. Introduces and utilizes key tactics such as risk pooling and inventory placement, integrated planning and collaboration, and information sharing. Lectures, computer exercises, and case discussions introduce various models and methods for supply chain analysis and optimization. Recommended for Operations Management concentrators. First half-term subject.","prereq":["15.762J","ESD.267J","1.260J","15.760","15.761"],"label":"1.273J - Supply Chain Planning","type":"Class","units":"2-0-4","in-charge":["Graves, S. C.","Simchi-Levi, D."],"offering":"Currently Offered","id":"1.273J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.273J","total-units":"6.0"},{"lecture-section-of":"1.273J","timeAndPlace":["MW 8:00-9:30 1-390"],"type":"LectureSection","label":"s1.273J-1"},{"rec-section-of":"1.273J","timeAndPlace":["F 8:00-9:30 1-390"],"type":"RecitationSection","label":"s1.273J-2"},{"has-final":false,"semester":"Spring","description":"Focuses on decision making for system design, as it arises in manufacturing systems and supply chains. Students exposed to frameworks and models for structuring the key issues and trade-offs. Presents and discusses new opportunities, issues and concepts introduced by the internet and e-commerce. Introduces various models, methods and software tools for logistics network design, capacity planning and flexibility, make-buy, and integration with product development. Industry applications and cases illustrate concepts and challenges.  Recommended for Operations Management concentrators. Second half-term subject.","prereq":["15.763J","ESD.268J","1.260","15.760","15.761"],"label":"1.274J - Manufacturing System and Supply Chain Design","type":"Class","units":"2-0-4","in-charge":["Graves, S. C.","Simchi-Levi, D."],"offering":"Currently Offered","id":"1.274J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.274J","total-units":"6.0"},{"lecture-section-of":"1.274J","timeAndPlace":["MW 8:00-9:30 1-390"],"type":"LectureSection","label":"s1.274J-1"},{"rec-section-of":"1.274J","timeAndPlace":["F 8:00-9:30 1-390"],"type":"RecitationSection","label":"s1.274J-2"},{"has-final":true,"semester":"Spring","description":"The theory of urban land and housing markets, and the spatial development of cities. The roles played by transportation systems and local governments in shaping urban location patterns. Interregional competition, economic development, and the migration of labor and capital.","prereq":["11.410J","14.573J","ESD.191J","14.03","14.04"],"label":"1.283J - Cities and Regions: Urban Economics and Public Policy","type":"Class","units":"3-0-9","in-charge":"Wheaton, W.","offering":"Currently Offered","id":"1.283J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.283J","total-units":"12.0"},{"lecture-section-of":"1.283J","timeAndPlace":["TR 14:30-16:00 E51-063"],"type":"LectureSection","label":"s1.283J-1"},{"has-final":false,"semester":"Spring","description":"Surveys theories of regional growth, factor mobility, clustering, industrial restructuring, learning regions, and global supply chains from a political-economy perspective. Examines/critiques accounting frameworks including accounting for the underground economy, multipliers, linkages, and supply chains used to assess employment and environmental impacts, infrastructure investments. Assesses price indices, industrial location and employment measures, and shift-share analyses. Discussions of US and foreign applications.","prereq":["11.481J","ESD.192J","14.03","14.04"],"label":"1.284J - Analyzing and Accounting for Regional Economic Change","type":"Class","units":"3-0-9","in-charge":"Polenske, K. R.","offering":"Currently Offered","id":"1.284J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.284J","total-units":"12.0"},{"lecture-section-of":"1.284J","timeAndPlace":["TR 9:00-10:30 1-246"],"type":"LectureSection","label":"s1.284J-1"},{"has-final":false,"semester":"Fall","description":"Reviews regional economic theories and models and provides students with experience in using alternative economic impact assessment models on microcomputers. Problem sets are oriented around infrastructure, housing, energy, and environmental issues. Students work with a client generally in Boston and make a presentation to the client. Emphasis on written and oral presentation skills.","prereq":["11.482J","ESD.193J","11.481J"],"label":"1.285J - Regional Socioeconomic Impact Analyses and Modeling","type":"Class","units":"2-1-9","in-charge":"Polenske, K. R.","offering":"Currently Offered","id":"1.285J","category":"H-LEVEL Grad Credit","area":"Transportation","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.285J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Detailed study of soil properties with emphasis on interpretation of field and laboratory test data and their use in soft-ground construction engineering. Includes: consolidation and secondary compression; basic strength principles; stress-strain strength behavior of clays, emphasizing effects of sample disturbance, anisotropy, and strain rate; strength and compression of granular soils; and engineering properties of compacted soils. Some knowledge of field and laboratory testing assumed; 1.37 desirable. Alternate years.","prereq":"1.361","label":"1.322 - Soil Behavior","type":"Class","units":"4-0-8","in-charge":["Whittle, A. J.","Jen, L. C."],"offering":["Not offered next year","Currently Offered"],"id":"1.322","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.322","total-units":"12.0"},{"lecture-section-of":"1.322","timeAndPlace":["MWF 10:00-11:00 1-132"],"type":"LectureSection","label":"s1.322-1"},{"rec-section-of":"1.322","timeAndPlace":["M 11:00-12:00 1-132"],"type":"RecitationSection","label":"s1.322-2"},{"has-final":false,"semester":"Spring","description":"Hazardous waste site remediation and waste disposal facility design. Introduction to hazardous waste including the definition of hazardous waste, regulatory requirements under RCRA and CERCLA, waste characteristics,  environmental chemistry, hydrology, and contaminant transport. Characterization of contaminated sites, preliminary site assessment, site investigation techniques, remediation technologies for soil and groundwater, risk assessment, and monitoring.  The design, construction, operation, and hydrology of landfills and waste disposal facilities.","prereq":"1.72","label":"1.34 - Waste Containment and Remediation Technology","type":"Class","units":"3-0-9","in-charge":"Shanahan, P.","offering":"Currently Offered","id":"1.34","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.34","total-units":"12.0"},{"lecture-section-of":"1.34","timeAndPlace":["TR 13:00-14:30 1-371"],"type":"LectureSection","label":"s1.34-1"},{"has-final":false,"semester":"Spring","description":"Presentation of fundamental theories in soil mechanics: field equations of linear elasticity and solutions of boundary value problems. Introduction to finite element method. Steady and transient flow in porous media; applications in confined and unconfined seepage, and one-dimensional consolidation. Introduction to poro-elasticity. Yielding and failure of soils; plasticity theory and limit analyses, with examples for bearing capacity and slope stability. Cam Clay models and critical state theory of soil behavior.","prereq":"1.361","label":"1.351 - Theoretical Soil Mechanics","type":"Class","units":"3-0-9","in-charge":"Whittle, A. J.","offering":"Not offered this year","id":"1.351","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.351","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Presentation and application of principles of soil mechanics. Considers the topics: the origin and nature of soils; soil classification; the effective stress principle; hydraulic conductivity and seepage; stress-strain-strength behavior of cohesionless and cohesive soils and application to lateral earth stresses, bearing capacity and slope stability; consolidation theory and settlement analyses; laboratory and field methods for evaluation of soil properties in design practice. Same lectures as 1.361.","prereq":["1.032","1.366","1.031"],"label":"1.361 - Advanced Soil Mechanics","type":"Class","units":"3-0-9","in-charge":"Jen, L. C.","offering":"Currently Offered","id":"1.361","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.361","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"testing), shallow (footings and raftings) and deep (piles and caissons) foundations, excavation support systems, groundwater control, slope stability, soil improvement (compaction, soil reinforcement, etc.), and construction monitoring. Core requirement for Geotechnical MEng program.","label":"1.364 - Advanced Geotechnical Engineering","type":"Class","units":"4-0-8","in-charge":"Whittle, A. J.","offering":"Currently Offered","id":"1.364","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.364","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Presentation and application of principles of soil mechanics. Considers the topics: the origin and nature of soils; soil classification; the effective stress principle; hydraulic conductivity and seepage; stress-strain-strength behavior of cohesionless and cohesive soils and application to lateral earth stresses, bearing capacity and slope stability; consolidation theory and settlement analyses; laboratory and field methods for evaluation of soil properties in design practice. Same lectures as 1.361.","prereq":["1.032","1.361","1.031"],"label":"1.366 - Geotechnical Engineering","type":"Class","units":"3-0-6","in-charge":"Jen, L. C.","offering":"Currently Offered","id":"1.366","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.366","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"testing. Extensive laboratory experiments to explore geotechnical test equipment and techniques. Laboratory use of testing automation and electronic instrumentation. Experiments include data analysis, evaluation, and presentation.","prereq":"1.031","label":"1.37 - Geotechnical Measurements and Exploration","type":"Class","units":"3-4-2","in-charge":"Germaine, J. T.","offering":"Currently Offered","id":"1.37","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.37","total-units":"9.0"},{"has-final":false,"semester":"Fall","description":"Effect of geologic features and processes on constructed facilities; interaction between man-made structures and human activities in general, and the geologic environment. Planning of subsurface exploration. Engineering geologic characterization of soil and rock, including joint surveys and aspects of sedimented and residual soils. Laboratory on basic geologic identification and mapping techniques. Extensive reading of case histories. Field trip.","label":"1.38 - Engineering Geology","type":"Class","units":"3-1-8","in-charge":"Einstein, H. H.","offering":"Currently Offered","id":"1.38","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.38","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Introduces theoretical and experimental aspects of rock mechanics and on this basis prepares the student for rock engineering. Includes review of laboratory and field testing; empirical and analytical methods for describing strength, deformability, and permeability of intact rock and rock masses; fracture mechanics and mechanics of discontinua including flow through discontinua; design and analysis of rock slopes and foundations on rock; and discussion of blasting design. Alternate years.","prereq":["1.38","1.361"],"label":"1.381 - Rock Mechanics","type":"Class","units":"3-0-6","in-charge":"Einstein, H. H.","offering":"Not offered this year","id":"1.381","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.381","total-units":"9.0"},{"has-final":false,"semester":"Spring","description":"Familiarization with the most important aspects of planning, design, and construction of underground openings in soft ground and rock. Detailed engineering analysis and design. Major aspects of construction techniques and construction planning. General planning and economic problems. Major design project. Alternate years.","prereq":["1.361","1.38"],"label":"1.383 - Underground Construction","type":"Class","units":"3-0-6","in-charge":"Einstein, H. H.","offering":"Currently Offered","id":"1.383","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.383","total-units":"9.0"},{"lecture-section-of":"1.383","timeAndPlace":["TR 9:00-10:30 1-371"],"type":"LectureSection","label":"s1.383-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.39 - Studies in Geotechnical Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.39","category":"H-LEVEL Grad Credit","area":"Geoenvironmental and Geotechnical Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.39","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"Introduction to theories of project management, with practical application through case projects. Topics include resource management, financial controls, and construction management (including scheduling, estimating, progress monitoring, and project control) for all phases of expected life of facility. Meets with undergraduate subject 1.040; students taking the graduate version are expected to complete additional assignments.","prereq":["ESD.018J","1.040"],"label":"1.401J - Project Management","type":"Class","units":"3-1-8","in-charge":"Staff","offering":"Currently Offered","id":"1.401J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.401J","total-units":"12.0"},{"lecture-section-of":"1.401J","timeAndPlace":["MF 13:00-14:30 1-371"],"type":"LectureSection","label":"s1.401J-1"},{"rec-section-of":"1.401J","timeAndPlace":["F 16:00-17:00 1-371"],"type":"RecitationSection","label":"s1.401J-2"},{"has-final":false,"semester":"Spring","description":"Examination of financing methods and structure, project financial evaluation, and financial management in the domestic and international construction industry. Analytical concepts and methodologies from modern finance theory and practice presented in lecture/discussions and applied to case analyses including problems in cash-flow analysis, corporate financial structure, project finance, and foreign exchange exposure. Innovative financial securities, such as options, and methods such as privatization and sale-leaseback are examined. Prior subjects in microeconomics, accounting, and/or corporate finance desirable but not required.  Half-term subject offered in the second half of term.","prereq":"11.341J","label":"1.45J - International Construction Finance","type":"Class","units":"2-0-4","in-charge":"Samii, M. V.","offering":"Currently Offered","id":"1.45J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.45J","total-units":"6.0"},{"lecture-section-of":"1.45J","timeAndPlace":["T 9:00-12:00 W31-301"],"type":"LectureSection","label":"s1.45J-1"},{"has-final":false,"semester":"Spring","description":"Examines the fundamental concepts of strategic planning and management in the context of the real estate, design, and construction industry. Basic business relationships among firms in the design and construction value chain. Topics include industry analysis, strategic planning models, information technology strategy, strategy in fragmented industries, negotiation, and macro trends shaping the industry as a whole. Case method of instruction is used, and supplemented by extensive readings. Half term subject taught in the first half of the term.","prereq":"11.348J","label":"1.46J - Strategic Leadership in Real Estate and Construction","type":"Class","units":"2-0-4","in-charge":"Macomber, J.","offering":"Currently Offered","id":"1.46J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.46J","total-units":"6.0"},{"lecture-section-of":"1.46J","timeAndPlace":["T 9:00-11:00 W31-301"],"type":"LectureSection","label":"s1.46J-1"},{"has-final":false,"semester":"Fall","description":"Explains role of the entrepreneur in the construction industry using case studies to outline different steps in developing construction enterprises. Emphasis on strategic marketing component in the development of these businesses. Lectures address program, development, and construction management services. Guest lectures from entrepreneurs in their field. Team project identifying an opportunity and developing a strategic marketing/business plan for a company in the design/construct or related industries.  Half-term subject offered in second half of term.","prereq":"11.345J","label":"1.462J - Entrepreneurship in Construction and Real Estate Development","type":"Class","units":"2-0-4","in-charge":"Kennedy, J. F.","offering":"Currently Offered","id":"1.462J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.462J","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Explores the challenges and risks managers of construction, engineering, and architecture companies face in entering global markets. Includes discussion of innovative approaches to marketing, partnering, risk management, finance, specialized delivery systems, privatization, and appropriate strategies for entering international markets. Half-term subject offered in first half of term.","prereq":"11.342J","label":"1.463J - The Impact of Globalization on the Built Environment","type":"Class","units":"2-0-4","in-charge":"Wolff, D.","offering":"Currently Offered","id":"1.463J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.463J","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Examines long-term effects of information technology on business strategy in the real estate and construction industry. Considerations include: supply chain, allocation of risk, impact on contract obligations and security, trends toward consolidation, and the convergence of information transparency and personal effectiveness. Resources drawn from the world of dot-com entrepreneurship and \"old economy\" responses. Taught by case study method. Half-term subject offered in the first half of term.","prereq":"11.343J","label":"1.464J - E-Commerce and the Internet in Real Estate and Construction","type":"Class","units":"2-0-4","in-charge":"Macomber, J.","offering":"Currently Offered","id":"1.464J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.464J","total-units":"6.0"},{"has-final":false,"semester":"Spring","description":"Examines the compatibility of various project delivery methods, consisting of organizations, contracts, and award methods, with certain types of projects and owners. Six methods examined: traditional general contracting; construction management; multiple primes; design-build; turnkey; and build-operate-transfer. Consists of lectures, case studies, guest speakers, and a team project to analyze a case example. Half-term subject offered in second half of term.","prereq":"11.344J","label":"1.472J - Innovative Project Delivery in the Public and Private Sectors","type":"Class","units":"2-0-4","in-charge":"Gordon, C. M.","offering":"Currently Offered","id":"1.472J","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.472J","total-units":"6.0"},{"lecture-section-of":"1.472J","timeAndPlace":["TR 16:00-17:30 W31-301"],"type":"LectureSection","label":"s1.472J-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"Individual study of an advanced topic in construction engineering and management, selected with approval of faculty supervisor.","label":"1.482 - Studies in Construction Engineering and Management","type":"Class","units":"Unknown","in-charge":"Moavenzadeh, F.","offering":["Can be repeated for credit","Currently Offered"],"id":"1.482","category":"H-LEVEL Grad Credit","area":"Construction Engineering and Management","level":"Grad","url":"http://student.mit.edu/catalog/m1b.html#1.482","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Strength and deformation of concrete under various states of stress; failure criteria; concrete plasticity; and fracture mechanics concepts. Fundamental behavior of reinforced concrete structural systems and their members. Basis for design and code constraints. High-performance concrete materials and their use in innovative design solutions. Slabs: yield line theory. Behavior models and nonlinear analysis. Complex systems: bridge structures, concrete shells, and containments.","prereq":["1.054","1.051"],"label":"1.541 - Mechanics and Design of Concrete Structures","type":"Class","units":"3-0-9","in-charge":"Buyukozturk, O.","offering":"Currently Offered","id":"1.541","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.541","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Structural components in nuclear power plant systems, their functional purposes, operating conditions, and mechanical/structural design requirements. Combines mechanics techniques with models of material behavior to determine adequacy of component design. Considerations include mechanical loading, brittle fracture, inelastic behavior, elevated temperatures, neutron irradiation, vibrations and seismic effects.","prereq":["2.084J","22.314J","2.001"],"label":"1.56J - Structural Mechanics in Nuclear Power Technology","type":"Class","units":"3-0-9","in-charge":["Kazimi, M. S.","Buyukozturk, O."],"offering":"Not offered this year","id":"1.56J","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.56J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Presents a rational basis for the preliminary design of motion-sensitive structures. Topics include: analytical and numerical techniques for establishing the optimal stiffness distribution, the role of damping in controlling motion, tuned mass dampers, base isolation systems, and an introduction to active structural control. Examples illustrating the application of the motion-based design paradigm to building structures subjected to wind and seismic excitation are discussed.","label":"1.561 - Motion-Based Design","type":"Class","units":"3-0-9","in-charge":["Connor, J. J.","Jr."],"offering":"Currently Offered","id":"1.561","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.561","total-units":"12.0"},{"lecture-section-of":"1.561","timeAndPlace":["TR 11:00-12:30 5-233"],"type":"LectureSection","label":"s1.561-1"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Core requirement for the High Performance Structures MEng program. Focus on the conceptual design of complex structures and the use of advanced technologies to improve the performance of structural systems with respect to their durability, constructability, efficiency and sustainability. An in-depth design study is carried out as a group effort and provides the background for individual student theses. Students must register for 1.562 for the Fall term, IAP, and the Spring term. Limited to Course 1 MEng students.","label":"1.562 - High-Performance Structures MEng Project","type":"Class","units":"5-0-10","in-charge":["Connor, J. J.","Jr."],"offering":"Currently Offered","id":"1.562","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.562","total-units":"15.0"},{"lecture-section-of":"1.562","timeAndPlace":["F 13:30-15:30 1-150"],"type":"LectureSection","label":"s1.562-1"},{"has-final":false,"semester":"Fall","description":"See description under 1.033. An opportunity to update knowledge in continuum mechanics and constitutive behavior and modeling of engineering materials based on thermodynamics of irreversible processes. Graduate students are expected to complete additional assignments.","prereq":["1.033","1.035"],"label":"1.57 - Mechanics of Material Systems: An Energy Approach","type":"Class","units":"3-2-7","in-charge":"Ulm, F. J.","offering":"Not offered this year","id":"1.57","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.57","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Introduction to the theory and applications of durability mechanics based on first energy principles: damage and fracture mechanics; chemomechanics; poromechanics; and coupled diffusion and dissolution processes in porous materials. Analytical and numerical methods in durability mechanics such as dimensional analysis, scaling, finite difference, finite volume and finite element method, are also discussed. Development of a research paper on design, prediction, and optimization of durability performance of engineering structures.","prereq":["1.033","1.57"],"label":"1.570 - Durability Mechanics","type":"Class","units":"3-0-9","in-charge":"Ulm, F. J.","offering":"Not offered this year","id":"1.570","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.570","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Computer-based methods for the analysis of large-scale structural systems. Modeling strategies for complex structures. Application to tall buildings, cable-stayed bridges, shell structures, and tension structures. Introduction to the theory of active quasi static structural control. Design of feedback control systems for civil structures. Simulation studies using customized computer software.","prereq":"1.052","label":"1.571 - Structural Analysis and Control","type":"Class","units":"3-0-9","in-charge":["Connor, J. J.","Jr."],"offering":"Currently Offered","id":"1.571","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.571","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Provides an understanding of the full range of structures and structural forms including both how they are designed and how they are built. The skills to conceive a structure differ from those required for analysis, requiring one to visualize options and judge their relative advantages in a qualitative manner. Design and assembly, in turn, require an understanding of how the structure is created.  Structural types, including tall buildings, bridges, and kinetic/deployable structures, are presented with case studies of built structures.","label":"1.572 - Structural Systems","type":"Class","units":"2-0-4","in-charge":"Kassabian, P.","offering":"Currently Offered","id":"1.572","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.572","total-units":"6.0"},{"has-final":false,"semester":"Fall","description":"Fundamental concepts of structural mechanics with applications to marine, civil, and mechanical structures. Residual stresses. Thermal effects. Analysis of beams, columns, tensioned beams, trusses, frames, arches, cables, and shafts of general shape and material, including composites. Elastic buckling of columns. Exact and approximate methods, energy methods, principle of virtual work, introduction to computational structural mechanics. Examples from civil, mechanical, offshore, and ship structures.","prereq":["2.080J","2.002","2.012"],"label":"1.573J - Structural Mechanics","type":"Class","units":"4-0-8","in-charge":["Wierzbicki, T.","Connor, J. J.","Jr."],"offering":"Currently Offered","id":"1.573J","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.573J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Review of single- and multiple-degree-of-freedom vibration problems, using matrix formulation and normal mode superposition methods. Time and frequency domain solution techniques including convolution and Fourier transforms. Applications to vibration isolation, damping treatment, and dynamic absorbers. Analysis of continuous systems by exact and approximate methods. Applications to buildings, ships, and offshore structures. Vibration measurement and analysis techniques.","prereq":["2.060J","16.221J","18.03","1.573J"],"label":"1.581J - Advanced Structural Dynamics","type":"Class","units":"3-1-8","in-charge":["Kausel, E.","Vandiver, J. K."],"offering":"Currently Offered","id":"1.581J","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.581J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides ability to design and assess steel structures.  Steel structures are taught at three levels: the overall structural system (multi-story buildings, wide-span buildings, bridges, masts, and towers); the components of a structural system (floor systems, plate girders, frames, and beams); and the details of structural components (connection types, welding, and bolting). Each level includes a balance among theoretical analysis, design requirements, and construction/cost considerations.  Existing structures are used as worked examples.","label":"1.582 - Design of Steel Structures","type":"Class","units":"2-0-4","in-charge":"Kassabian, P.","offering":"Currently Offered","id":"1.582","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.582","total-units":"6.0"},{"lecture-section-of":"1.582","timeAndPlace":["W 16:00-18:00 1-371"],"type":"LectureSection","label":"s1.582-1"},{"has-final":false,"semester":"Spring","description":"Explores communication about technological subjects in the context of colossal engineering failures including Three Mile Island, Bhopal, the Columbia Shuttle, 9/11, and Katrina. Examines the basic engineering principles and the social context of several such failures in case studies from various engineering disciplines. Students see how problematic communications, sometimes subtly unrecognizable at the time, significantly contributed to the final failures. Students collaborate to produce a final written and oral research report that anticipates a potential failure and makes recommendations for avoiding it. Multiple sections, each limited to 18 students.","prereq":["3.070J","22.002J","21W.781J","ESD.032J"],"label":"1.588J - Communicating About Technology:  Colossal Failures in Engineering","type":"Class","units":"3-0-9","in-charge":["Eagar, T.","Haas, W.","Kadak, A.","Lagace, P."],"offering":"Currently Offered","id":"1.588J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Materials and Structures","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.588J","total-units":"12.0"},{"rec-section-of":"1.588J","timeAndPlace":["MWF 13:00-14:00 1-375","MWF 14:00-15:00 1-375"],"type":"RecitationSection","label":"s1.588J-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.589 - Studies in Structural Design and Analysis","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.589","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.589","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.597 - Studies in Construction Materials","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.597","category":"H-LEVEL Grad Credit","area":"Materials and Structures","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.597","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Meets with undergraduate subject 1.061. Graduate level includes additional homework in the form of reviews of relevant journal and practical articles. See description under subject 1.061.","prereq":["1.061","1.060"],"label":"1.61 - Transport Processes in the Environment","type":"Class","units":"3-1-8","in-charge":"Nepf, H. M.","offering":"Currently Offered","id":"1.61","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.61","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Fundamentals of fluid dynamics intrinsic to natural physical phenomena and/or engineering processes. A range of topics and advanced problem-solving techniques discussed. Sample topics include brief review of basic laws of fluid motion, scaling and approximations, creeping flows, boundary layers in high-speed flows, steady and transient, similarity method of solution, buoyancy-driven convection in porous media, dispersion in steady or oscillatory flows, physics and mathematics of linearized instability, effects of shear and stratification. Choice of one of the following modules: I:  capillary phenomena or non-Newtonian fluid (for 2.21J) or II:  geophysical fluid dynamics of coastal waters (for 1.63J).","prereq":["2.21J","18.085","1.131J","2.25"],"label":"1.63J - Fluid Dynamics","type":"Class","units":"4-0-8","in-charge":["Mei, C. C.","McKinley, G. H.","Akylas, T. R.","Stocker, R."],"offering":"Currently Offered","id":"1.63J","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.63J","total-units":"12.0"},{"lecture-section-of":"1.63J","timeAndPlace":["MW 9:30-11:00 1-375"],"type":"LectureSection","label":"s1.63J-1"},{"rec-section-of":"1.63J","timeAndPlace":["W 16:00-17:00 1-136"],"type":"RecitationSection","label":"s1.63J-2"},{"has-final":false,"semester":"Spring","description":"Introduction to physical processes occuring in lakes and shallow surface water systems with emphasis on mechanisms affecting fate and transport. Topics include internal waves; differential heating and cooling; boundary mixing; turbulent mixing; influence of vegetation. Begins with a review of Navier-Stokes equation.","prereq":["1.060","1.061"],"label":"1.64 - Physical Limnology","type":"Class","units":"3-0-6","in-charge":"Nepf, H. M.","offering":["Not offered next year","Currently Offered"],"id":"1.64","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.64","total-units":"9.0"},{"lecture-section-of":"1.64","timeAndPlace":["MW 13:00-14:30 48-308"],"type":"LectureSection","label":"s1.64-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"Individual study in advanced topics as arranged between individual students and staff. Choice of subjects from theoretical, experimental, and practical phases of hydromechanics, hydraulic engineering, water resources, hydrology, and environmental engineering.","label":"1.66 - Problems in Water Resources and Environmental Engineering","type":"Class","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"1.66","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.66","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Emphasizes the quantitative description of the mechanics of sediment transport in steady and unsteady flows based on hydrodynamic principles. Equations of motion for particles in a turbulent flow, entrainment, bedload, and suspended load. Bedform mechanics, ripples, and dunes. Flow resistance and boundary-layer mechanics for waves and combined wave-current flows. Wave-induced longshore currents, longshore and on-offshore sediment transport. Coastal protection. Basic theory of  water waves assumed known; contact instructor in late August if this presents a problem.","prereq":"1.061","label":"1.67 - Sediment Transport and Coastal Processes","type":"Class","units":"4-0-8","in-charge":"Madsen, O. S.","offering":["Not offered next year","Currently Offered"],"id":"1.67","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.67","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"A unified treatment of nonlinear oscillations and wave phenomena with applications to mechanical, optical, geophysical, fluid, electrical and flow-structure interaction problems. Nonlinear free and forced vibrations; nonlinear resonances; self-excited oscillations; lock-in phenomena.  Nonlinear dispersive and nondispersive waves; resonant wave interactions; propagation of wave pulses and nonlinear Schrodinger equation.  Nonlinear long waves and breaking; theory of characteristics; the Korteweg-de Vries equation; solitons and solitary wave interactions.  Stability of shear flows.  Some topics and applications may vary from year to year.","prereq":["2.034J","18.377J"],"label":"1.685J - Nonlinear Dynamics and Waves","type":"Class","units":"3-0-9","in-charge":["Akylas, T. R.","Mei, C. C.","Rosales, R. R."],"offering":"Not offered this year","id":"1.685J","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.685J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Basic hydrodynamics of waves in deep and shallow water. Linear theory, dispersion, superposition, and spectral representation. Energy, energy transport, and dissipation by bottom friction. Refraction and diffraction by breakwaters. Some nonlinear aspects and wave breaking. Emphasizes physical interpretation of mathematical results and their engineering application. Storm surges, coastal circulation, and forecasting of wind-wave characteristics. Wind-wave statistics, wave forces on piles, and breakwater stability.","label":"1.69 - Introduction to Coastal Engineering","type":"Class","units":"4-0-8","in-charge":"Madsen, O. S.","offering":"Currently Offered","id":"1.69","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.69","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Basics of wave hydrodynamics. Linearized theories: propagation and dispersion. Refraction of waves approaching a coast. Scattering of waves by fixed obstacles. Resonance in a harbor. Interaction of waves with one or more floating bodies. Scattering and radiation problems. General identities and theorems of reciprocity: Haskind, Bessho and Newman relations.  Extraction of wave power from floating bodies: buoys and buoy arrays, beam-sea absorbers, rafts.  Resonance and oscillating water columns (single and arrays). Effects of random incident waves. Multiple scattering by periodic or randomly irregular seabed. Drift forces. Nonlinear theories: long waves in shallow water. Airy and Boussinesq approximations, subharmonic resonance of edge waves, upstream solitons. Weakly nonlinear waves in intermediate depth. Nonlinear Schroedinger equation, Benjamin-Feir instability. Radiation stresses and infragravity waves. Localization of nonlinear waves over random seabed.","prereq":["2.064J","1.060","2.25","13.012","1.131","18.075"],"label":"1.691J - Surface Wave Dynamics","type":"Class","units":"3-0-9","in-charge":["Mei, C. C.","Akylas, T. R."],"offering":"Currently Offered","id":"1.691J","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.691J","total-units":"12.0"},{"lecture-section-of":"1.691J","timeAndPlace":["TR 9:30-11:00 1-134"],"type":"LectureSection","label":"s1.691J-1"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"Special problems in oceanographic engineering, carried out under supervision of members of the staff of the Woods Hole Oceanographic Institution. Given at Woods Hole Oceanographic Institution.","prereq":"2.689J","label":"1.699J - Special Projects in Oceanographic Engineering","type":"Class","units":"Unknown","in-charge":["Stanton, T. K.","Staff, Woods Hole"],"offering":["Can be repeated for credit","Currently Offered"],"id":"1.699J","category":"H-LEVEL Grad Credit","area":"Hydrodynamics and Coastal Engineering","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.699J","total-units":"Unknown"},{"has-final":false,"semester":"Spring","description":"measurement techniques. Data assimilation approaches to retrieval based on remotely sensed data.","prereq":["12.826J","1.070J","1.714"],"label":"1.713J - Land-Atmosphere Interaction","type":"Class","units":"3-0-9","in-charge":"Entekhabi, D.","offering":"Not offered this year","id":"1.713J","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.713J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Covers observations and theory of the physical processes involved in the hydrologic cycle. Processes considered are rainfall, infiltration, runoff generation, stream flow, evaporation, transpiration,and rainfall interception.","prereq":"1.070J","label":"1.714 - Surface Hydrology","type":"Class","units":"3-0-9","in-charge":"Eltahir, E. A. B.","offering":"Currently Offered","id":"1.714","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.714","total-units":"12.0"},{"lecture-section-of":"1.714","timeAndPlace":["TR 14:30-16:00 48-308"],"type":"LectureSection","label":"s1.714-1"},{"has-final":false,"semester":"Fall","description":"Covers probabilistic concepts and techniques that are useful for environmental data analysis. Topics include: random variables; hypothesis testing; linear regression; analysis of trends; space/time domain analysis; frequency domain analysis; simulation of random fields; Markovian processes; derived distributions; and stochastic differential equations. Problem sets emphasize environmental applications.","prereq":"1.010","label":"1.715 - Environmental Data Analysis","type":"Class","units":"3-0-9","in-charge":"Eltahir, E. A. B.","offering":["Not offered next year","Currently Offered"],"id":"1.715","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.715","total-units":"12.0"},{"has-final":false,"semester":"IAP","description":"","prereq":["12.265J","12.565"],"label":"1.717J - Techniques in Remote Sensing","type":"Class","units":"1-4-1 [P/D/F]","in-charge":"Zuber, M.","offering":["Not offered next year","Currently Offered"],"id":"1.717J","area":"Hydrology and Water Resource Systems","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.717J","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Meets with undergraduate subject 12.421J, but assignments differ. Graduate students are expected to explore the subject in greater depth. Requires one extra class meeting per week.","prereq":["12.621J","1.076J","12.421J","8.03"],"label":"1.718J - Physical Principles of Remote Sensing","type":"Class","units":"4-0-8","in-charge":"Binzel, R. P.","offering":"Currently Offered","id":"1.718J","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.718J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Fundamentals of subsurface flow and transport, emphasizing the role of groundwater in the hydrologic cycle, the relation of groundwater flow to geologic structure, and the management of contaminated groundwater. Topics include: Darcy equation, flow nets, mass conservation, the aquifer flow equation, heterogeneity and anisotropy, storage properties, regional circulation, unsaturated flow, recharge, stream-aquifer interaction, well hydraulics, flow through fractured rock, numerical models, groundwater quality, contaminant transport processes, dispersion, decay, and adsorption. Includes laboratory and computer demonstrations. Core requirement for Environmental and Geoenvironmental MEng program.","prereq":"1.061","label":"1.72 - Groundwater Hydrology","type":"Class","units":"3-1-8","in-charge":"Harvey, C.","offering":"Currently Offered","id":"1.72","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.72","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Advanced treatment of solute transport in natural porous media with a focus on coupled chemical reaction and transport. Numerical modeling. Stochastic treatment of temporal and spatial variability. Mobile/immobile domain mass transfer, macrodispersion, tracer tests, salt water intrusion, heat transport.","prereq":["1.72","18.075"],"label":"1.721 - Advanced Subsurface Hydrology","type":"Class","units":"3-0-9","in-charge":"Harvey, C.","offering":"Currently Offered","id":"1.721","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.721","total-units":"12.0"},{"lecture-section-of":"1.721","timeAndPlace":["MW 14:30-16:00 48-308"],"type":"LectureSection","label":"s1.721-1"},{"has-final":false,"semester":"Fall","description":"For Institute students in all departments interested in the behavior of chemicals in the environment (see ESD listings for other subjects). Emphasis on man-made chemicals, their movement through water, air, soil, and their eventual fate. Physical transport, as well as chemical and biological sources and sinks, are discussed. Linkages to health effects, sources and control, and policy aspects. Core requirement for Environmental MEng program.","prereq":"ESD.151J","label":"1.725J - Chemicals in the Environment: Fate and Transport","type":"Class","units":"3-0-9","in-charge":"Shanahan, P.","offering":"Currently Offered","id":"1.725J","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.725J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Survey of simulation and optimization methods for management of water resources. Linear, nonlinear, and dynamic programming illustrated with case studies. Applications include reservoir and irrigation development, conjunctive use of surface and groundwater, capacity expansion, and sustainable resource development.","prereq":"1.070","label":"1.731 - Water Resource Systems","type":"Class","units":"3-0-9","in-charge":"McLaughlin, D.","offering":"Currently Offered","id":"1.731","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.731","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Emphasizes methods of geological interpretation of remotely sensed image data. Students are challenged with a series of images from which the group must, with guidance, draw relevant conclusions about the geology/geomorphology of the area represented. Images selected may include topographic or bathymetric maps, aerial photographs, satellite images, seafloor side-scan sonar images, scenes from Mars, the moons of Jupiter, etc., and include both printed and digital formats. Emphasis on general principles rather than specific applications. Methods of digital image enhancement discussed. Grades based on biweekly projects- written reports, maps, processed digital images, and interpretive cross-sections. Meets with subject 12.162J, but assignments differ. Enrollment limited to 12.","prereq":["12.462J","12.162","12.001","1.32","12.421J"],"label":"1.733J - Geological Image Interpretation","type":"Class","units":"3-3-6","in-charge":"Staff, EAPS","offering":"Not offered this year","id":"1.733J","category":"H-LEVEL Grad Credit","area":"Hydrology and Water Resource Systems","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.733J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines the major physical, chemical, and biological features of lakes and wetlands: basin geology, water budget, heat balance, thermal stratification, lake circulation, energy flow, biological communities, and cycles of major elements. Explores methodologies of limnology, including field methods and use of models, applications of modern sensor technology to lake and wetland studies and current issues in lake and wetland management. Alternate years.","label":"1.75 - Limnology and Wetland Ecology","type":"Class","units":"3-0-9","in-charge":"Hemond, H. F.","offering":["Not offered next year","Currently Offered"],"id":"1.75","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.75","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Quantitative treatment of chemical processes in aquatic systems such as lakes, oceans, rivers, estuaries, groundwaters, and wastewaters. A brief review of chemical thermodynamics is followed by discussion of acid-base, precipitation-dissolution, coordination, and reduction-oxidation reactions. Emphasis is on equilibrium calculations as a tool for understanding the variables that govern the chemical composition of aquatic systems and the fate of inorganic pollutants.","prereq":["5.11","5.111","5.112","5.60"],"label":"1.76 - Aquatic Chemistry","type":"Class","units":"3-0-9","in-charge":"Staff","offering":"Currently Offered","id":"1.76","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.76","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Emphasis on mathematical models for predicting distribution and fate of effluents discharged into lakes, reservoirs, rivers, estuaries, and oceans. Focuses on formulation and structure of models as well as analytical and simple numerical solution techniques. Role of element cycles, such as oxygen, nitrogen, and phosphorus, as water quality indicators. Offshore outfalls and diffusion. Salinity intrusion in estuaries. Thermal stratification, eutrophication, and sedimentation processes in lakes and reservoirs. Core requirement for Environmental MEng  program.","prereq":"1.060","label":"1.77 - Water Quality Control","type":"Class","units":"3-0-9","in-charge":"Adams, E. E.","offering":"Currently Offered","id":"1.77","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.77","total-units":"12.0"},{"lecture-section-of":"1.77","timeAndPlace":["TR 11:00-12:30 48-316"],"type":"LectureSection","label":"s1.77-1"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"Core requirements for Environmental MEng program. Designed to teach about environmental engineering through the use of case studies, computer software tools, and seminars from industrial experts. Case studies provide basis for group project as well as individual thesis. Past case studies have included the MMR Superfund site on Cape Cod; restoration of the Florida Everglades; dredging of Boston Harbor; local watershed trading programs; appropriate wastewater treatment technology for Brazil; point-of-use water treatment for Nepal, Brownfields Development in Providence, RI, and water resource planning for the island of Cyprus. Students must register for 1.782 for Fall term, IAP, and Spring term. Limited to Course 1 MEng students.","label":"1.782 - Environmental Engineering MEng Project","type":"Class","units":"5-0-10","in-charge":"Adams, E. E.","offering":"Currently Offered","id":"1.782","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.782","total-units":"15.0"},{"lecture-section-of":"1.782","timeAndPlace":["F 15:00-17:00 3-370"],"type":"LectureSection","label":"s1.782-1"},{"has-final":false,"semester":"Fall","description":"Introduction to important issues in contemporary environmental law, policy, and economics. Discusses the roles and interactions of Congress, federal agencies, state governments, and the courts in dealing with environmental problems. Topics include common law, administrative law, environmental impact assessments required by the National Environmental Policy Act, and legislation and court decisions dealing with air pollution, water pollution, the control of hazardous waste, pollution and accident prevention, community right-to-know, and environmental justice. Explores the role of science and economics in legal decisions, and economic incentives as an alternative or supplement to regulation. Analyzes pollution as an economic problem and a failure of markets. Introduction to basic legal skills: how to read and understand cases, regulation, and statutes; how to discover the current state of the law in a specific area; and how to take action toward resolution of environmental problems.","prereq":["11.021J","17.393J","1.811J","11.630J","ESD.133J"],"label":"1.801J - Environmental Law, Policy, and Economics: Pollution Prevention and Control","type":"Class","units":"3-0-9","in-charge":["Ashford, N.","Caldart, C."],"offering":"Currently Offered","id":"1.801J","category":"HASS Elective","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.801J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims\' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed for each regulatory regime.","prereq":["11.022J","1.812J","11.631J","ESD.134J"],"label":"1.802J - Regulation of Chemicals, Radiation, and Biotechnology","type":"Class","units":"3-0-9","in-charge":["Ashford, N.","Caldart, C."],"offering":"Currently Offered","id":"1.802J","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.802J","total-units":"12.0"},{"lecture-section-of":"1.802J","timeAndPlace":["W 19:00-10:00 E51-372"],"type":"LectureSection","label":"s1.802J-1"},{"has-final":false,"semester":"Fall","description":"Reviews and analyzes federal and state regulation of air and water pollution and hazardous wastes. Analyzes pollution as an economic problem and the failure of markets. Emphasizes use of legal mechanisms and alternative approaches (such as economic incentives and voluntary approaches) to control pollution and to encourage chemical accident and pollution prevention. Focuses on the major federal legislation, the underlying administrative system, and the common law in analyzing environmental policy, economic consequences, and the role of the courts. Discusses classical pollutants and toxic industrial chemicals, community right-to-know, and environmental justice. Also provides an introduction to basic legal skills.","prereq":["11.630J","ESD.133J","1.801J","11.021J","17.393J"],"label":"1.811J - Environmental Law, Policy, and Economics: Pollution Prevention and Control","type":"Class","units":"3-0-9","in-charge":["Ashford, N. A.","Caldart, C. C."],"offering":"Currently Offered","id":"1.811J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.811J","total-units":"12.0"},{"has-final":true,"semester":"Spring","description":"Focuses on policy design and evaluation in the regulation of hazardous substances and processes. Includes risk assessment, industrial chemicals, pesticides, food contaminants, pharmaceuticals, radiation and radioactive wastes, product safety, workplace hazards, indoor air pollution, biotechnology, victims\' compensation, and administrative law. Health and economic consequences of regulation, as well as its potential to spur technological change, are discussed.","prereq":["11.631J","ESD.134J","1.802J","11.022J"],"label":"1.812J - Regulation of Chemicals, Radiation, and Biotechnology","type":"Class","units":"3-0-9","in-charge":["Ashford, N. A.","Caldart, C. C."],"offering":"Currently Offered","id":"1.812J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.812J","total-units":"12.0"},{"lecture-section-of":"1.812J","timeAndPlace":["W 19:00-10:00 E51-372"],"type":"LectureSection","label":"s1.812J-1"},{"has-final":false,"semester":"Fall","description":"The Schumpeterian notion of technological innovation as \"the engine of growth\" is being challenged as the globalization of trade is increasingly seen as the driving force of industrial economies. With the establishment of the World Trade Organization implementing the GATT, NAFTA, and other trading regimes, serious questions have been raised concerning the effects of global trade on sustainability, which must be viewed broadly to include not only a healthy economic base, but also a sound environment, stable employment, adequate purchasing power, distributional equity, national self-reliance, and maintenance of cultural integrity. Subject explores the many dimensions of sustainability and the use of national, multinational, and international political and legal mechanisms to further sustainable development.","prereq":["11.466J","15.657J","ESD.137J"],"label":"1.813J - Sustainability, Trade, and the Environment","type":"Class","units":"3-0-9","in-charge":"Ashford, N. A.","offering":"Currently Offered","id":"1.813J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.813J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Quantitative techniques for life cycle analysis of the impacts of materials extraction, processing use, and recycling; and economic analysis of materials processing, products, and markets. Student teams undertake a major case study of automobile manufacturing using the latest methods of analysis and computer-based models of materials process.","prereq":["3.560J","ESD.123J","ESD.10","3.56"],"label":"1.814J - Industrial Ecology","type":"Class","units":"3-0-6","in-charge":["Kirchain, R.","Clark, J.","Field, F."],"offering":"Currently Offered","id":"1.814J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.814J","total-units":"9.0"},{"lecture-section-of":"1.814J","timeAndPlace":["TR 9:00-10:30 E51-057"],"type":"LectureSection","label":"s1.814J-1"},{"has-final":false,"semester":"Fall","description":"Examines the political economy of development planning and implementation, with a focus on developing countries in Asia, Africa and Latin America.  Assesses the concept of sustainable development and its application in planning processes.  Asks when and how stakeholder participation, negotiation and consensus building help or hinder attempts to promote sustainability.  Emphasis on integration of theory and practice, using local, sectoral, national and global cases.","prereq":"11.366J","label":"1.817J - Planning, Participation and Consensus Building for Sustainable Development","type":"Class","units":"3-0-9","in-charge":"Fairman, D.","offering":"Currently Offered","id":"1.817J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.817J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Assessment of current and potential energy systems, covering extraction, conversion and end-use, with emphasis on meeting regional and global energy needs in the 21st century in a sustainable manner. Examination of energy technologies in each fuel cycle stage for fossil (oil, gas, synthetic), nuclear (fission and fusion) and renewable (solar, biomass, wind, hydro, and geothermal) energy types, along with storage, transmission, and conservation issues. Focus on evaluation and analysis of energy technology systems in the context of political, social, economic, and environmental goals. Open to upper-class undergraduates.","prereq":["2.65J","10.391J","11.371J","22.811J","ESD.166J"],"label":"1.818J - Sustainable Energy","type":"Class","units":"3-1-8","in-charge":["Golay, M. W.","Tester, J. W.","Freidberg, J. P."],"offering":"Currently Offered","id":"1.818J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.818J","total-units":"12.0"},{"lecture-section-of":"1.818J","timeAndPlace":["TR 15:00-17:00 56-114"],"type":"LectureSection","label":"s1.818J-1"},{"has-final":false,"semester":"Fall","description":"Teaches thought processes and quantitative tools, including life cycle assessment (LCA) and the LEED rating system, applicable to integrated/whole building design with the goal of minimizing the waste of materials, energy and water. Readings, lectures, site visits, and homework encourage systematic thinking and interdisciplinary collaboration to make sustainable design a reality. Includes a team project of students? choice, such as a conceptual design of a sustainable new building, a ?green? retrofit, or a comparative LCA.","prereq":"4.447J","label":"1.819J - Design for Sustainability","type":"Class","units":"2-0-4","in-charge":["Connor, J.","Ochsendorf, J.","Adams, E."],"offering":"Currently Offered","id":"1.819J","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.819J","total-units":"6.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Advanced topics in environmental microbiology, ecological genomics, microbial evolution and population genetics,  oceanography, biogeochemical processes, environmental organic chemistry and aquatic chemistry. Includes independent study, seminar, laboratory, or field studies.","label":"1.82 - Problems in Environmental Microbiology and Chemistry","type":"Class","units":"Unknown","in-charge":["Chisholm, S. W.","DeLong, E.","Polz, M. F.","Alm, E. J.","Thompson, J.","Gschwend, P. M.","Hemond, H. F."],"offering":["Can be repeated for credit","Currently Offered"],"id":"1.82","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.82","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Focuses on the processes affecting organic compounds in the environment.  Uses physical chemical properties to predict chemical transfers between environmental compartments (air, water, sediments, and biota). Uses molecular structure-reactivity relationships to estimate chemical, photochemical, and biochemical transformation rates. Resulting process models are combined to predict environmental concentrations (and related biological exposures) of anthropogenic and natural organic compounds.  Graduate students taking 1.83 for H-level credit have additional reading and homework emphasizing structure-activity relationships.","prereq":["1.831","5.60","18.03"],"label":"1.83 - Environmental Organic Chemistry","type":"Class","units":"4-0-8","in-charge":"Gschwend, P. M.","offering":"Currently Offered","id":"1.83","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.83","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Focuses on the processes affecting organic compounds in the environment. Uses physical chemical properties to predict chemical transfers between environmental compartments (air, water, sediments, and biota). Uses molecular properties to estimate chemical, photochemical, and biochemical transformation rates. Resulting process models are combined to predict environmental concentrations (and related biological exposures) of anthropogenic and natural organic compounds.","prereq":["1.83","5.60","18.03"],"label":"1.831 - Environmental Organic Chemistry","type":"Class","units":"4-0-8","in-charge":"Gschwend, P. M.","offering":"Currently Offered","id":"1.831","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.831","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Overview of engineering approaches to protect water quality with an emphasis on fundamental principals. Theory and conceptual design of systems for treating municipal wastewater and drinking water. Reactor theory, process kinetics, and models.  Physical, chemical, and biological processes, including sedimentation, filtration, biological treatment, disinfection, and sludge processing.  Engineered and natural processes for wastewater treatment.","prereq":["1.061","1.61","1.725"],"label":"1.85 - Water and Wastewater Treatment Engineering","type":"Class","units":"3-0-9","in-charge":"Shanahan, P.","offering":"Currently Offered","id":"1.85","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.85","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"","prereq":"11.479J","label":"1.851J - Water and Sanitation Infrastructure in Developing Countries","type":"Class","units":"Unknown","in-charge":"PM), T EVE (3-6","offering":"Currently Offered","id":"1.851J","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.851J","total-units":"Unknown"},{"lecture-section-of":"1.851J","timeAndPlace":["T 15:00-18:00 26-152"],"type":"LectureSection","label":"s1.851J-1"},{"has-final":false,"semester":"Fall","description":"A general introduction to the diverse roles of microorganisms in natural and artificial environments. Topics include: cellular architecture, energetics, and growth; evolution and gene flow; population and community dynamics; water and soil microbiology; biogeochemical cycling; and microorganisms in biodeterioration and bioremediation.","prereq":"7.014","label":"1.89 - Environmental Microbiology","type":"Class","units":"3-0-9","in-charge":"Polz, M. F.","offering":"Currently Offered","id":"1.89","category":"H-LEVEL Grad Credit","area":"Aquatic Sciences, Water Quality Control, and Environmental Management","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.89","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Graduate subjects taught experimentally; special subjects offered by visiting faculty; and seminars on topics of current interest.","label":"1.961?1.966 - Special Graduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","in-charge":"Office, Consult Department Academic Programs","offering":["Can be repeated for credit","Currently Offered"],"id":"1.961?1.966","category":"H-LEVEL Grad Credit","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.961?1.966","total-units":"Unknown"},{"lecture-section-of":"1.961?1.966","timeAndPlace":["TR 13:00-14:30 48-308"],"type":"LectureSection","label":"s1.961?1.966-1"},{"lecture-section-of":"1.961?1.966","timeAndPlace":["TR 14:30-16:00 1-375"],"type":"LectureSection","label":"s1.961?1.966-2"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.968 - Graduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.968","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.968","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.969 - Graduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.969","category":"H-LEVEL Grad Credit","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.969","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"No description available.","label":"1.970?1.977 - Special Graduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.970?1.977","category":"H-LEVEL Grad Credit","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.970?1.977","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"No description available.","label":"1.978?1.979 - Special Graduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.978?1.979","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.978?1.979","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"No description available.","label":"1.982 - Research in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.982","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.982","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"No description available.","label":"1.983 - Teaching in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.983","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.983","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"No description available.","label":"1.984 - Teaching Experience in Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.984","category":"H-LEVEL Grad Credit","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.984","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring"],"description":"No description available.","label":"1.991, 1.992 - Special Undergraduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.991, 1.992","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.991, 1.992","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"No description available.","label":"1.993?1.995 - Special Undergraduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.993?1.995","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.993?1.995","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.999 - Undergraduate Studies in Civil and Environmental Engineering","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.999","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.999","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring"],"description":"Provides engineering students, typically sophomores, the opportunity to participate in engineering practice.  Students gain experience with recruitment and job selection, the job experience, and the assessment and reflection process. Spring term includes seminars and workshops in preparation for internship and management of career path.  With the assistance of UPOP staff, students find and engage in a 10-12 week summer job experience, during which they maintain a journal of their experiences.  In the Fall term, students write essays addressing the topics introduced in UPOP EPW workshop during IAP, complete a post-summer self-evaluation form, and discuss these forms with their regular academic advisor. Students have the opportunity to share their experiences with others in a roundtable discussion.  Can be taken up to two times for credit. Spring term can only be taken in conjunction with the Fall term.","prereq":["1.EPE","2.EPE","3.EPE","10.EPE","16.EPE","22.EPE","2.EPW"],"label":"1.EPE - UPOP Summer Practice Experience","type":"Class","units":"0-1-0 [P/D/F]","in-charge":"Yue, D. K. P.","offering":["Can be repeated for credit","Currently Offered"],"id":"1.EPE","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.EPE","total-units":"Unknown"},{"has-final":false,"semester":"Fall","description":"Provides engineering sophomores the opportunity to reflect and share their summer practice experiences as related to the topics of the IAP subject and students\' academic subjects through a written report and an oral presentation delivered at a UPOP Symposium in the fall.","prereq":["1.EPR","2.EPR","3.EPR","10.EPR","16.EPR","22.EPR","2.EPE"],"label":"1.EPR - UPOP Reflective Learning Experience","type":"Class","units":"0-0-3 [P/D/F]","in-charge":"Yue, D. K. P.","offering":"Currently Offered","id":"1.EPR","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.EPR","total-units":"Unknown"},{"has-final":false,"semester":"IAP","description":"Provides engineering sophomores the opportunity to build the core foundation of skills necessary to succeed in and prepare for a summer practice experience. Introduces concepts in product development, system dynamics, organizational dynamics, and effective communication. Also introduces concepts in ethics and character, and leadership and teamwork to ensure that students acquire an appreciation of the social, environmental, and ethical implications of organizational decision making. Subject is an interactive experience integrating lectures with role-playing, simulations, and group projects, where students apply these concepts in a case study context. Students are provided with a journal to be used during their summer training practice. Limited enrollment.","prereq":["1.EPW","2.EPW","3.EPW","6.EPW","10.EPW","16.EPW","22.EPW"],"label":"1.EPW - UPOP IAP Workshop","type":"Class","units":"3-0-0 [P/D/F]","in-charge":"Yue, D. K. P.","offering":"Currently Offered","id":"1.EPW","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.EPW","total-units":"Unknown"},{"has-final":false,"semester":["Fall","Spring","Summer"],"description":"No description available.","label":"1.ThG - Graduate Thesis","type":"Class","units":"Unknown","offering":["Can be repeated for credit","Currently Offered"],"id":"1.ThG","category":"H-LEVEL Grad Credit","area":"Special Studies","level":"Grad","url":"http://student.mit.edu/catalog/m1c.html#1.ThG","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"Program of research leading to the writing of an S.B. thesis; to be arranged by the student and an appropriate MIT faculty member.  Intended for seniors. Student must submit an approved thesis proposal to the Academic Programs Office by the fifth week of the first term the student is registered for thesis.","label":"1.ThU - Undergraduate Thesis","type":"Class","units":"Unknown","in-charge":"Office, Consult Department Academic Programs","offering":["Can be repeated for credit","Currently Offered"],"id":"1.ThU","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.ThU","total-units":"Unknown"},{"has-final":false,"semester":["Fall","IAP","Spring","Summer","Fall","IAP","Spring","Summer"],"description":"Individual research or laboratory study under faculty supervision. Also opportunities in ongoing research program.","label":"1.UR - Research in Civil and Environmental Engineering","type":"Class","units":"Unknown","in-charge":"Office, Consult Department Academic Programs","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"1.UR","area":"Special Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m1c.html#1.UR","total-units":"Unknown"}]}