{"items":[{"has-final":false,"semester":"Fall","description":"Systematic examination of selected issues in political philosophy. Topic changes each year and subject may be taken repeatedly with permission of instructor.","prereq":"24.611J","label":"17.000J - Political Philosophy","type":"Class","course":"17","units":"3-0-9","in-charge":"Mehta, U.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.000J","category":"H-LEVEL Grad Credit","area":"Political Philosophy/Social Theory","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.000J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Analyzes theories of gender and politics, especially ideologies of gender and their construction; definitions of public and private spheres; gender issues in citizenship, the development of the welfare state, experiences of war and revolution, class formation, and the politics of sexuality. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.007J","24.237","SP.601J","SP.601J","17.006","24.237"],"label":"17.006 - Feminist Political Thought","type":"Class","course":"17","units":"3-0-9","in-charge":"Wood, E.","offering":"Currently Offered","id":"17.006","category":["H-LEVEL Grad Credit","HASS Elective"],"area":"Political Philosophy/Social Theory","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.006","total-units":"12.0"},{"lecture-section-of":"17.006","timeAndPlace":"W 13:00-16:00 56-191","type":"LectureSection","label":"L17.006-1"},{"lecture-section-of":"17.006","timeAndPlace":"W 13:00-16:00 56-191","type":"LectureSection","label":"L17.006-2"},{"has-final":false,"semester":"Spring","description":"An examination of alternative theories of justice\u0014utilitarianism, rights theories, social contract theory, and communitarianism\u0014and the implications of those theories for problems of liberty, equality, and community. Readings drawn principally from the work of contemporary political philosophers, including Rawls, Nozick, Dworkin, Walzer, MacIntyre, and Buchanan.","prereq":"24.04J","label":"17.01J - Justice","type":"Class","course":"17","units":"3-0-9","in-charge":"Mehta, U.","offering":"Currently Offered","id":"17.01J","category":["HASS-D 2","HASS Communication-Intensive"],"area":"Political Philosophy/Social Theory","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.01J","total-units":"12.0"},{"lecture-section-of":"17.01J","timeAndPlace":"T 11:00-13:00 32-155","type":"LectureSection","label":"L17.01J-1"},{"rec-section-of":"17.01J","timeAndPlace":"R 14:00-15:00 56-167","type":"RecitationSection","label":"R17.01J-2"},{"rec-section-of":"17.01J","timeAndPlace":"F 10:00-11:00 56-167","type":"RecitationSection","label":"R17.01J-3"},{"rec-section-of":"17.01J","timeAndPlace":"F 12:00-13:00 56-180","type":"RecitationSection","label":"R17.01J-4"},{"has-final":false,"semester":"Spring","description":"Examination of fundamental issues in philosophy of law, such as the nature and limits of law and a legal system, and the relation of law to morality, with particular emphasis on the philosophical issues and problems associated with privacy, liberty, justice, punishment, and responsibility. Historical and contemporary readings, including court cases. Permission of instructor required for students without the above prerequisite.","prereq":"24.235J","label":"17.021J - Philosophy of Law","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.021J","category":"HASS Elective","area":"Political Philosophy/Social Theory","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.021J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Examines major texts in the history of political thought and considers how they contribute to a broader conversation about freedom, equality, democracy, rights, and the role of politics in human life. Philosophers include Plato, Aristotle, Machiavelli, Hobbes, Locke, Rousseau, Marx, Tocqueville, and Mill.","label":"17.03 - Introduction to Political Thought","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.03","category":"HASS Elective","area":"Political Philosophy/Social Theory","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.03","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Using examples from anthropology and sociology alongside classical and contemporary social theory, subject explores the nature of dominant and subordinate relationships, types of legitimate authority, and practices of resistance.  Examines how we are influenced in subtle ways by the people around us, who makes controlling decisions in the family, how people get ahead at work, and whether democracies, in fact, reflect the will of the people.","prereq":"21A.245J","label":"17.045J - Power: Interpersonal, Organizational and Global Dimensions","type":"Class","course":"17","units":"3-0-9","in-charge":"Silbey, S.","offering":"Not offered this year","id":"17.045J","category":"HASS Elective","area":"Political Philosophy/Social Theory","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.045J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides an introduction to the politics of international economic relations. Government decision-making in areas such as trade policy, exchange rates, and financial flows are influenced not only by economic factors, but also by political processes within and among countries. Overview of a number of analytical ?lenses? to view the global economy. Examines the politics of trade policy, international monetary and financial relations, foreign direct investment, third-world development and transition economies, and the debate over \"globalization.\"","label":"17.10 - International Political Economy","type":"Class","course":"17","units":"3-0-9","in-charge":"Singer, D.","offering":"Not offered this year","id":"17.10","category":"HASS Elective","area":"Political Economy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.10","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Critical analysis of liberal, neoclassical, and Marxist perspectives on modern society. Alternative theories of economic growth, historical change, the state, classes, and ideology.","prereq":["14.781J","15.678J"],"label":"17.100J - Political Economy I: Theories of the State and the Economy","type":"Class","course":"17","units":"3-0-9","in-charge":["Piore, M.","Berger, S."],"offering":"Currently Offered","id":"17.100J","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.100J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Explore effects of globalization of finance on international relations and domestic politics. Topics include international institutions and global governance; the multi-nationalization of production; effects of international capital markets on domestic politics; global finance and the developing world; and financial crises. Discussion of the interplay between politics and economics and the future of the nation-state.","label":"17.125 - The Politics of Global Financial Relations","type":"Class","course":"17","units":"3-0-9","in-charge":"Singer, D.","offering":"Currently Offered","id":"17.125","category":"HASS Elective","area":"Political Economy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.125","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Analyzes the impact of trade and financial flows and regional integration on the domestic politics of advanced industrial states. Pressures for harmonization and convergence of domestic institutions and practices and the sources of national resistance to these are examined. Cases are drawn from both the advanced economies and developing countries.","label":"17.148 - Political Economy of Globalization","type":"Class","course":"17","units":"3-0-9","in-charge":"Berger, S.","offering":"Not offered this year","id":"17.148","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.148","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines role of European states in postwar period of rapid economic growth and current crisis. Includes analysis of different state traditions (\"etatist,\" liberal, authoritarian); government\'s role in decline of some economies and rise of others; why and where Keynesianism, indicative planning, and state enterprises were introduced; alternative conceptions of contemporary economic problems (new international division of labor, too few producers, oil shock); and of policies to deal with them (industrial policy, monetarism, protectionism).","label":"17.158 - Political Economy of West Europe","type":"Class","course":"17","units":"3-0-9","in-charge":"Berger, S.","offering":"Not offered this year","id":"17.158","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.158","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Explores the impact of political institutions on economic outcomes. In addition to the distinction between authoritarianism and democracy, some of the democratic institutions under consideration include parliamentary and presidential democracy, federal and unitary systems, and electoral rules. Explores economic outcomes including protectionism and free trade, budget deficits and public debt, electoral macroeconomic and budgetary cycles, the size of the aggregate public sector, and rates of economic growth.","label":"17.160 - The Political Economy of Institutions","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.160","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.160","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"The vertical distribution of governmental authority is rapidly changing around the world. Power and revenue are shifting downward (to state and local governments) and upward (to supra-national bodies like the European Union). Theory and evidence are used to explore the causes and consequences of these trends. Starts with abstract, normative economic theories of federalism and decentralization and then covers politics and institutions. Approach allows students to address several questions about the vertical organization of the public sector: What is the ideal distribution of governmental authority?  How can we explain the actual distribution? What are the welfare consequences of different alternatives? Open to advanced undergraduates with permission of instructor.","label":"17.162 - Federalism and Decentralization","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.162","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.162","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Analyzes the theoretical and historical reasons why governments in latecomer countries have intervened with a wide array of policies to foster industrial development at various turning points: the initiation of industrial activity; the diversification of the industrial base; the restructuring of major industrial institutions; and the entry into high-technology sectors.","prereq":["11.491J","11.701"],"label":"17.176J - Economic Development and Policy Analysis I","type":"Class","course":"17","units":"3-0-9","in-charge":"Amsden, A.","offering":"Currently Offered","id":"17.176J","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.176J","total-units":"12.0"},{"lecture-section-of":"17.176J","timeAndPlace":"M 14:00-17:00 10-401","type":"LectureSection","label":"L17.176J-1"},{"has-final":false,"semester":["Spring","Spring"],"description":"Examines alternative conceptions and theoretical underpinnings of the notion of sustainable development. Focuses on the sustainability problems of industrial countries (aging of populations, sustainable consumption, institutional adjustments); and of developing states and economies in transition (managing growth, sustainability of production patterns, pressures of population change). Explores the sociology of knowledge around sustainability, the economic and technological dimensions and institutional imperatives. Implications for political constitution of economic performance. 17.181 fulfills undergraduate public policy requirement in the major and minor. Graduate students are expected to explore the subject in greater depth through reading and individual research.","prereq":["17.182","17.181"],"label":"17.181 - Sustainable Development: Theory, Research and Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":"Currently Offered","id":"17.181","category":"HASS Elective","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.181","total-units":"12.0"},{"lecture-section-of":"17.181","timeAndPlace":"T 13:00-15:00 E51-385","type":"LectureSection","label":"L17.181-1"},{"lecture-section-of":"17.181","timeAndPlace":"T 13:00-15:00 E51-385","type":"LectureSection","label":"L17.181-2"},{"has-final":false,"semester":"Spring","description":"Considers how institutions have been incorporated theoretically into explorations of growth and development. Four sets of institutions are examined in detail: the corporate sector, to study how ownership, strategy, and structure affect growth-related policies; financial institutions, to analyze how they condition savings and investment; labor market institutions, to investigate their impact on the determination of wage and production-related productivity; and the institutions associated with technology, such as universities, research laboratories, and corporate training centers, to consider how skill formulation is accomplished.","prereq":["11.486J","14.778J","11.203"],"label":"17.184J - Economic Institutions and Growth Policy Analysis","type":"Class","course":"17","units":"3-0-6","in-charge":["Amsden, A.","Piore, M."],"offering":"Currently Offered","id":"17.184J","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.184J","total-units":"9.0"},{"lecture-section-of":"17.184J","timeAndPlace":"M 9:00-12:00 10-401","type":"LectureSection","label":"L17.184J-1"},{"has-final":false,"semester":"Fall","description":"Examines issues facing labor in today\'s global world through research and reading. Recent developments (globalization, liberalization, privatization) have created a mix of opportunities and risks for labor in most developing countries. On the one hand, these trends have encouraged foreign direct investment and the diffusion of global supply chains, which in turn, have promoted economic development and job growth for some groups of workers in some of these countries. On the other hand, globalization and liberalization have undermined social safety nets, eroded labor and environmental standards, and resulted in greater rates of poverty for other groups of workers in other developing countries. How do we explain these differences? What kinds of policies can be promoted to more evenly distribute the benefits of globalization? Subject seeks to address these two questions.","prereq":"11.414J","label":"17.188J - Labor and Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Locke, R.","offering":"Not offered this year","id":"17.188J","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.188J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Analyzes economic development in \"the remainder,\" or in countries that largely failed to enter the orbit of modern world industry since the end of World War II. Looks at the reasons for falling behind in terms of history, geography/global transactions, institutions (including business enterprises), policies and knowledge-based assets. Explores potential policies for accelerating the process of industrial transformation and the control mechanism necessary to improve government planning.","prereq":["11.492J","11.491J"],"label":"17.190J - Economic Development and Policy Analysis, Part II","type":"Class","course":"17","units":"3-0-9","in-charge":"Amsden, A.","offering":"Currently Offered","id":"17.190J","category":"H-LEVEL Grad Credit","area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.190J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Fall"],"description":"Analyzes changes in the international economy and their effects in the politics, economy, and society of advanced and emerging countries. Topics include the independence of national governments; wage inequality; unemployment; industrial production outside national borders and its consequences for innovation, efficiency, and jobs; fairness in trade; and mass culture versus local values. 17.195 fulfills undergraduate public policy requirement in the major and minor. Graduate students are expected to explore the subject in greater depth.","prereq":["17.196","17.195"],"label":"17.195 - Globalization","type":"Class","course":"17","units":"3-0-9","in-charge":"Berger, S.","offering":"Currently Offered","id":"17.195","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Political Economy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.195","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"For students who have already experienced work and research in today\'s global economy. Offers an introduction to core concepts used to understand developments and interdependencies in the new global economy through a combination of conceptual approaches and practical case studies. Combines a broad range of interactive classroom experiences including student presentations and guest speakers from business and academia with first-hand knowledge of how the global economy operates. Explores issues such as global entrepreneurship, the rise of global challengers like India and China, and crosscultural communication in multinational organizations. Enrollment limited.","prereq":"21F.098J","label":"17.199J - Working in a Global Economy","type":"Class","course":"17","units":"3-0-9","in-charge":["Berger, S.","Sferza, S."],"offering":"Currently Offered","id":"17.199J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Political Economy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.199J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Spring"],"description":"Studies American government, emphasizing the institutions of government and the representation of competing interests. Topics include the founding, constitutional interpretation, legislative processes, presidential power, public opinion and voting, group mobilization, political steering of the bureaucracy and the economy, and federalism.","label":"17.20 - Introduction to the American Political Process","type":"Class","course":"17","units":"3-0-9","in-charge":"Ansolabehere, S.","offering":"Currently Offered","id":"17.20","category":["HASS-D 4","HASS Communication-Intensive"],"area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.20","total-units":"12.0"},{"lecture-section-of":"17.20","timeAndPlace":"MW 12:00-13:00 1-390","type":"LectureSection","label":"L17.20-1"},{"has-final":false,"semester":"Fall","description":"Analyzes the American political system, with primary emphasis on the national level. Examines American federalism, voting behavior, political parties, and national political institutions. Focuses on core works in contemporary American politics and public policy. Critiques both research methodologies and the explicit and implicit theoretical assumptions of such work.","label":"17.200 - Graduate Seminar in American Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Berinsky, A.","offering":"Currently Offered","id":"17.200","category":"H-LEVEL Grad Credit","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.200","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"The mass media are crucial players in modern democratic government, but most people have only a fuzzy understanding of their role and influence. Subject examines why the media cover what they do; how their coverage influences the behavior of politicians and public officials; and how it shapes the attitudes of ordinary people. Focuses mainly on the US, but also includes some comparisons with other countries in both the developed and developing world.","label":"17.243 - Media Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lenz, G.","offering":"Not offered this year","id":"17.243","category":"HASS Elective","area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.243","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"The mass media are crucial players in modern democratic government, but most people have only a fuzzy understanding of their role and influence. Subject examines why the media cover what they do; how their coverage influences the behavior of politicians and public officials; and how it shapes the attitudes of ordinary people. Focuses mainly on the US, but also includes some comparisons with other countries in both the developed and developing world.","label":"17.244 - Media Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lenz, G.","offering":"Not offered this year","id":"17.244","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.244","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Considers constitutional rights, processes, civil rights and liberties, and criminal procedure. Focus on Supreme Court case law. Enrollment limited.","label":"17.245 - The Supreme Court, Civil Liberties, and Civil Rights","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.245","category":"HASS Elective","area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.245","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Studies legal reasoning, types of law and legal systems, and relationship of law to social class and social change. Emphasis on the profession and practice of law including legal education, stratification within the bar, and the politics of legal services. Investigation of emerging issues in the relationship between institutions of law and science. Enrollment limited.","prereq":["11.163J","21A.219J"],"label":"17.249J - Law and Society","type":"Class","course":"17","units":"3-0-9","in-charge":"Silbey, S.","offering":"Not offered this year","id":"17.249J","category":["HASS Elective","HASS Communication-Intensive"],"area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.249J","total-units":"12.0"},{"has-final":false,"semester":["Fall","Fall"],"description":"Focuses on both the internal processes of the House and Senate and on the place of Congress in the American political system. Attention to committee behavior, leadership patterns, and informal organization. Considers relations between Congress and other branches of government, as well as relations between the two houses of Congress itself. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.252","17.20","17.251"],"label":"17.251 - Congress and the American Political System I","type":"Class","course":"17","units":"3-0-9","in-charge":"Stewart, C.","offering":["Not offered next year","Not offered next year","Currently Offered"],"id":"17.251","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.251","total-units":"12.0"},{"has-final":false,"semester":["Fall","Fall"],"description":"Analysis of contemporary and historical issues in US political economy, with special emphasis on public finance and economic regulation. Selected topics in trade and tax policy, agricultural, transport, labor, and environmental regulations, and local public finance treated in some detail. Focuses primarily on the neoclassical/rational-choice approach; strengths and weaknesses of this approach are discussed. Where necessary, devotes time to developing tools used in rigorous microeconomic analysis. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.254","17.20","17.253","17.20"],"label":"17.253 - American Political Economy","type":"Class","course":"17","units":"3-0-9","in-charge":["Snyder, J. M.","Jr."],"offering":["Not offered this year","Not offered this year"],"id":"17.253","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.253","total-units":"12.0"},{"has-final":false,"semester":["Fall","Fall"],"description":"Analyzes the development of the United States Congress by focusing on the competing theoretical lenses through which legislatures have been studied. Particularly compares sociological and economic models of legislative behavior, applying those models to floor decision-making, committee behavior, political parties, relations with other branches of the Federal government, and elections. Graduate students expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.262","17.251","17.261"],"label":"17.261 - Congress and the American Political System II","type":"Class","course":"17","units":"3-0-9","in-charge":"Stewart, C.","offering":["Not offered this year","Not offered this year"],"id":"17.261","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.261","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Considers the role of elections in American politics. Issues explored include empirical and theoretical models of electoral competition, the effect of elections on public policy, and proposals to improve elections.  Special emphasis is given to mass voting behavior, political parties, the media, and campaign finance. Subject focuses on US elections, but provides some contrasts with other countries, especially the United Kingdom.","prereq":"17.20","label":"17.263 - Electoral Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lenz, G.","offering":["Not offered next year","Currently Offered"],"id":"17.263","category":"HASS Elective","area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.263","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Analyzes elections in light of theories about voters, parties, and candidates. Topics include election laws and reforms, and the formation of governments. Focus is mainly on US elections, though other democracies are also examined. Familiarity with statistics recommended but not required. Open to qualified undergraduates.","prereq":"17.20","label":"17.264 - Electoral Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lenz, G.","offering":["Not offered next year","Currently Offered"],"id":"17.264","category":"H-LEVEL Grad Credit","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.264","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Introduces students to public opinion in politics and public policy-making. Surveys theories of political psychology and political behavior. Examines empirical research on public understanding of and attitudes towards important issues, including war, economic and social policies, and moral questions.","label":"17.265 - Public Opinion and American Democracy","type":"Class","course":"17","units":"3-0-9","in-charge":["Berinsky, A.","Campbell, A.","Ansolabehere, S."],"offering":"Not offered this year","id":"17.265","category":"HASS Elective","area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.265","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides an introduction to the scholarly literature devoted to public opinion. Surveys the major theoretical approaches and empirical research in the field of political behavior. Topics include mass-elite relations, racial politics, political ideology, public opinion and war, public opinion and public policy and media effects. Primarily focuses on American public opinion, though research on comparative public opinion is also covered.","label":"17.266 - Public Opinion","type":"Class","course":"17","units":"3-0-9","in-charge":"Berinsky, A. J.","offering":"Currently Offered","id":"17.266","category":"H-LEVEL Grad Credit","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.266","total-units":"12.0"},{"lecture-section-of":"17.266","timeAndPlace":"W 15:00-17:00 E51-390","type":"LectureSection","label":"L17.266-1"},{"has-final":false,"semester":"Fall","description":"Examines the dynamics of presidential elections: events preceding the primaries, the conduct of the general election itself, and the policy consequences of the electoral process. The class conducts a survey of votes. Topics include the players (candidates, voters, parties, consultants, the Electoral College), campaign resources (money, information, media attention), the major campaign events (primaries, conventions, general elections), and prospects for reform.","label":"17.269 - Presidential Elections","type":"Class","course":"17","units":"3-0-9","in-charge":"Ansolabehere, S.","offering":"Not offered this year","id":"17.269","category":"HASS Elective","area":"American Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.269","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Examines the evolution of American national political processes over time: how political culture, governing institutions, and structures of political linkage (parties and organized interests) shape political conflict and public policy. Topics include the evolution of electoral politics and the party system, eras of political reform and state expansion (Populist, Progressive, New Deal, and Great Society), major wars and their effects, and the adaptation of government institutions to crisis and complexity in society and in the economy. Open to undergraduates with permission of instructor.","label":"17.270 - American Political Development","type":"Class","course":"17","units":"3-0-9","in-charge":"Campbell, A","offering":["Not offered next year","Currently Offered"],"id":"17.270","category":"H-LEVEL Grad Credit","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.270","total-units":"12.0"},{"lecture-section-of":"17.270","timeAndPlace":"W 13:00-15:00 E51-390","type":"LectureSection","label":"L17.270-1"},{"has-final":false,"semester":"Fall","description":"Follows 17.266. Offers practical training in public opinion research and provides students with an opportunity to conduct their own survey research. As a group, students design a national sample survey and field the survey. Students analyze the survey results and examine literatures related to the content of the survey. Ideal for second and third year PhD students and advanced undergraduates, though others are welcome.","prereq":["17.872","17.266"],"label":"17.276 - Public Opinion Research Training Lab","type":"Class","course":"17","units":"3-0-9","in-charge":["Ansolabehere, S.","Berinsky, A.","Campbell, A."],"offering":"Currently Offered","id":"17.276","category":"H-LEVEL Grad Credit","area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.276","total-units":"12.0"},{"has-final":false,"semester":["Spring","Spring"],"description":"Examines the nature of public opinion on foreign policy, the ability of the public to formulate reasoned and interconnected perspectives on the issues of the day, and the public\'s influence on foreign policy decisions. Main focus is on the United States.  The role of the media and international events in shaping public perspectives and public attitudes toward important issues such as internationalism and isolationism, the use of force, and trade are evaluated. Students taking graduate version are expected to complete additional assignments.","prereq":["17.282","17.281"],"label":"17.281 - Public Opinion and Foreign Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Berinsky, A.","offering":["Not offered next year","Not offered next year","Currently Offered"],"id":"17.281","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"American Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.281","total-units":"12.0"},{"lecture-section-of":"17.281","timeAndPlace":"W 11:00-13:00 E51-393","type":"LectureSection","label":"L17.281-1"},{"rec-section-of":"17.281","timeAndPlace":"W 13:00-14:00 E51-393","type":"RecitationSection","label":"R17.281-2"},{"lecture-section-of":"17.281","timeAndPlace":"W 11:00-13:00 E51-393","type":"LectureSection","label":"L17.281-3"},{"has-final":false,"semester":"Fall","description":"Examines how the struggle among competing advocates shapes the outputs of government. Considers how conditions become problems for government to solve, why some political arguments are more persuasive than others, why some policy tools are preferred over others, and whether policies achieve their goals.  Investigates the interactions among elected officials, think tanks, interest groups, the media, and the public in controversies over global warming, urban sprawl, Social Security, health care, education, and other issues.","prereq":"11.002J","label":"17.30J - Making Public Policy","type":"Class","course":"17","units":"4-0-8","in-charge":["Layzer, J.","Staff"],"offering":"Currently Offered","id":"17.30J","category":["HASS-D 4","HASS Communication-Intensive"],"area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.30J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides students with an introduction to public policy analysis. Examines various approaches to policy analysis by considering the concepts, tools, and methods used in economics, political science, and other disciplines. Students apply and critique these approaches through case studies of current public policy problems.","prereq":["11.003J","11.002J","17.30J"],"label":"17.303J - Methods of Policy Analysis","type":"Class","course":"17","units":"3-0-9","in-charge":["Schuster, J. M.","Staff"],"offering":"Currently Offered","id":"17.303J","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.303J","total-units":"12.0"},{"lecture-section-of":"17.303J","timeAndPlace":"TR 11:00-12:30 5-231","type":"LectureSection","label":"L17.303J-1"},{"has-final":false,"semester":["Fall","Spring"],"description":"Examines US policy-making process, with special attention to making of policy for science and technology. Subject spans Spring and Fall terms. Spring term attends to origins and development of American policymaking institutions and their roles in settling controversial policy questions. Fall term focuses on development of representative policies in the US, such as pollution controls, biotechnical engineering, and telecommunications. Selection and participation in Washington Summer Internship program required. Fulfills undergraduate public policy requirement in the major and minor.","label":"17.307 - American Public Policy for Washington Interns","type":"Class","course":"17","units":"3-0-9","in-charge":"Stewart, C.","offering":"Currently Offered","id":"17.307","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.307","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Analysis of issues at the intersection of science, technology, public policy, and business. Cases drawn from antitrust and intellectual property rights; health and environmental policy; defense procurement and strategy; strategic trade and industrial policy; and R&D funding. Structured around theories of political economy, modified to take account of integration of uncertain technical information into public and private decision-making. Enrollment limited to 18.","prereq":"STS.082J","label":"17.31J - Science, Technology, and Public Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Oye, K.","offering":"Currently Offered","id":"17.31J","category":["HASS Elective","HASS Communication-Intensive"],"area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.31J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Analysis of issues at the intersection of science, technology, public policy, and business.  Cases drawn from antitrust and intellectual property rights; health and environmental policy; defense procurement and strategy; strategic trade and industrial policy; and R&D funding. Structured around theories of political economy, modified to take account of integration of uncertain technical information into public and private decision-making.","prereq":["ESD.103J","STS.482J"],"label":"17.310J - Science, Technology, and Public Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Oye, K.","offering":"Currently Offered","id":"17.310J","category":"H-LEVEL Grad Credit","area":"Public Policy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.310J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Comparatively examines the historical and contemporary role of science in constructing knowledge about human differences and similarities in terms of race. Particular attention is paid to the social and political context of scientific inquiry and to its consequences for public policy. Topics include US \"Jim Crow\" segregation policy, US immigration policy, the US eugenics movement, and the international Human Genome Project.","label":"17.311 - Politics, Race, and Science","type":"Class","course":"17","units":"3-0-9","in-charge":"Nobles, M.","offering":"Not offered this year","id":"17.311","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.311","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Team-taught subject for doctoral students working on emerging technologies at the interface of technology, policy and societal issues. Integrates concepts of research strategy and design from a variety of disciplines. Addresses problem identification and formulation of research topics, the role of qualitative and quantitative research methods, and the use of various data collection techniques. Focuses on students\' thesis proposals, faculty-student study panels, critical evaluation of research design, and ethical issues in conducting research and gathering data.","prereq":["ESD.85J","STS.461J"],"label":"17.312J - Integrating Doctoral Seminar on Emerging Technologies","type":"Class","course":"17","units":"2-0-7","in-charge":"Oye, K.","offering":"Currently Offered","id":"17.312J","category":"H-LEVEL Grad Credit","area":"Public Policy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.312J","total-units":"9.0"},{"lecture-section-of":"17.312J","timeAndPlace":"W 15:00-17:00 E51-393","type":"LectureSection","label":"L17.312J-1"},{"has-final":false,"semester":"Spring","description":"Examines the way in which workers organize to structure and regulate the labor market and how those efforts interact with (as cause and effect) career mobility. Particular focus on the contrast between union organization and government regulation and on the shift from mobilization around class to mobilization around race, sex and ethnicity.  Contrast between unified systems of regulation (France, Spain, Latin America) and fragmented systems (United States).","prereq":"14.665J","label":"17.314J - Labor Market Regulation and Career Mobility","type":"Class","course":"17","units":"3-0-9","in-charge":"Piore, M.","offering":"Currently Offered","id":"17.314J","category":"H-LEVEL Grad Credit","area":"Public Policy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.314J","total-units":"12.0"},{"lecture-section-of":"17.314J","timeAndPlace":"M 17:00-19:00 E52-398","type":"LectureSection","label":"L17.314J-1"},{"has-final":false,"semester":"Fall","description":"Analyzes the health policy problems facing America including adequate access to care, the control of health care costs, and the encouragement of medical advances. Considers market and regulatory alternatives as well as international models including Canadian, Swedish, British, and German arrangements. Emphasis on historical development, interest group behavior, public opinion, and organizational influences in shaping and implementing policy.","label":"17.315 - Health Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Campbell, A.","offering":["Not offered next year","Currently Offered"],"id":"17.315","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.315","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Explores historical development and contemporary politics of the American welfare state. Examines interactions among political institutions, elites, the media, and the mass public. Emphasis on reciprocal relationship between policy designs and public opinion/political action. Investigates broad spectrum of government policies that shape well-being, opportunity and political influence, including welfare, social security, health care, education, and tax policy.","label":"17.317 - U. S. Social Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Campbell, A.","offering":"Currently Offered","id":"17.317","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.317","total-units":"12.0"},{"lecture-section-of":"17.317","timeAndPlace":"MW 9:30-11:00 4-253","type":"LectureSection","label":"L17.317-1"},{"has-final":false,"semester":"Spring","description":"Examines the collision of politics, economics, values, and science in making and carrying out environmental policy at national, state, and local levels. Case studies of environmental policymaking explore the roles of governmental institutions, business, interest groups, the public, and the media in areas of air and water pollution, hazardous waste disposal, public lands management, and wildlife protection.","label":"17.32 - Environmental Politics and Policy","type":"Class","course":"17","units":"4-0-8","in-charge":"Staff","offering":"Not offered this year","id":"17.32","category":["HASS-D 4","HASS Communication-Intensive"],"area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.32","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Provides a rigorous and critical introduction to the foundation, structure and operation of the international human rights movement. Focuses on current debates in human rights including democracy promotion, economic and social rights in development and globalization, gender and race discrimination, religion, use of military force and humanitarian intervention, terrorism, and ethical issues in science and technology.","prereq":["11.164J","11.497"],"label":"17.391J - Human Rights in Theory and Practice","type":"Class","course":"17","units":"3-0-9","in-charge":"Rajagopal, B.","offering":"Currently Offered","id":"17.391J","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.391J","total-units":"12.0"},{"has-final":false,"semester":"Fall","description":"Introduction to important issues in contemporary environmental law, policy, and economics. Discusses the roles and interactions of Congress, federal agencies, state governments, and the courts in dealing with environmental problems. Topics include common law, administrative law, environmental impact assessments required by the National Environmental Policy Act, and legislation and court decisions dealing with air pollution, water pollution, the control of hazardous waste, pollution and accident prevention, community right-to-know, and environmental justice. Explores the role of science and economics in legal decisions, and economic incentives as an alternative or supplement to regulation. Analyzes pollution as an economic problem and a failure of markets. Introduction to basic legal skills: how to read and understand cases, regulation, and statutes; how to discover the current state of the law in a specific area; and how to take action toward resolution of environmental problems.","prereq":["1.801J","11.021J","1.811J","11.630J","ESD.133J"],"label":"17.393J - Environmental Law, Policy, and Economics: Pollution Prevention and Control","type":"Class","course":"17","units":"3-0-9","in-charge":["Ashford, N.","Caldart, C."],"offering":"Currently Offered","id":"17.393J","category":"HASS Elective","area":"Public Policy","level":"Undergrad","url":"http://student.mit.edu/catalog/m17a.html#17.393J","total-units":"12.0"},{"has-final":false,"semester":"Spring","description":"Focuses on a wide range of current energy and energy-related environmental policies that foster the development and mass deployment of sustainable energy technologies, fuels, and practices. Primary focus is US-based policies at the state, regional and federal level that impact the electricity, transportation and buildings and facilities sectors. Detailed case studies, diverse readings, and guest lectures by prominent policy makers and practitioners.","prereq":"11.369J","label":"17.398J - Energy Policy for a Sustainable Future","type":"Class","course":"17","units":"3-0-9","in-charge":"Raab, J. D.","offering":"Currently Offered","id":"17.398J","category":"H-LEVEL Grad Credit","area":"Public Policy","level":"Grad","url":"http://student.mit.edu/catalog/m17a.html#17.398J","total-units":"12.0"},{"lecture-section-of":"17.398J","timeAndPlace":"MW 9:00-10:30 4-153","type":"LectureSection","label":"L17.398J-1"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Reasons for America\'s past wars and interventions. Consequences of American policies. Evaluation of these consequences for the US and the world. History covered includes World Wars I and II, the Korean and Indochina wars, and the Cuban Missile Crisis and current conflicts such as against al Qaeda.","label":"17.40 - American Foreign Policy: Past, Present, and Future","type":"Class","course":"17","units":"3-0-9","in-charge":"Evera, S. Van","offering":"Currently Offered","id":"17.40","category":["HASS-D 4","HASS Communication-Intensive"],"area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.40","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":["Fall","Fall"],"description":"Focuses on evolution of contemporary politics and economics. Subject divided into five parts: historical context of conflicts; domestic and regional politics; civil and cross-border conflicts; geostrategic challenges; conflict resolution and peace processes. Interactions and spillover effects explored, and alternative models of conflict(s) designed. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.406","17.405"],"label":"17.405 - Seminar on Politics and Conflicts in the Middle East","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":"Currently Offered","id":"17.405","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.405","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":["Fall","Fall"],"description":"Introduces the international relations of the People?s Republic of China. China?s foreign relations during the Cold War as well as contemporary diplomatic, security and economic issues are examined to identify and explain China?s foreign policy goals and their implementation since 1949. Investigates the sources of conflict and cooperation in China?s behavior, assessing competing explanations for key events and policies. Readings drawn from political science, history, and international relations theory.","prereq":["17.408","17.407"],"label":"17.407 - Chinese Foreign Policy","type":"Class","course":"17","units":"3-0-9","in-charge":"Fravel, M. T.","offering":["Not offered this year","Not offered this year"],"id":"17.407","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.407","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":["Spring","Spring"],"description":"Tracing the evolution of international interactions, subject examines the dimensions of globalization in terms of scale and scope. Includes international environmental issues, impacts and expansion of human activites, and the potential implications for global and national policy. Linkages among individuals, nation-states, transnational organizations and firms, international systems, and the global environment. Special focus on models of globalization, challenges of sustainable development, and on evolving types. Institutional responses to globalization and global change. 17.411 fulfills undergraduate public policy requirement in the major and minor. Graduate students are expected to explore the subject in greater depth through reading and individual research.","prereq":["17.411","17.410"],"label":"17.410 - Globalization, Migration, and International Relations","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":["Not offered next year","Not offered next year","Currently Offered"],"id":"17.410","category":["H-LEVEL Grad Credit","HASS Elective"],"area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.410","total-units":"12.0"},{"lecture-section-of":"17.410","timeAndPlace":"M 13:00-15:00 E51-393","type":"LectureSection","label":"L17.410-1"},{"lecture-section-of":"17.410","timeAndPlace":"M 13:00-15:00 E51-393","type":"LectureSection","label":"L17.410-2"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Provides an overview of the field of international relations. Each week a different approach to explaining international relations is examined. Surveys major concepts and theories in the field to assist in the preparation for further study in the department\'s other graduate offerings in international relations.","label":"17.418 - Field Seminar in International Relations Theory","type":"Class","course":"17","units":"3-0-9","in-charge":"Fravel, M. T.","offering":"Currently Offered","id":"17.418","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.418","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Spring","description":"Examines the causes of war, with a focus on practical measures to prevent and control war. Topics include causes and consequences of misperception by nations; military strategy and policy as cause of war; religion and war; US foreign policy as a cause of war and peace; and the likelihood and possible nature of great wars in the future. Historical cases include World War I, World War II, the Korean War, the Seven Years\' War, the Arab-Israel conflict, other recent Mideast wars, and the Peloponnesian War.","label":"17.42 - Causes and Prevention of War","type":"Class","course":"17","units":"4-0-8","in-charge":"Evera, S. Van","offering":"Currently Offered","id":"17.42","category":["HASS-D 4","HASS Communication-Intensive"],"area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.42","total-units":"12.0"},{"lecture-section-of":"17.42","timeAndPlace":"MW 15:00-16:30 3-270","type":"LectureSection","label":"L17.42-1"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Critical analysis of contending theories of international relations. Focus is on alternative theoretical assumptions, different analytical structures, and a common core of concepts and content. Comparative analysis of realism(s), liberalism(s), institutionalism(s), and new emergent theories. Discussion of connections between theories of international relations and major changes in international relations. Open to undergraduates by permission of instructor.","label":"17.420 - Advances in International Relations Theory","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":"Not offered this year","id":"17.420","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.420","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Review of IPE field covering previous and core research focusing on dual national objectives in a global context, namely pursuit of power and pursuit of wealth. Surveys major paradigms of international political economy, including neoclassical economics,marxist economics, development and ecological economics, lateral pressure, and perspectives and structural views of power relations. Examines interaction of politics and economics on international trade, capital flows, foreign investment, intellectual property rights, international migration, and select issues in foreign economic policy in global context. Examines the evolution of international economic institutions and attendant political implications. Open to undergraduates by permission of instructor.","label":"17.422 - Field Seminar in International Political Economy","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":"Currently Offered","id":"17.422","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.422","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Provides an overview of international political economy with specific reference to the advanced industrial societies. Integrates international and comparative perspectives and fuses microeconomic and institutionalist approaches. Compares and contrasts the role of states in regulating intergroup conflicts over domestic markets with the role of regimes in regulating interstate conflicts over international markets. Examines the rise and decline of economic powers, industrial policy and trade relations, financial and monetary politics, and economic integration.","label":"17.424 - International Political Economy of Advanced Industrial Societies","type":"Class","course":"17","units":"3-0-9","in-charge":"Singer, D.","offering":"Currently Offered","id":"17.424","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.424","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Examines the causes and consequences of American foreign policy since 1898. Readings cover theories of American foreign policy, historiography of American foreign policy, central historical episodes including the two World Wars and the Cold War, case study methodology, and historical investigative methods. Open to undergraduates by permission of instructor.","label":"17.428 - American Foreign Policy: Theory and Method","type":"Class","course":"17","units":"3-0-9","in-charge":"Evera, S. Van","offering":"Currently Offered","id":"17.428","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.428","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Spring","description":"While this seminar provides an overview of recent literature, its principal purpose is to help graduate students develop skills suited to production of research papers and/or dissertations. Begins by reviewing general theoretical and methodological issues, then turns to specific empirical studies that examine the effects of systems structure, national attributes, bargaining processes, institutions, ideas, and norms on security affairs and political economy. The last two sessions of the seminar are devoted to evaluating research proposals generated by all members of the class.","label":"17.430 - Research Seminar in International Relations","type":"Class","course":"17","units":"3-0-9","in-charge":"Oye, K.","offering":"Currently Offered","id":"17.430","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.430","total-units":"12.0"},{"lecture-section-of":"17.430","timeAndPlace":"T 9:00-12:00 E51-390","type":"LectureSection","label":"L17.430-1"},{"subarea":"International Relations","has-final":false,"semester":"Fall","description":"Examines the causes of war. Major theories of war are examined; case study and large-n methods of testing theories of war are discussed; and the case study method is applied to several historical cases. Cases covered include World Wars I and II. Open to undergraduates only by permission of instructor.","label":"17.432 - Causes of War: Theory and Method","type":"Class","course":"17","units":"3-0-9","in-charge":"Evera, S. Van","offering":"Not offered this year","id":"17.432","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.432","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":["Spring","Spring"],"description":"Introduces and analyzes the international relations of East Asia. Examines the sources of conflict and cooperation during and after the Cold War, assessing competing explanations for key events in East Asia?s international relations. Readings drawn from international relations theory, political science and history.","prereq":["17.434","17.433"],"label":"17.433 - International Relations of East Asia","type":"Class","course":"17","units":"3-0-9","in-charge":"Fravel, M. T.","offering":["Not offered next year","Not offered next year","Currently Offered"],"id":"17.433","category":"HASS Elective","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.433","total-units":"12.0"},{"lecture-section-of":"17.433","timeAndPlace":"TR 15:00-16:30 8-205","type":"LectureSection","label":"L17.433-1"},{"lecture-section-of":"17.433","timeAndPlace":"TR 15:00-16:30 8-205","type":"LectureSection","label":"L17.433-2"},{"subarea":"International Relations","has-final":false,"semester":"Spring","description":"Examines why territorial conflicts arise in the first place, why some of these conflicts escalate to high levels of violence and why other territorial disputes reach settlement, thereby reducing a likely source of violence between states. Readings draw upon political geography and history as well as qualitative and quantitative approaches to political science.","label":"17.436 - Territorial Conflict","type":"Class","course":"17","units":"3-0-9","in-charge":"Fravel, M. T.","offering":"Not offered this year","id":"17.436","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.436","total-units":"12.0"},{"subarea":"International Relations","has-final":false,"semester":"Spring","description":"Research seminar explores the concept of governance at the international level, including the design and function of international institutions and organizations, the role of international law, the rise of transnational actors, and the relationship between domestic politics and international cooperation. Readings also include empirical studies of cooperation in a variety of issue areas, including the environment, human rights, economic affairs, and security.","label":"17.440 - Global Governance","type":"Class","course":"17","units":"3-0-9","in-charge":"Singer, D.","offering":"Currently Offered","id":"17.440","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.440","total-units":"12.0"},{"lecture-section-of":"17.440","timeAndPlace":"M 11:00-13:00 E51-063","type":"LectureSection","label":"L17.440-1"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Examines the politics affecting US defense policies since the end of the Second World War. Includes consideration of intra- and inter-service rivalries, civil-military relations, contractor influences, congressional oversight, homeland security policies and peace movements in historical and contemporary perspectives.","label":"17.460 - Defense Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.460","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.460","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Explores the origins, rate, and impact of innovations in military organizations, doctrine, and weapons. Emphasis on organization theory approaches. Comparisons with nonmilitary and non-US experience included.","label":"17.462 - Innovation in Military Organizations","type":"Class","course":"17","units":"3-0-9","in-charge":"Posen, B.","offering":"Not offered this year","id":"17.462","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.462","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Explores organizational concepts and research methods that explain the performance and development of military organizations in peace and war. Review of classic studies. Considers approaches to current policy problems based on theoretical insights into military organizations and practices. Stresses development of new theory.","label":"17.466 - Organization Theory and the Military","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.466","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.466","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Develops a working knowledge of the theories and conceptual frameworks that form the intellectual basis of security studies as an academic discipline. Particular emphasis on balance of power theory, organization theory, civil-military relations, and the relationship between war and politics. The reading list includes Jervis, Schelling, Waltz, Blainey, von Clausewitz, and Huntington. Students write a seminar paper in which theoretical insights are systematically applied to a current security issue.","label":"17.468 - Foundations of Security Studies","type":"Class","course":"17","units":"3-0-9","in-charge":"Posen, B.","offering":"Currently Offered","id":"17.468","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.468","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Examines the problems and issues confronting American national security policy since 1945, with special attention to the politics of policymaking. The nature of the international system (post-World War II), the theoretical requirements for deterrence and defense, and alternative strategies for implementing American national security policy are discussed. The roles of the President, National Security Council, Department of Defense and armed services, the Congress, and public opinion in formulating national security policy are examined. Subject fulfills undergraduate public policy requirement in the major and minor. Enrollment limited.","label":"17.471 - American National Security Policy","type":"Class","course":"17","units":"4-0-8","in-charge":"Staff","offering":"Not offered this year","id":"17.471","category":["HASS Elective","HASS Communication-Intensive"],"area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.471","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Fall"],"description":"Introduces the assessment of strategic nuclear forces. Emphasizes the development of force requirements and methods for analyzing alternative force postures in terms of missions, effectiveness, and cost. The history of the US-Soviet strategic competition provides the backdrop against which the evolution of nuclear strategy and forces is considered. Students taking graduate version are expected to complete additional assignments.","prereq":["STS.072J","17.476J","STS.435J","STS.435J","17.475J","STS.072J"],"label":"17.475J - Nuclear Forces and Missile Defenses","type":"Class","course":"17","units":"3-0-9","in-charge":"Postol, T.","offering":["Not offered next year","Not offered next year","Currently Offered"],"id":"17.475J","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.475J","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Examines in detail the technology of nuclear weapons systems. Topics include nuclear weapons design, effects, targeting, and delivery; ballistic and air breathing missile propulsion and guidance; communications and early warning techniques and systems; and anti-missile, air, and submarine systems. Combines the discussion of technical materials with the national security policy issues raised by the capabilities of these technologies. Considers security issues from the distinct and often conflicting perspectives of technologists, military planners, and political leaders. Subject fulfills the undergraduate public policy requirement in the Political Science major and minor.","prereq":"STS.076J","label":"17.477J - Technology and Policy of Weapons Systems","type":"Class","course":"17","units":"3-0-9","in-charge":"Postol, T.","offering":"Not offered this year","id":"17.477J","category":"HASS Elective","area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.477J","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Examines systematically, and comparatively, great and middle power military interventions, and candidate military interventions, into civil wars since 1991. These civil wars did not easily fit into the traditional category of vital interest. These interventions may therefore tell us something about broad trends in international politics including the nature of unipolarity, the erosion of sovereignty, the security implications of globalization, and the nature of modern western military power.","label":"17.478 - Great Power Military Intervention","type":"Class","course":"17","units":"3-0-9","in-charge":"Posen, B.","offering":"Not offered this year","id":"17.478","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.478","total-units":"12.0"},{"subarea":"Security Studies","has-final":true,"semester":["Spring","Spring"],"description":"Examines the evolving roles and missions of US General Purpose Forces within the context of modern technological capabilities and Grand Strategy, which is a conceptual system of interconnected political and military means and ends. Topics include US Grand Strategies; the organization of the US military; the defense budget; and the capabilities and limitations of naval, air, and ground forces. Also examines the utility of these forces for power projection and the problems of escalation. Analyzes military history and simple models of warfare to explore how variations in technology and battlefield conditions can drastically alter effectiveness of conventional forces.  17.483 fulfills undergraduate public policy requirement in the major and minor. Graduate students are expected to explore the subject in greater depth.","prereq":["17.483","17.482"],"label":"17.482 - US Military Power","type":"Class","course":"17","units":"3-0-9","in-charge":"Posen, B.","offering":"Currently Offered","id":"17.482","category":["H-LEVEL Grad Credit","HASS Elective"],"area":"International Relations/Security Studies","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.482","total-units":"12.0"},{"lecture-section-of":"17.482","timeAndPlace":"T 13:00-15:00 E25-117","type":"LectureSection","label":"L17.482-1"},{"lecture-section-of":"17.482","timeAndPlace":"T 13:00-15:00 E25-117","type":"LectureSection","label":"L17.482-2"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"A comparative study of the grand strategies and military doctrines of the great powers in Europe (Britain, France, Germany, and Russia) from the late 19th to the mid-20th century. Examines strategic developments in the years preceding and during World Wars I and II. What factors have exerted the greatest influence on national strategies? How may the quality of a grand strategy be judged? Exploration of comparative case study methodology also plays a central role. What consequences seem to follow from grand strategies of different types? Open to undergraduates with permission of instructor.","label":"17.484 - Comparative Grand Strategy and Military Doctrine","type":"Class","course":"17","units":"3-0-9","in-charge":"Posen, B.","offering":"Not offered this year","id":"17.484","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.484","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Explores Japan\'s role in world orders, past, present, and future. Focuses on Japanese conceptions of security; rearmament debates; the relationship of domestic politics to foreign policy; the impact of Japanese technological and economic transformation at home and abroad; alternative trade and security regimes; Japan\'s response to 9/11; and relations with Asian neighbors, Russia, and the alliance with the United States.","label":"17.486 - Japan and East Asian Security","type":"Class","course":"17","units":"3-0-9","in-charge":"Samuels, R. J.","offering":"Not offered this year","id":"17.486","category":"H-LEVEL Grad Credit","area":"International Relations/Security Studies","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.486","total-units":"12.0"},{"lecture-section-of":"17.486","timeAndPlace":"M 15:00-17:00 E51-063","type":"LectureSection","label":"L17.486-1"},{"subarea":"Security Studies","has-final":true,"semester":"Spring","description":"Examines why democracy emerges and survives in some countries rather than in others; how political institutions affect economic development; and how American politics compares to that of other countries. Reviews economic, cultural, and institutional explanations for political outcomes. Provides detailed examination of politics in the US, Germany, Italy, Mexico, and Iraq, with less detailed discussion of other countries in different regions of the world. Among other assignments, students write an original research paper on a topic in political science.","label":"17.50 - Introduction to Comparative Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":"Currently Offered","id":"17.50","category":["HASS-D 4","HASS Communication-Intensive"],"area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.50","total-units":"12.0"},{"lecture-section-of":"17.50","timeAndPlace":"TR 11:00-12:00 1-273","type":"LectureSection","label":"L17.50-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"No description available.","label":"17.504 - Ethnic Politics I","type":"Class","course":"17","units":"4-0-8","offering":"Not offered this year","id":"17.504","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.504","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Introduces students to the classic works on ethnic politics, familiarizes them with new research and methodological innovations in the study of ethnic politics, and helps them design and execute original research projects related to ethnic politics. Readings drawn from across disciplines, including political science, anthropology, sociology, and economics. Students read across the four subfields within political science. Graduate students specializing in any subfield are encouraged to take this subject, regardless of their previous empirical or theoretical background. Designed as a year-long research workshop, but may also be taken in either term.","label":"17.506 - Ethnic Politics II","type":"Class","course":"17","units":"4-0-8","in-charge":"Petersen, R.","offering":"Not offered this year","id":"17.506","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.506","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Spring","Spring"],"description":"Examines the dynamics of regime change, both transitions to democracy and the collapse of democratic systems. Readings focus on several case studies, from the collapse of democracy in Weimar Germany to political transition in Mexico today, that help to illustrate broader theoretical issues. Graduate students are expected to explore the subject in greater depth through reading and individual research.","prereq":["17.508","17.507"],"label":"17.507 - Democratization and Democratic Breakdown","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":["Not offered this year","Not offered this year"],"id":"17.507","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.507","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Explores why people join grassroots political organizations and social movements. Asks what accounts for the ultimate success or failure of these organizations and examines how social movements have altered political parties, political institutions, and social relations. Critically considers a range of theoretical treatments and several movements, including the U.S. civil rights, poor peoples\', pro-life/pro-choice and gay/lesbian movements.","label":"17.509 - Social Movements in Comparative Perspective","type":"Class","course":"17","units":"3-0-9","in-charge":"Nobles, M.","offering":"Not offered this year","id":"17.509","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.509","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Surveys the major types of democratic institutions, including parliamentary and presidential regimes, federal and unitary systems, coalition governments, and several other important distinctions. Explores the implications of these institutional arrangements for stability, good government, and economic development.","label":"17.51 - Politics, Economics, and Democracy","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":"Not offered this year","id":"17.51","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.51","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Subject discusses classic and current issues in electoral politics. Focus is mostly thematic, although the topics will be discussed in the context of different countries and regions. Examples of the topics are: party systems, old and new political cleavages, representation, electoral systems, and immigration and its effect on the party system. Two country-specific case studies explored in depth.","label":"17.515 - Comparative Electoral Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Kedar, O.","offering":["Not offered next year","Currently Offered"],"id":"17.515","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.515","total-units":"12.0"},{"lecture-section-of":"17.515","timeAndPlace":"TR 15:00-16:30 E51-061","type":"LectureSection","label":"L17.515-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Emerging democracies are now confronted with what has been termed \"the torturer problem.\" The questions are old ones: What is to be done about the perpetrator(s) and what is to be done for the abused? Seminar broadly examines the theoretical and empirical approaches to understanding the  issues commonly associated with \"transitional justice,\" including its motivations, agents, institutions, and decisions. Cases are drawn from various countries and historical periods, including post-World War II Europe, 19th century America, and 20th century Africa and Latin America.","label":"17.516 - Transitional Justice","type":"Class","course":"17","units":"3-0-9","in-charge":"Nobles, M.","offering":["Not offered next year","Currently Offered"],"id":"17.516","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.516","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Examines how and why people participate in public life and political affairs.  Drawing on examples from around the world, students analyze the effects of social networks, community norms, and associational activities on the functioning of democracy, regime stability, state capacity, and international politics.","label":"17.517 - Participation in Public Life","type":"Class","course":"17","units":"3-0-9","in-charge":"Tsai, L.","offering":"Not offered this year","id":"17.517","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.517","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Explores the role of religious groups, institutions, and ideas in politics using social science theories. Open to advanced undergraduate students with permission of instructor.","label":"17.522 - Politics and Religion","type":"Class","course":"17","units":"3-0-9","in-charge":"Tsai, L.","offering":"Not offered this year","id":"17.522","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.522","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Ethnic and racial conflict appear to be the hallmark of the post-Cold War world. What accounts for the rise of ethnic/racial and nationalist sentiments and movements? What is the basis of ethnic and racial identity? What are the political claims and goals of such movements and is conflict inevitable? Introduces students to dominant theoretical approaches to race, ethnicity, and nationalism, and considers them in light of current events in Africa, Europe, Asia, and the Americas.","label":"17.523 - Ethnicity and Race in World Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Nobles, M.","offering":["Not offered next year","Currently Offered"],"id":"17.523","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.523","total-units":"12.0"},{"lecture-section-of":"17.523","timeAndPlace":"TR 9:30-11:00 5-231","type":"LectureSection","label":"L17.523-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Explores the related phenomena termed nationalism: national consciousness and identity, nations, nation-states, and nationalist ideologies and nationalist movements. Analyzes nationalism\'s emergence and endurance as a factor in modern politics and society. Topics include nationalism and state-building, nationalism and economic modernization, nationalism and democratization, and nationalism and religious conflict.","label":"17.524 - Nationalism","type":"Class","course":"17","units":"3-0-9","in-charge":"Nobles, M.","offering":"Not offered this year","id":"17.524","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.524","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Designed for PhD students embarking on dissertation research in the fields of comparative politics and comparative political economy. Aimed particularly at those students who have already passed their general exams, although others admitted with permission of instructor. Focuses on issues associated with designing and undertaking a substantive piece of research. Begins by examining a number of examples of successful research with a view to examining how they were designed, what research problems they confronted, and how they were surmounted. The second part reviews alternative methodologies for carrying out the research. In the final part, participants\' research proposals are discussed with an eye to both their substantive and methodological dimensions.","label":"17.526 - Dissertation Workshop in Comparative Politics and Comparative Political Economy","type":"Class","course":"17","units":"3-0-9","in-charge":["Berger, S.","Locke, R."],"offering":["Not offered next year","Currently Offered"],"id":"17.526","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.526","total-units":"12.0"},{"lecture-section-of":"17.526","timeAndPlace":"M 15:00-17:00 E51-385","type":"LectureSection","label":"L17.526-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Examines the growing body of research suggesting that social networks, community norms, and social organizations can have important effects on social welfare, political stability, economic development, and governmental performance. Cases drawn from various countries and focus on the effects of networks, norms, and organizations on outcomes ranging from local public goods provision and the performance of democracies to ethnic conflict and funding for terrorism.","label":"17.528 - Civil Society, Social Capital, and the State in Comparative Perspective","type":"Class","course":"17","units":"3-0-9","in-charge":"Tsai, L.","offering":"Not offered this year","id":"17.528","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.528","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Explores why states exist and how they expand.  Analyzes state-building, state capacity, state failure, and the role of the state in political and economic outcomes.","label":"17.530 - The State","type":"Class","course":"17","units":"3-0-9","in-charge":"Tsai, L.","offering":"Not offered this year","id":"17.530","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.530","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Compares politics and society in France, Great Britain, Germany, and Italy. Analyzes cases of the integration of feudal remnants and the problem of controlling the economy. Open to qualified undergraduates with permission from instructor.","label":"17.534 - Domestic Politics of Western Europe","type":"Class","course":"17","units":"3-0-9","in-charge":"Berger, S.","offering":"Not offered this year","id":"17.534","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.534","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Spring","Spring"],"description":"Analyzes contemporary Japanese politics, focusing primarily upon the post-World War II period. Includes examination of the dominant approaches to Japanese politics and society, the structure of the party system, the role of political opposition, the policy process, foreign affairs, and interest groups. Attention to defense, foreign, industrial, social, energy, and technology policy processes. Graduate students are expected to pursue the subject in greater depth through reading and class presentations. Assignments differ.","prereq":["17.538","17.537"],"label":"17.537 - Politics and Policy in Contemporary Japan","type":"Class","course":"17","units":"3-0-9","in-charge":"Samuels, R. J.","offering":["Not offered this year","Not offered this year"],"id":"17.537","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.537","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Lectures, seminar discussion, small-team case studies, and web page construction exercises shed light on contemporary Japan. Focus on four substantive topics:  politics and history, economy and technology, education and the workplace, and community/civil society.","prereq":"17.543","label":"17.541 - Japanese Politics and Society","type":"Class","course":"17","units":"2-0-4 [P/D/F]","in-charge":"Samuels, R.","offering":"Currently Offered","id":"17.541","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.541","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"See description under 17.541. 17.543 requires assigned additional readings, two short papers, and a final exam.","prereq":"17.541","label":"17.543 - Japanese Politics and Society","type":"Class","course":"17","units":"2-0-7","in-charge":"Samuels, R.","offering":"Currently Offered","id":"17.543","category":"HASS Elective","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.543","total-units":"9.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Seminar has two main goals: explores the main theoretical and methodological approaches to the study of contemporary Chinese politics; and relates those approches to broader trends in the field of comparative politics. What has the study of China contributed to the field of comparative politics, and vice versa? What are the most effective ways to integrate area studies, broader comparative approaches, and theory? Seminar presumes a basic understanding of the history and politics of contemporary China.","label":"17.544 - Comparative Politics and China","type":"Class","course":"17","units":"3-0-9","in-charge":"Steinfeld, E.","offering":"Currently Offered","id":"17.544","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.544","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Spring","Spring"],"description":"Examines the major political changes occurring in South Asia: economic liberalization; state structures; changing role of caste, linguistic, religious, tribal, and class forces; the changing role of political parties and the military. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.546","17.545"],"label":"17.545 - Political Change in South Asia","type":"Class","course":"17","units":"3-0-9","in-charge":"Staff","offering":["Not offered this year","Not offered this year"],"id":"17.545","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.545","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Fall"],"description":"Examines the causes and consequences of China\'s emergence as a global economic and political force. Employing perspectives from comparative politics and international relations, subject examines the connections between China\'s domestic transformation and its foreign policy. Topics include the historical process of China\'s rise, contemporary challenges facing the Chinese system, and the impact of China\'s rise on issues of regional and global concern, including military security, economic competitiveness, environmental sustainability, and political stability.","prereq":["17.548","17.547"],"label":"17.547 - The Rise of China","type":"Class","course":"17","units":"3-0-9","in-charge":"Steinfeld, E.","offering":"Currently Offered","id":"17.547","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.547","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Interdisciplinary introduction to contemporary Latin America, drawing on films, literature, popular press accounts, and scholarly research. Topics include economic development, ethnic and racial identity, religion, revolution, democracy, transitional justice, and the rule of law. Examples draw on a range of countries in the region, especially Mexico, Chile, and Brazil. Includes a heavy oral participation component, with regular breakout groups, formal class presentations on pressing social issues (such as criminal justice and land tenure), and a structured class debate.","prereq":["21A.430J","21F.084J"],"label":"17.55J - Introduction to Latin American Studies","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":"Not offered this year","id":"17.55J","category":["HASS-D 4","HASS Communication-Intensive"],"area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.55J","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Examines the theories and policy debates over who can own real property, how to communicate and enforce property rights, and the range of liberties that they confer.  Explores alternative economic, political, and sociological perspectives of property rights and their policy and planning implications.","prereq":["4.257J","11.467J"],"label":"17.550J - Property Rights in Transition","type":"Class","course":"17","units":"3-0-9","in-charge":"Kim, A. M.","offering":"Currently Offered","id":"17.550J","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.550J","total-units":"12.0"},{"lecture-section-of":"17.550J","timeAndPlace":"W 15:00-17:00 1-132","type":"LectureSection","label":"L17.550J-1"},{"subarea":"Security Studies","has-final":false,"semester":["Spring","Spring"],"description":"Focuses on China\'s transition from plan to market. What has the trajectory of institutional change in China been, and how has growth been achieved? Is that growth sustainable? Subject examines specific aspects of reform (enterprise, fiscal, financial, social welfare), and the systemic consequences of interaction between various reform measusres. Additional topics include the interaction between political and economic change, the transformation of state-society relations, and the generalizability of China\'s reform experience. Graduate students are expected to explore the subject in greater depth.","prereq":["17.552","17.551"],"label":"17.551 - Political Economy of Chinese Reform","type":"Class","course":"17","units":"3-0-9","in-charge":"Steinfeld, E.","offering":"Currently Offered","id":"17.551","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.551","total-units":"12.0"},{"lecture-section-of":"17.551","timeAndPlace":"TR 9:30-11:00 2-147","type":"LectureSection","label":"L17.551-1"},{"lecture-section-of":"17.551","timeAndPlace":"TR 9:30-11:00 2-147","type":"LectureSection","label":"L17.551-2"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Covers the main topics in Latin American politics over the last four decades: modernization, bureaucratic authoritarianism, civil military relations, the politics of economic reform, political transition, party systems, voting behavior, interest groups, new social movements, the mass media, political culture, and US-Latin American relations. Open to qualified undergraduates with permission of instructor.","label":"17.554 - Political Economy of Latin America","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":"Not offered this year","id":"17.554","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.554","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Examines theoretical and empirical approaches to understanding the process of late development. Topics include the role of the state in alleviating or exacerbating poverty, the politics of industrial policy and planning, and the relationship between institutional change and growth. How over the past century have some of the world\'s poorest nations achieved wealth? How have others remained mired in poverty? What are the social consequences for alternative strategies of development?","label":"17.556 - Political Economy of Development","type":"Class","course":"17","units":"3-0-9","in-charge":"Steinfeld, E.","offering":"Currently Offered","id":"17.556","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.556","total-units":"12.0"},{"lecture-section-of":"17.556","timeAndPlace":"W 9:00-11:00 E51-393","type":"LectureSection","label":"L17.556-1"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Provides a focus on, and context for, technology change, with specific reference to contemporary conflicts and competing ideologies, Islam and politics, post-colonial experiences, and patterns of social pressures. Examines role of technological and scientific institutions, and potentials for technology leapfrogging. Changing environment of international business is explored, as are patterns of investments in the region. Provides students with interdisciplinary approach to development in the Middle East. Open to undergraduates with permission of instructor.","label":"17.558 - Political Economy and Technological Change in the Middle East","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":"Not offered this year","id":"17.558","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.558","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Fall"],"description":"Focuses on comparative approaches to security and sustainability in national and international contexts, with special emphasis on constraints, options, strategies, and policy choice. Comparisons are undertaken in terms of levels and locations (countries and regions, localities); systems (social, economic, political, and technological); methods and models (analytical, empirical, historical); time frame (past, present, and future). Levels and locations include developing and industrial contexts encompassed in a global perspective. Emphasis on specific countries and coverage shaped by students\' interest and participation. Graduate students are expected to pursue the subject in greater depth through reading and individual research.","prereq":["17.560","17.559"],"label":"17.559 - Comparative Security and Sustainability","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":["Not offered this year","Not offered this year"],"id":"17.559","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.559","total-units":"12.0"},{"subarea":"Security Studies","has-final":true,"semester":"Spring","description":"Explores political and historical evolution of Soviet state and society from 1917 Revolution to its demise in 1991. Subject covers the creation of a revolutionary regime; causes and nature of the Stalin revolution; post-Stalinist efforts to achieve radical political and social reform; and causes of the Soviet collapse. Also examines current developments in Russia in light of Soviet history.","prereq":"21H.467J","label":"17.57J - Soviet and Post-Soviet Politics and Society, 1917-Present","type":"Class","course":"17","units":"3-0-9","in-charge":"Wood, E.","offering":"Currently Offered","id":"17.57J","category":"HASS-D 4","area":"Comparative Politics","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.57J","total-units":"12.0"},{"lecture-section-of":"17.57J","timeAndPlace":"TR 13:00-14:30 66-160","type":"LectureSection","label":"L17.57J-1"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Surveys the social science literature on civil war. Studies the origins of civil war, discusses variables affecting duration, and examines termination of conflict. Highly interdisciplinary and covers a wide variety of cases. Open to advanced undergraduates with permission of instructor.","label":"17.582 - Civil War","type":"Class","course":"17","units":"3-0-9","in-charge":"Petersen, R.","offering":"Not offered this year","id":"17.582","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.582","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Subject consists of five sections. After a general survey of the field, students consider cases of stable civilian control, military rule, and transitions from military to civilian rule. Cases are selected from around the world.","label":"17.584 - Civil-Military Relations","type":"Class","course":"17","units":"3-0-9","in-charge":"Petersen, R.","offering":"Not offered this year","id":"17.584","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.584","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"An introduction to the field of comparative politics for first-year graduate students in political science.  Readings include both classic and modern materials. Discuss research design and research methods, in addition to topics such as political culture, social cleavages, regime change, democratic institutions, parties and interest groups, comparative political behavior, civil military relations, and ethnic politics. Emphasis on each issue depends in part on the interests of the students.","label":"17.588 - Field Seminar in Comparative Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":"Currently Offered","id":"17.588","category":"H-LEVEL Grad Credit","area":"Comparative Politics","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.588","total-units":"12.0"},{"lecture-section-of":"17.588","timeAndPlace":"T 13:00-15:00 E51-393","type":"LectureSection","label":"L17.588-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Introduces principles of empirical and theoretical analysis in political science through research projects currently conducted in the department. Different department faculty lead modules that introduce students to major research questions and different ways of examining those questions. Emphasizes how this research in progress relates to larger themes, and how researchers confront obstacles to inference in political science. Includes substantial instruction and practice in writing (with revision) and oral presentations. Intended primarily for majors and minors.","label":"17.869 - Political Science Scope and Methods","type":"Class","course":"17","units":"3-0-9","in-charge":"Berinsky, A.","offering":"Currently Offered","id":"17.869","category":"HASS Elective","area":"Models and Methods","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.869","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"count toward HASS Requirement.","prereq":"17.869","label":"17.871 - Political Science Laboratory","type":"Class","course":"17","units":"3-6-6","in-charge":"Lenz, G.","offering":"Currently Offered","id":"17.871","category":"Institute LAB","area":"Models and Methods","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.871","total-units":"15.0"},{"lecture-section-of":"17.871","timeAndPlace":"MW 15:00-16:30 E53-220","type":"LectureSection","label":"L17.871-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Introduction to elementary statistics and its application in social sciences. Teaches students how to read and interpret the quantitative literature in various subfields of political science and public policy. Students develop elementary statistical computation skills and learn to use a statistical computing package.","label":"17.872 - Quantitative Research Methods I: Introduction","type":"Class","course":"17","units":"3-0-9","in-charge":"Ansolabehere, S.","offering":"Currently Offered","id":"17.872","category":"H-LEVEL Grad Credit","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.872","total-units":"12.0"},{"subarea":"Security Studies","has-final":true,"semester":"Spring","description":"Focus on multivariate data analysis procedures, emphasizing regression. Considers model specification, autocorrelation, instrumental variables, and causal modeling. Students must have taken at least one previous subject in statistics. Open to qualified undergraduates.","prereq":["17.871","17.872"],"label":"17.874 - Quantitative Research Methods II: Multivariate","type":"Class","course":"17","units":"3-0-9","in-charge":"Kedar, O.","offering":"Currently Offered","id":"17.874","category":"H-LEVEL Grad Credit","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.874","total-units":"12.0"},{"lecture-section-of":"17.874","timeAndPlace":"TR 11:00-12:30 E51-393","type":"LectureSection","label":"L17.874-1"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Seminar explores the development and application of qualitative research designs and methods in political analysis. Considers a broad array of approaches, from exploratory narratives to focused-comparison case studies, for investigating plausible alternative hypotheses. The focus is on analysis, not data collection.","label":"17.878 - Qualitative Research: Design and Methods","type":"Class","course":"17","units":"3-0-9","in-charge":"Locke, R.","offering":["Not offered next year","Currently Offered"],"id":"17.878","category":"H-LEVEL Grad Credit","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.878","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Fall"],"description":"Introduces students to the rudiments of game theory within political science. Provides all students with the ability to solve simple games. Graduate students evaluate \"applied theory\" articles in the major journals. Readings draw from basic texts on game theoretic modeling and applied articles in American Politics, International Relations, and Comparative Politics. Graduate students are expected to explore the subject in greater depth.","prereq":["17.882","17.881"],"label":"17.881 - Game Theory and Political Theory","type":"Class","course":"17","units":"3-0-9","in-charge":"Snyder, J.","offering":"Currently Offered","id":"17.881","category":["HASS Elective","H-LEVEL Grad Credit"],"area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.881","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"An applied theory subject analyzing political institutions from a rational choice perspective. The chief focus is the burgeoning literature on elections, legislatures, bureaucracies, and courts. Pays some attention to institutions from a comparative perspective. Advanced undergraduates may take subject with permission of instructor.","prereq":"14.296J","label":"17.884J - Collective Choice I","type":"Class","course":"17","units":"3-0-9","in-charge":["Snyder, J. M.","Jr."],"offering":"Currently Offered","id":"17.884J","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.884J","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Spring","description":"Focuses on the relationship between the behavioral models developed by formal theorists and the statistical models used in empirical estimation. The main questions are: How do researchers make the link between theory and the data? How do they generate and estimate statistical models that allow careful testing of the behavioral models? What constitutes a good test of a model? Questions studied through reading and discussion of articles that combine both empirical and theoretical analysis.","prereq":["14.295J","17.884J"],"label":"17.886J - Collective Choice II","type":"Class","course":"17","units":"3-0-9","in-charge":["Snyder, J. M.","Jr."],"offering":"Not offered this year","id":"17.886J","category":"H-LEVEL Grad Credit","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.886J","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Introduces a variety of approaches and methods for conducting field research, including elite interviewing, participant observation, case studies, electoral analysis, cross-cultural survey research, and documentary research. Attention to conceptual, practical, and ethical issues of conducting research abroad, e.g., the role of language in social research, the limits and uses of official sources, and ethical responsibilities of social scientists. Students analyze \"exemplary\" publications based on field research and prepare and discuss their own research proposals.","label":"17.888 - Field Research Methods","type":"Class","course":"17","units":"2-2-8","in-charge":"Staff","offering":"Not offered this year","id":"17.888","category":"H-LEVEL Grad Credit","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.888","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Spring","Spring"],"description":"Explores computational models of political behavior; an emerging area in political science. Connections between cognitive processes, intents, goals, and actual behaviors. Specific applications in the domains of international relations (conflict and violence) and comparative politics (internal stability and security). Students taking graduate version are expected to complete additional assignments.","prereq":["17.892","17.891"],"label":"17.891 - Computational Politics","type":"Class","course":"17","units":"3-0-9","in-charge":"Choucri, N.","offering":["Not offered this year","Not offered this year"],"id":"17.891","area":"Models and Methods","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.891","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Fall","Spring"],"description":"Research opportunities in political science in theoretical and applied research. For further information, contact the departmental coordinator.","label":"17.UR - Undergraduate Research","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"17.UR","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.UR","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring"],"description":"Fundamental ideas, theories, and methods in modern political science through the study of a small number of high-quality books and articles that have been influential in the field. The first term focuses on issues of political theory (including both normative philosophy and individual motivations) and international relations. The second term focuses on American and comparative politics. Restricted to first-year political science PhD students.","label":"17.900 - Foundations of Political Science","type":"Class","course":"17","units":"3-0-9","in-charge":"Lawson, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.900","category":"H-LEVEL Grad Credit","area":"General Subjects","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.900","total-units":"12.0"},{"lecture-section-of":"17.900","timeAndPlace":"T 17:00-19:30 E51-393","type":"LectureSection","label":"L17.900-1"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","IAP","Spring","Summer","Fall","IAP","Spring","Summer"],"description":"Independent research enabling students to do work in an agency, state, or local government, or other public organization. The academic component involves close contact between the student and a faculty advisor and written work.","label":"17.901 - Political Science Internship and Research","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"17.901","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.901","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"Seminar involves students in the community that exists beyond the labs and classrooms of the MIT campus. Through a combination of community service and academic study, students learn about political, economic, and social issues that confront residents in Boston and Cambridge. Students volunteer in a community service agency or private organization devoted to community needs and development. Students also responsible for directed readings, short writing assignments, and six seminar sessions. Subject can only be repeated for credit if area of community service is different.","label":"17.903 - Community Service: Experience and Reflection","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.903","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.903","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Summer"],"description":"Reading and discussion of special topics in the fields of social science. Enrollment may be limited. Priority given to pre-registrants.","label":"17.907 - Reading Seminar in Social Science","type":"Class","course":"17","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"17.907","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.907","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","IAP","Spring","Summer"],"description":"Reading and discussion of special topics in the fields of social science. Open to advanced undergraduates by arrangement with individual staff members. 17.909 is taught P/D/F.","label":"17.905?17.911 - Reading Seminar in Social Science","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.905?17.911","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.905?17.911","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","IAP","Spring","Summer","Fall","IAP","Spring","Summer"],"description":"Reading and discussion of special topics in the field of social science.","label":"17.912, 17.914, 17.916?919 - Special Topics in Political Science","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Can be repeated for credit","Currently Offered"],"id":"17.912, 17.914, 17.916?919","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.912, 17.914, 17.916?919","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Summer"],"description":"Independent research for students who would like to pursue a research project during their stay abroad. Initiated with faculty advisor during the term prior to leaving, students are expected to conduct research during stay abroad and complete project after return to campus. The academic component involves close contact between the student and a faculty advisor, written work, and oral presentation.","label":"17.921J - Independent International Research Project","type":"Class","course":"17","units":"Unknown","in-charge":["Berger, S.","Widdig, B."],"offering":["Can be repeated for credit","Currently Offered"],"id":"17.921J","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.921J","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Summer"],"description":"Open to qualified graduate students who would like to pursue special subjects or projects. Please consult graduate administration prior to registration.","label":"17.950?17.953 - Special Graduate Topic in Political Science","type":"Class","course":"17","units":"Unknown","in-charge":"Staff","offering":["Can be repeated for credit","Currently Offered"],"id":"17.950?17.953","category":"H-LEVEL Grad Credit","area":"General Subjects","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.950?17.953","total-units":"Unknown"},{"lecture-section-of":"17.950?17.953","timeAndPlace":"MW 9:30-11:00 E51-385","type":"LectureSection","label":"L17.950?17.953-1"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Summer"],"description":"Reading and discussion of special topics in the fields of social science. Open to advanced graduate students by arrangement with individual staff members. 17.954 and 17.959 are taught P/D/F.","label":"17.954?17.960 - Reading Seminar in Social Science","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.954?17.960","category":"H-LEVEL Grad Credit","area":"General Subjects","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.954?17.960","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring","Summer"],"description":"Program of research and writing of major research paper as part of pre-dissertation requirements; to be arranged by the student with supervising committee.  Restricted to doctoral students.","label":"17.962 - Major Research Paper","type":"Class","course":"17","units":"Unknown","in-charge":"Singer, D.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.962","category":"H-LEVEL Grad Credit","area":"General Subjects","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.962","total-units":"Unknown"},{"lecture-section-of":"17.962","timeAndPlace":"M 13:00-15:00 E51-390","type":"LectureSection","label":"L17.962-1"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring"],"description":"Program of research and writing of thesis; to be arranged by the student with supervising committee.","label":"17.ThG - Graduate Political Science Thesis","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.ThG","category":"H-LEVEL Grad Credit","area":"General Subjects","level":"Grad","url":"http://student.mit.edu/catalog/m17b.html#17.ThG","total-units":"Unknown"},{"subarea":"Security Studies","has-final":false,"semester":"Fall","description":"Students writing a thesis in Political Science develop their research topics, review relevant research and scholarship, frame their research questions and arguments, choose an appropriate methodology for analysis, and draft the introductory and methodology sections of their theses. Includes substantial instruction and practice in writing with revision and oral presentations.","prereq":["17.869","17.871"],"label":"17.ThT - Thesis Research Design Seminar","type":"Class","course":"17","units":"3-0-9","in-charge":"Fravel, M. T.","offering":"Currently Offered","id":"17.ThT","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.ThT","total-units":"12.0"},{"subarea":"Security Studies","has-final":false,"semester":["Fall","Spring"],"description":"Program of research leading to the writing of an SB thesis. To be arranged by the student under approved supervision.","label":"17.ThU - Undergraduate Political Science Thesis","type":"Class","course":"17","units":"Unknown","in-charge":"Stewart, C.","offering":["Can be repeated for credit","Currently Offered"],"id":"17.ThU","area":"General Subjects","level":"Undergrad","url":"http://student.mit.edu/catalog/m17b.html#17.ThU","total-units":"Unknown"}]}