{"items":[{"type":"Class","id":"22.615","course":"22","label":"MHD Theory of Fusion Systems","shortLabel":"MHD Theory of Fusion Systems","units":"3-0-9","total-units":12,"description":"Discussion of MHD equilibria in cylindrical, toroidal, and noncircular configurations. MHD stability theory including the Energy Principle, interchange instability, ballooning modes, second region of stability, and external kink modes. Description of current configurations of fusion interest.","level":"High Graduate","prereqs":"22.611J, 6.651J, or 8.613J","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"J. P. Freidberg"},{"type":"Class","id":"22.616","course":"22","label":"Plasma Transport Theory","shortLabel":"Plasma Transport Theory","units":"3-0-9","total-units":12,"description":"The Fokker-Planck operator for Coulomb collisions, including the Landau and Rosenbluth potential forms, is derived, expanded to obtain useful limits, and used to define characteristic times. Classical collisional transport in an arbitrary magnetic field is developed first, and then the high (Pfirsch-Schluter), low (banana), and intermediate (plateau) collisionality regimes of tokamak transport are examined with emphasis on the banana regime where bootstrap current is most pronounced. Gyrokinetics and zonal flow is discussed.","level":"High Graduate","prereqs":"22.615","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"P. Catto"},{"type":"Class","id":"22.62","course":"22","label":"Fusion Energy","shortLabel":"Fusion Energy","units":"3-0-9","total-units":12,"description":"Basic nuclear physics and plasma physics for controlled fusion. Fusion cross-sections and consequent conditions required for ignition and energy production. Principles of magnetic and inertial confinement. Description of magnetic confinement devices: tokamaks, stellarators and RFPs, their design and operation. Elementary plasma stability considerations and the limits imposed. Plasma heating by neutral beams and RF. Outline design of the ITER &quot;burning plasma&quot; experiment and a magnetic confinement reactor.","level":"High Graduate","prereqs":"22.611J","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"D. Whyte"},{"type":"Class","id":"22.63","course":"22","label":"Engineering Principles for Fusion Reactors","shortLabel":"Engineering Principles for Fusion Reactors","units":"3-0-9","total-units":12,"description":"Fusion reactor design considerations: ignition devices, engineering test facilities, and safety/environmental concerns. Magnet principles: resistive and superconducting magnets; cryogenic features. Blanket and first wall design: liquid and solid breeders, heat removal, and structural considerations. Heating devices: radio frequency and neutral beam.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"D. Whyte"},{"type":"Class","id":"22.URG","course":"22","label":"Undergraduate Research Opportunities Program","shortLabel":"Undergraduate Research Opportunities Program","units":"0-0-0","total-units":0,"description":"The Undergraduate Research Opportunities Program is an excellent way for undergraduate students to become familiar with the department of Nuclear Science and Engineering. Student research as a UROP project has been conducted in areas of fission reactor studies, utilization of fusion devices, applied radiation physics research, and biomedical applications. Projects include the study of engineering aspects for fusion and fission energy sources, and utilization of radiations.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"A. C. Kadak"},{"type":"Class","id":"22.URN","course":"22","label":"Undergraduate Research","shortLabel":"Undergraduate Research","units":"0-1-0","total-units":1,"description":"","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":""},{"type":"Class","id":"22.67","course":"22","label":"Principles of Plasma Diagnostics","shortLabel":"Principles of Plasma Diagnostics","units":"3-0-9","total-units":12,"description":"Introduction to the physical processes used to measure the properties of plasmas, especially fusion plasmas. Measurements of magnetic and electric fields, particle flux, refractive index, emission and scattering of electromagnetic waves and heavy particles; their use to deduce plasma parameters such as particle density, pressure, temperature, and velocity, and hence the plasma confinement properties. Discussion of practical examples and assessments of the accuracy and reliability of different techniques.","level":"High Graduate","prereqs":"6.651J, 8.613J, or 22.611J","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"I. H. Hutchinson"},{"type":"Class","id":"22.70","course":"22","label":"Materials for Nuclear Applications","shortLabel":"Materials for Nuclear Applications","units":"3-0-9","total-units":12,"description":"Introductory subject for students who are not specializing in nuclear materials. Applications and selection of materials for use in nuclear applications. Radiation damage, radiation effects, and their effects on performance of materials in fission and fusion environments.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"B. Yildiz"},{"type":"Class","id":"22.71","course":"22","label":"Modern Physical Metallurgy","shortLabel":"Modern Physical Metallurgy","units":"3-0-9","total-units":12,"description":"Examines how the presence of 1-, 2- and 3D defects and second phases control the mechanical, electromagnetic and chemical behavior of metals and alloys. Considers point, line and interfacial defects in the context of structural transformations including annealing, spinodal decomposition, nucleation, growth, and particle coarsening. Concentrates on structure-function relationships, and in particular how grain size, interstitial and substitutional solid solutions, and second-phase particles impact mechanical and other properties  Industrially relevant case studies illustrate lecture concepts. Students taking the graduate version explore the subject in greater depth.","level":"High Graduate","prereqs":"3.012, 3.022, 3.032","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"3.40J","equivalent":"","semester":['Fall'],"in-charge":"C. Schuh"},{"type":"Class","id":"22.72","course":"22","label":"Corrosion: The Environmental Degradation of Materials","shortLabel":"Corrosion: The Environmental Degradation of Materials","units":"3-0-9","total-units":12,"description":"Applies thermodynamics and kinetics of electrode reactions to aqueous corrosion of metals and alloys. Application of advanced computational and modeling techniques to evaluation of materials selection and susceptibility of metal/alloy systems to environmental degradation in aqueous systems. Discusses materials degradation problems in marine environments, oil and gas production, and energy conversion and generation systems, including fossil and nuclear.","level":"High Graduate","prereqs":"3.012","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"3.54J","equivalent":"","semester":['Spring'],"in-charge":"R. G. Ballinger"},{"type":"Class","id":"22.76","course":"22","label":"Nuclear Chemical Engineering","shortLabel":"Nuclear Chemical Engineering","units":"3-1-8","total-units":12,"description":"Application of chemical engineering to nuclear fission reactors and nuclear waste reprocessing. Review of chemical kinetics, equilibrium, and thermodynamics. Chemistry of inorganic elements used in nuclear technology. Principles of chemical separation of radioactive waste. Examination of separation engineering processes. Isotopic enrichment techniques and processes. Chemical behavior of stable elements and radionuclides in reactor conditions. Laboratory demonstration of radioisotope separations.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"B. Yildiz"},{"type":"Class","id":"22.77","course":"22","label":"Nuclear Waste Management","shortLabel":"Nuclear Waste Management","units":"3-0-9","total-units":12,"description":"Introduces scientific and engineering aspects of the management of spent fuel, reprocessed high-level waste, low-level wastes, and decommissioning wastes. Characteristics and classification of nuclear wastes and waste forms. Fundamental processes and governing equations of radionuclide transport in the environment. Discussion of performance assessment for repositories. Design principles and evaluation methods for geologic waste disposal systems. Analyzes waste management implications of advanced fuel cycles.  Final team project.","level":"High Graduate","prereqs":"22.76 or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"R. K. Lester"},{"type":"Class","id":"22.811","course":"22","label":"Sustainable Energy","shortLabel":"Sustainable Energy","units":"3-1-8","total-units":12,"description":"Assessment of current and potential energy systems, covering extraction, conversion and end-use, with emphasis on meeting regional and global energy needs in the 21st century in a sustainable manner. Examination of energy technologies in each fuel cycle stage for fossil (oil, gas, synthetic), nuclear (fission and fusion) and renewable (solar, biomass, wind, hydro, and geothermal) energy types, along with storage, transmission, and conservation issues. Focus on evaluation and analysis of energy technology systems in the context of political, social, economic, and environmental goals. Open to upper-class undergraduates.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"1.818J, 2.65J, 10.391J, 11.371J, ESD.166J","equivalent":"","semester":['Fall'],"in-charge":"M. W. Golay, J. W. Tester, J. P. Freidberg"},{"type":"Class","id":"22.812","course":"22","label":"Managing Nuclear Technology","shortLabel":"Managing Nuclear Technology","units":"3-0-9","total-units":12,"description":"Examines current economic, management, and policy issues concerning nuclear power and its fuel cycle. Introduces methods for analyzing private and public policy alternatives, including techniques in economic and financial analysis. Application to specific problem areas, including nuclear waste management, weapons proliferation, and the economic competitiveness of nuclear power. Other topics include deregulation and restructuring in the electric power industry.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"ESD.163J","equivalent":"","semester":['Spring'],"in-charge":"R. K. Lester"},{"type":"Class","id":"22.013","course":"22","label":"Applications of Radiation Science and Technology in Biomedical Research","shortLabel":"Applications of Radiation Science and Technology in Biomedical Research","units":"2-0-4","total-units":6,"description":"Seminar lectures, led by practicing clinicians and scientists in a case presentation format, on current research topics and specific projects in the biomedical field in which radiation science and radiological engineering play an important role. Emphasis on nuclear imaging techniques such as magnetic resonance and positron emission tomography, and on radiation therapy. Term paper required. Lectures shared with freshman advisor seminar 22.A09 Career Options for Biomedical Research.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"S. Yip, B. Rosen"},{"type":"Class","id":"22.02","course":"22","label":"Introduction to Applied Nuclear Physics","shortLabel":"Introduction to Applied Nuclear Physics","units":"5-0-7","total-units":12,"description":"Basic concepts of nuclear physics with emphasis on nuclear structure and interactions of radiation with matter. Elementary quantum theory; nuclear forces; shell structure of the nucleus; alpha, beta, and gamma, radioactive decays; interactions of nuclear radiations (charged particles, gammas and neutrons) with matter; nuclear reactions; fission and fusion.","level":"Undergraduate","prereqs":"GIR:PHY2, GIR:CAL2","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"Rest Elec in Sci & Tech","joint":"","equivalent":"","semester":['Fall'],"in-charge":"K. Molvig"},{"type":"Class","id":"22.033","course":"22","label":"Nuclear Systems Design Project","shortLabel":"Nuclear Systems Design Project","units":"3-0-9","total-units":12,"description":"Group design project involving integration of nuclear physics, particle transport, control, heat transfer, safety, instrumentation, materials, environmental impact, and economic optimization. Provides opportunity to synthesize knowledge acquired in nuclear and non-nuclear subjects and apply this knowledge to practical problems of current interest in nuclear applications design. Past projects have included using a fusion reactor for transmutation of nuclear waste, design and implementation of an experiment to predict and measure pebble flow in a pebble bed reactor, and development of a mission plan for a manned Mars mission including the conceptual design of a nuclear powered space propulsion system and power plant for the Mars surface, a lunar/Martian nuclear power station and the use of nuclear plants to extract oil from tar sands.  Meets with graduate subject 22.33, but assignments differ.","level":"Undergraduate","prereqs":"22.06","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"D. G. Whyte"},{"type":"Class","id":"22.05","course":"22","label":"Neutron Science and Reactor Physics","shortLabel":"Neutron Science and Reactor Physics","units":"5-0-7","total-units":12,"description":"Introduces fundamental properties of the neutron. Covers reactions induced by neutrons, nuclear fission, slowing down of neutrons in infinite media, diffusion theory, the few-group approximation, point kinetics, and fission-product poisoning. Emphasizes the nuclear physics bases of reactor design and its relationship to reactor engineering problems.","level":"Undergraduate","prereqs":"22.02, 18.03","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"B. Forget"},{"type":"Class","id":"22.058","course":"22","label":"Radiation Systems Engineering and Tomographic Imaging","shortLabel":"Radiation Systems Engineering and Tomographic Imaging","units":"3-3-6","total-units":12,"description":"An introduction to radiation systems engineering with examples taken from tomographic imaging. Includes a series of lectures with a parallel set of recitations that provide demonstrations of basic principles. Both ionizing and non-ionizing radiation are covered, including x-ray, PET, MRI, and ultrasound. Emphasis is on the physics and engineering of image formation.","level":"Undergraduate","prereqs":"18.03, GIR:PHY2","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"D. G. Cory"},{"type":"Class","id":"22.06","course":"22","label":"Engineering of Nuclear Systems","shortLabel":"Engineering of Nuclear Systems","units":"3-0-9","total-units":12,"description":"Introduces engineering in nuclear energy plant design, accelerators and fusion machines. Using the basic principles of nuclear physics, reactor physics, plasma physics and magnetic confinement, heat transfer, safety, risk and reliability, the engineering design of nuclear power plants, accelerators and fusion systems are studied. The MIT reactor, department accelerators, and MIT's Alcator fusion facility are used.","level":"Undergraduate","prereqs":"2.005, 22.05","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"J. Buongiorno"},{"type":"Class","id":"22.071","course":"22","label":"Introduction to Electronics","shortLabel":"Introduction to Electronics","units":"3-3-6","total-units":12,"description":"Introductory subject suitable for students with little or no previous background in electronics. Provides the knowledge necessary for reading schematics and designing, building, analyzing, and testing fundamental analog and digital circuits. The class has a strong hands-on component. Students construct interactive examples and explore the practical uses of electronics in engineering and experimental science, including signals and measurement fundamentals. Students have the use of state-of-the-art hardware and software for data acquisition, analysis, and control.","level":"Undergraduate","prereqs":"18.03","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"Rest Elec in Sci & Tech","joint":"6.071J","equivalent":"","semester":['Spring'],"in-charge":"M. Chaniotakis"},{"type":"Class","id":"22.09","course":"22","label":"Principles of Nuclear Radiation Measurement and Protection","shortLabel":"Principles of Nuclear Radiation Measurement and Protection","units":"2-6-4","total-units":12,"description":"Combines lectures, demonstrations, and experiments.  Review of radiation protection procedures and regulations; theory and use of &alpha;, &beta;, &gamma;, and neutron detectors; applications in imaging and dosimetry; &gamma;-ray spectroscopy; design and operation of automated data acquisition experiments using virtual instruments.  Meets with  graduate subject 22.90, but homework assignments and examinations differ. Instruction and practice in written communication provided.","level":"Undergraduate","prereqs":"22.02","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive Major","gir":"Institute Lab","joint":"","equivalent":"","semester":['Spring'],"in-charge":"J. C. Yanch, R. C. Lanza, L. Hobbs"},{"type":"Class","id":"22.00","course":"22","label":"Introduction to Modeling and Simulation","shortLabel":"Introduction to Modeling and Simulation","units":"4-0-8","total-units":12,"description":"Basic concepts of computer modeling and simulation in science and engineering. Uses techniques and software for simulation, data analysis and visualization. Continuum, mesoscale, atomistic and quantum methods used to study fundamental and applied problems in physics, chemistry, materials science, mechanics, engineering, and biology. Examples drawn from the disciplines above are used to understand or characterize complex structures and materials, and complement experimental observations.","level":"Undergraduate","prereqs":"18.03, 3.016, or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"Rest Elec in Sci & Tech","joint":"","equivalent":"","semester":['Spring'],"in-charge":"M. Buehler, N. Marzari, R. Radovitzky, T. Thonhauser"},{"type":"Class","id":"22.002","course":"22","label":"Communicating About Technology:  Colossal Failures in Engineering","shortLabel":"Communicating About Technology:  Colossal Failures in Engineering","units":"3-0-9","total-units":12,"description":"Explores communication about technological subjects in the context of colossal engineering failures including Three Mile Island, Bhopal, the Columbia Shuttle, 9/11, and Katrina. Examines the basic engineering principles and the social context of several such failures in case studies from various engineering disciplines. Students see how problematic communications, sometimes subtly unrecognizable at the time, significantly contributed to the final failures. Students collaborate to produce a final written and oral research report that anticipates a potential failure and makes recommendations for avoiding it. Multiple sections, each limited to 18 students.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"Communication Intensive HASS","gir":"HASS Elective","joint":"1.588J, 3.070J, 21W.781J, ESD.032J","equivalent":"","semester":['Spring'],"in-charge":"T. Eagar, W. Haas, A. Kadak, P. Lagace, O. Buyukozturk"},{"type":"Class","id":"22.01","course":"22","label":"Introduction to Ionizing Radiation","shortLabel":"Introduction to Ionizing Radiation","units":"5-0-7","total-units":12,"description":"Introduction to basic properties of ionizing radiations and their uses in medicine, industry, science, and environmental studies. Discusses natural and man-made radiation sources, energy deposition and dose calculations, various physical, chemical, and biological processes and effects of radiation with examples of their uses, and principles of radiation protection.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"Rest Elec in Sci & Tech","joint":"","equivalent":"","semester":['Fall'],"in-charge":"J. C. Yanch"},{"type":"Class","id":"22.011","course":"22","label":"Seminar in Nuclear Science and Engineering","shortLabel":"Seminar in Nuclear Science and Engineering","units":"2-0-4","total-units":6,"description":"Surveys the range of diverse subjects in nuclear science and engineering covered by the department. Topics include quantum computing, energy and power, radiation effects-stem cells and DNA, BNCT, nuclear space applications, fusion, airport security, accelerators, magnetic resonance imaging, non-proliferation, risk assessment, safety, biology and medicine.  A demonstration of the MIT Reactor as a research tool is given as well as a tour of the MIT Tokomak fusion machine and accelerators used in research.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"A. Kadak"},{"type":"Class","id":"22.012","course":"22","label":"Seminar in Fusion and Plasma Physics","shortLabel":"Seminar in Fusion and Plasma Physics","units":"2-0-4","total-units":6,"description":"Lectures and discussion introducing the range of topics relevant to plasma physics and fusion engineering. Introductory discussion of the economic and ecological motivation for the development of fusion power. Contemporary magnetic confinement schemes, theoretical questions, and engineering considerations are presented by expert guest lecturers. Tour of Plasma Science and Fusion Center experimental facilities.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"K. Molvig"},{"type":"Class","id":"22.813","course":"22","label":"Applications of Technology in Energy and the Environment","shortLabel":"Applications of Technology in Energy and the Environment","units":"3-0-9","total-units":12,"description":"Introduces advanced undergraduates or graduate students in the Schools of Engineering and Science to the integration of technical, economic, political, and environmental consideration required for the successful implementation of new technology. Case studies are drawn from the energy and environment sectors with some emphasis on analytic techniques that serve as a &quot;tool box&quot; for students. Technologies considered include fossil, nuclear, solar, wind, fuel cell and energy conservation. International aspects, such as weapons proliferation and global climate effects, also discussed. Enrollment limited.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"J. Deutch, R. Lester"},{"type":"Class","id":"22.82","course":"22","label":"Engineering Risk-Benefit Analysis","shortLabel":"Engineering Risk-Benefit Analysis","units":"3-0-9","total-units":12,"description":"Emphasis on three methodologies pertaining to decision making in the presence of uncertainty: reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). Risks of particular interest are those associated with large engineering projects such as the development of new products; the building, maintenance and operation of nuclear reactors and space systems. Presents and interprets some of the frameworks helpful for balancing risks and benefits in the situations that typically involve human safety, potential environmental effects, and large financial and technological uncertainties. Review of elementary probability theory and statistics included.","level":"High Graduate","prereqs":"GIR:CAL2","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"G. E. Apostolakis"},{"type":"Class","id":"22.90","course":"22","label":"Nuclear Science and Engineering Laboratory","shortLabel":"Nuclear Science and Engineering Laboratory","units":"2-6-4","total-units":12,"description":"See description under subject 22.09.","level":"High Graduate","prereqs":"22.101","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"R. C. Lanza"},{"type":"Class","id":"22.901","course":"22","label":"Spec Prob: Nuclear Science & Eng","shortLabel":"Spec Prob: Nuclear Science & Eng","units":"0-0-0","total-units":0,"description":"","level":"High Graduate","prereqs":"Permission of Instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"J. C. Yanch"},{"type":"Class","id":"22.902","course":"22","label":"Spec Prob: Nuclear Science & Eng","shortLabel":"Spec Prob: Nuclear Science & Eng","units":"0-0-0","total-units":0,"description":"","level":"High Graduate","prereqs":"Permission of Instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"J. c. Yanch"},{"type":"Class","id":"22.903","course":"22","label":"Spec Prob: Nuclear Science & Eng","shortLabel":"Spec Prob: Nuclear Science & Eng","units":"0-0-0","total-units":0,"description":"","level":"High Graduate","prereqs":"Permission of Instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"J. c. Yanch"},{"type":"Class","id":"22.904","course":"22","label":"Special Problems in Nuclear Science & Engineering","shortLabel":"Special Problems in Nuclear Science & Engineering","units":"0-0-0","total-units":0,"description":"For graduate and advanced undergraduate students who wish to conduct a one-term project of a theoretical or experimental nature in the nuclear engineering field, in close cooperation with individual staff members. Arrangement of topic and hours to fit students' requirements.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"J. c. Yanch"},{"type":"Class","id":"22.905","course":"22","label":"Special Topics in Nuclear Science and Engineering","shortLabel":"Special Topics in Nuclear Science and Engineering","units":"0-0-0","total-units":0,"description":"Special topics for graduate and advanced undergraduate students.","level":"High Graduate","prereqs":"Permission of instructor","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"J. C. Yanch"},{"type":"Class","id":"22.911","course":"22","label":"Seminar in Nuclear Science and Engineering","shortLabel":"Seminar in Nuclear Science and Engineering","units":"2-0-1","total-units":3,"description":"","level":"Graduate","prereqs":"","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"A. Kadak, J. C. Yanch, D. Whyte"},{"type":"Class","id":"22.912","course":"22","label":"Seminar in Nuclear Science and Engineering","shortLabel":"Seminar in Nuclear Science and Engineering","units":"2-0-1","total-units":3,"description":"Restricted to graduate students engaged in doctoral thesis research.","level":"Graduate","prereqs":"","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"A. Kadak, J.C. Yanch, D. Whyte"},{"type":"Class","id":"22.915","course":"22","label":"Seminar in Magnetic Resonance","shortLabel":"Seminar in Magnetic Resonance","units":"2-0-1","total-units":3,"description":"Discusses current topics in magnetic resonance including research issues by graduate students and staff members.","level":"High Graduate","prereqs":"Permission of instructor","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"D. G. Cory"},{"type":"Class","id":"22.091","course":"22","label":"Special Topics in Nuclear Science and Engineering","shortLabel":"Special Topics in Nuclear Science and Engineering","units":"0-0-0","total-units":0,"description":"For undergraduates who wish to conduct a one-term project of theoretical or experimental nature in the field of nuclear engineering, in close cooperation with individual staff members. Topics and hours arranged to fit students' requirements.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"D. Cory"},{"type":"Class","id":"22.093","course":"22","label":"Special Topics in Nuclear Science and Engineering","shortLabel":"Special Topics in Nuclear Science and Engineering","units":"0-0-0","total-units":0,"description":"This subject is graded on a P/D/F basis and is otherwise equivalent to subject 22.091. Approval of the Course 22 undergraduate office is required prior to enrolling in 22.093.","level":"Undergraduate","prereqs":"","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"D. Cory"},{"type":"Class","id":"22.096","course":"22","label":"Quantum Mechanics for Nuclear Engineers","shortLabel":"Quantum Mechanics for Nuclear Engineers","units":"1-0-2","total-units":3,"description":"Introduction to wave mechanics using optical analogies and examples from nuclear science to gain an intuitive understanding of quantum phenomena. Topics include wave optics and mechanics, the Schrodinger equation and its solution in one dimension, the tunnel effect and radioactive decay, the deuteron and neutron-proton scattering. Math skills introduced as required. Lectures and computer simulation demonstrations. Meets with graduate subject 22.96, but assignments differ. Graduate students are expected to explore the subject in greater depth.","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['IAP'],"in-charge":"S. H. Chen"},{"type":"Class","id":"22.101","course":"22","label":"Applied Nuclear Physics","shortLabel":"Applied Nuclear Physics","units":"3-0-9","total-units":12,"description":"Elements of nuclear physics for engineering students. Basic properties of the nucleus and nuclear radiations. Quantum mechanical calculations of deuteron bound-state wave function and energy, n-p scattering cross section, transition probability per unit time and barrier transmission probability. Binding energy and nuclear stability. Interactions of charged particles, neutrons, and gamma rays with matter. Radioactive decays. Energetics and general cross section behavior in nuclear reactions.","level":"High Graduate","prereqs":"22.02","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"K. Molvig"},{"type":"Class","id":"22.105","course":"22","label":"Electromagnetic Interactions","shortLabel":"Electromagnetic Interactions","units":"3-0-9","total-units":12,"description":"Principles and applications of electromagnetism, starting from Maxwell's equations, with emphasis on phenomena important to nuclear engineering and radiation sciences. Solution methods for electrostatic and magnetostatic fields. Charged particle motion in those fields. Particle acceleration and focussing. Coulomb collisons with charged particles and atoms. Electromagnetic waves, wave emission by accelerated particles, Bremsstrahlung, Compton scattering, synchrotron radiation, Cerenkov radiation.","level":"High Graduate","prereqs":"GIR:PHY2, 8.03, GIR:CAL2, 18.03","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"R. R. Parker"},{"type":"Class","id":"22.106","course":"22","label":"Neutron Interactions and Applications","shortLabel":"Neutron Interactions and Applications","units":"3-0-9","total-units":12,"description":"Comprehensive treatment of neutron interactions in condensed matter at energies from thermal to MeV, focusing on particle distributions most relevant to fission, fusion and radiation research applications.  Neutron distributions in reactor, accelerator and material structures resulting from single and multiple reactions, and in wave phenomena (optics) and inelastic scattering experiments.  Comparison of neutron and fluid transport.  Particle simulations.   Term paper and presentation required.","level":"High Graduate","prereqs":"22.101","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"B. Forget, S. Yip"},{"type":"Class","id":"22.211","course":"22","label":"Nuclear Reactor Physics I","shortLabel":"Nuclear Reactor Physics I","units":"3-0-9","total-units":12,"description":"Reviews the physics basis for modern nuclear reactor design.  Topics include the continuous energy transport equation and its adjoint; reduction to diffusion theory and the group diffusion equations; calculation of neutron spectra and determination of few group diffusion constants.  The final segment is devoted to heterogeneous reactor analysis.","level":"High Graduate","prereqs":"18.075","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"Staff"},{"type":"Class","id":"22.251","course":"22","label":"Systems Analysis of the Nuclear Fuel Cycle","shortLabel":"Systems Analysis of the Nuclear Fuel Cycle","units":"3-2-7","total-units":12,"description":"Study of the relationship between the technical and policy elements of the nuclear fuel cycle. Topics include uranium supply, enrichment, fuel fabrication, in-core reactivity  and fuel management of uranium and other fuel types, used fuel reprocessing and waste disposal. Principles of fuel cycle economics and the applied reactor physics of both contemporary and proposed thermal and fast reactors are presented. Nonproliferation aspects, disposal of excess weapons plutonium, and transmutation of long lived radioisotopes in spent fuel are examined. Several state-of-the-art computer programs relevant to reactor core physics and heat transfer are provided for student use in problem sets and term papers.","level":"High Graduate","prereqs":"22.05","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"M. S. Kazimi"},{"type":"Class","id":"22.312","course":"22","label":"Engineering of Nuclear Reactors","shortLabel":"Engineering of Nuclear Reactors","units":"3-0-9","total-units":12,"description":"Engineering principles of nuclear reactors, emphasizing power reactors. Power plant thermodynamics, reactor heat generation and removal (single-phase as well as two-phase coolant flow and heat transfer), and structural mechanics. Engineering considerations in reactor design.","level":"High Graduate","prereqs":"2.001 and 2.005 or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"J. Buongiorno"},{"type":"Class","id":"22.920","course":"22","label":"Interactive Introduction to Nuclear Magnetic Resonance","shortLabel":"Interactive Introduction to Nuclear Magnetic Resonance","units":"1-2-0","total-units":3,"description":"Interactive introduction to NMR presenting background in classical theory and instrumentation. Each lecture followed by lab experiments both to demonstrate ideas presented during the lecture and to familiarize students with state-of-the-art NMR instrumentation. Experiments cover topics ranging from spin dynamics to spectroscopy, and include both imaging and quantum information processing.","level":"High Graduate","prereqs":"GIR:CAL2","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"8.22J","equivalent":"","semester":['IAP'],"in-charge":"D. G. Cory, S. D. Sewell"},{"type":"Class","id":"22.313","course":"22","label":"Thermal Hydraulics in Power Technology","shortLabel":"Thermal Hydraulics in Power Technology","units":"3-0-9","total-units":12,"description":"Emphasis on thermo-fluid dynamic phenomena and analysis methods for conventional and nuclear power stations. Kinematics and dynamics of two-phase flows.  Steam separation.  Boiling, instabilities, and critical conditions. Single-channel transient analysis.  Multiple channels connected at plena.  Loop analysis including single and two-phase natural circulation.  Subchannel analysis.","level":"High Graduate","prereqs":"2.006, 10.302, 22.312, or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"2.59J, 10.536J","equivalent":"","semester":['Spring'],"in-charge":"M. S. Kazimi, N. E. Todreas"},{"type":"Class","id":"22.314","course":"22","label":"Structural Mechanics in Nuclear Power Technology","shortLabel":"Structural Mechanics in Nuclear Power Technology","units":"3-0-9","total-units":12,"description":"Structural components in nuclear power plant systems, their functional purposes, operating conditions, and mechanical/structural design requirements. Combines mechanics techniques with models of material behavior to determine adequacy of component design. Considerations include mechanical loading, brittle fracture, inelastic behavior, elevated temperatures, neutron irradiation, vibrations and seismic effects.","level":"High Graduate","prereqs":"2.001 or Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"1.56J, 2.084J","equivalent":"","semester":['Fall'],"in-charge":"M. S. Kazimi, O. Buyukozturk"},{"type":"Class","id":"22.33","course":"22","label":"Nuclear Engineering Design","shortLabel":"Nuclear Engineering Design","units":"3-0-9","total-units":12,"description":"Group design project involving integration of nuclear physics, particle transport, control, heat transfer, safety, instrumentation, materials, environmental impact, and economic optimization. Provides opportunity to synthesize knowledge acquired in nuclear and non-nuclear subjects and apply this knowledge to practical problems of current interest in nuclear applications design.  Past projects have included using a fusion reactor for transmutation of nuclear waste, design and implementation of an experiment to predict and measure pebble flow in a pebble bed reactor, and development of a mission plan for a manned Mars mission including the conceptual design of a nuclear powered space propulsion system and power plant for the Mars surface.  Meets with undergraduate subject 22.033, but assignments differ.","level":"High Graduate","prereqs":"22.312","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"A. C. Kadak"},{"type":"Class","id":"22.38","course":"22","label":"Probability and Its Applications To Reliability, Quality Control, and Risk Assessment","shortLabel":"Probability and Its Applications To Reliability, Quality Control, and Risk Assessment","units":"3-0-9","total-units":12,"description":"Interpretations of the concept of probability. Basic probability rules; random variables and distribution functions; functions of random variables. Applications to quality control and the reliability assessment of mechanical/electrical components, as well as simple structures and redundant systems. Elements of statistics. Bayesian methods in engineering. Methods for reliability and risk assessment of complex systems, (event-tree and fault-tree analysis, common-cause failures, human reliability models). Uncertainty propagation in complex systems (Monte Carlo methods, Latin hypercube sampling). Introduction to Markov models. Examples and applications from nuclear and other industries, waste repositories, and mechanical systems. Open to qualified undergraduates.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Spring'],"in-charge":"G. Apostolakis"},{"type":"Class","id":"22.39","course":"22","label":"Integration of Reactor Design, Operations, and Safety","shortLabel":"Integration of Reactor Design, Operations, and Safety","units":"3-2-7","total-units":12,"description":"Integration of reactor physics and engineering sciences into nuclear power plant design focusing on designs that are projected to be used in the first half of this century. Topics include materials issues in plant design and operations, aspects of thermal design, fuel depletion and fission-product poisoning, and temperature effects on reactivity. Safety considerations in regulations and operations such as the evolution of the regulatory process, the concept of defense in depth, general design criteria, accident analysis, probabilistic risk assessment, and risk-informed regulations.","level":"High Graduate","prereqs":"22.211, 22.312","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"M.W. Golay, R. G. Ballinger, N. E. Todreas, A. C. Kadak"},{"type":"Class","id":"22.40","course":"22","label":"Fundamentals of Advanced Energy Conversion","shortLabel":"Fundamentals of Advanced Energy Conversion","units":"4-0-8","total-units":12,"description":"Fundamentals of thermodynamics, chemistry, and transport applied to energy systems. Analysis of energy conversion and storage in thermal, mechanical, chemical, and electrochemical processes in power and transportation systems, with emphasis on efficiency, performance and environmental impact. Applications to fuel reforming and alternative fuels, hydrogen, fuel cells and batteries, combustion, catalysis, combined and hybrid power cycles using fossil, nuclear and renewable resources. CO2 separation and capture. Biomass energy.","level":"High Graduate","prereqs":"2.006, 3.044, or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"2.62J, 10.392J","equivalent":"","semester":['Spring'],"in-charge":"A. F. Ghoniem, M. Kazimi, Y. Chiang"},{"type":"Class","id":"22.51","course":"22","label":"Quantum Theory of Radiation Interactions","shortLabel":"Quantum Theory of Radiation Interactions","units":"3-0-9","total-units":12,"description":"Introduces elements of applied quantum mechanics and statistical physics. Starting from the experimental foundation  of quantum mechanics, develops the basic principles of interaction of electromagnetic radiation with matter.  Introduces quantum theory of radiation, time-dependent perturbation theory, transition probabilities and cross sections. Applications are to controlling coherent and decoherent dynamics with examples from quantum information processing.","level":"High Graduate","prereqs":"22.101, 22.105","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"D. Cory"},{"type":"Class","id":"22.52","course":"22","label":"Statistical Thermodynamics of Complex Liquids","shortLabel":"Statistical Thermodynamics of Complex Liquids","units":"3-0-6","total-units":9,"description":"Theory of self-assembly in surfactant-water (micellar) and surfactant-water-oil (micro-emulsion) systems. Introduction to the theory of polymer solutions. Introduction to scattering techniques, light, x-ray, and neutron scattering applied to studies of the structure and dynamics of complex liquids. Modern theory of the liquid state relevant to structured (supramolecular) liquids.","level":"High Graduate","prereqs":"8.08, 10.213","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"8.575J, 10.44J","equivalent":"","semester":['Spring'],"in-charge":"D. Blankschtein, S. H. Chen"},{"type":"Class","id":"22.53","course":"22","label":"Statistical Processes and Atomistic Simulations","shortLabel":"Statistical Processes and Atomistic Simulations","units":"3-0-9","total-units":12,"description":"Statistical mechanics principles of equilibrium and time-dependent properties of condensed states of matter. Phase-space distributions, time correlations functions, kinetic equations. Free energy calculations. Stochastic processes. Continuum and molecular models for transport phenomena and phase transitions. Methods and applications of molecular dynamics and Monte Carlo simulations in statistical physics and materials science.","level":"High Graduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"S. Yip"},{"type":"Class","id":"22.55","course":"22","label":"Radiation Biophysics","shortLabel":"Radiation Biophysics","units":"3-0-9","total-units":12,"description":"Provides a background in sources of radiation with an emphasis on terrestrial and space environments and on industrial production. Discusses experimental approaches to evaluating biological effects resulting from irradiation regimes differing in radiation type, dose and dose-rate.  Effects at the molecular, cellular, organism, and population level are examined.  Literature is reviewed identifying gaps in our understanding of the health effects of radiation, and responses of regulatory bodies to these gaps is discussed.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"HST.560J","equivalent":"","semester":['Spring'],"in-charge":"J. C. Yanch"},{"type":"Class","id":"22.56","course":"22","label":"Noninvasive Imaging in Biology and Medicine","shortLabel":"Noninvasive Imaging in Biology and Medicine","units":"3-0-9","total-units":12,"description":"Background in the theory and application of noninvasive imaging methods in biology and medicine, with emphasis on neuroimaging. Focuses on the modalities most frequently used in scientific research (x-ray CT, PET/SPECT, MRI, and optical imaging), and includes discussion of molecular imaging approaches used in conjunction with these scanning methods. Lectures are supplemented by in-class discussions of problems in research and demonstrations of imaging systems.","level":"High Graduate","prereqs":"18.03, 8.03, or permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"9.173J, 20.483J, HST.561J","equivalent":"","semester":['Fall'],"in-charge":"A. Jasanoff"},{"type":"Class","id":"22.561","course":"22","label":"Magnetic Resonance Analytic, Biochemical, and Imaging Techniques","shortLabel":"Magnetic Resonance Analytic, Biochemical, and Imaging Techniques","units":"3-0-12","total-units":15,"description":"Introduction to basic NMR theory. Examples of biochemical data obtained using NMR summarized along with other related experiments. Detailed study of NMR imaging techniques includes discussions of basic cross-sectional image reconstruction, image contrast, flow and real-time imaging, and hardware design considerations. Exposure to laboratory NMR spectroscopic and imaging equipment included.","level":"High Graduate","prereqs":"Permission of instructor","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"HST.584J","equivalent":"","semester":['Spring'],"in-charge":"B. R. Rosen"},{"type":"Class","id":"22.562","course":"22","label":"Spatial Aspects of Nuclear Magnetic Resonance Spectroscopy","shortLabel":"Spatial Aspects of Nuclear Magnetic Resonance Spectroscopy","units":"3-0-9","total-units":12,"description":"Discusses the theory and application of nuclear magnetic resonance spectroscopy to questions of the spatial distribution of spins. Covers NMR imaging, localized spectroscopy, and local geometries as determined by diffusive processes. The theory is discussed in terms of the density operator and reciprocal space (for both imaging and motional studies). Describes applications to rapid imaging, dynamic imaging, microscopy, and localized spectroscopy. Instrumentation and experimental constraints are also described.","level":"High Graduate","prereqs":"18.03, 8.05","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"D. G. Cory"},{"type":"Class","id":"22.611","course":"22","label":"Introduction to Plasma Physics I","shortLabel":"Introduction to Plasma Physics I","units":"3-0-9","total-units":12,"description":"Introduces plasma phenomena relevant to energy generation by controlled thermonuclear fusion and to astrophysics. Elementary plasma concepts, plasma characterization.  Motion of charged particles in magnetic fields. Coulomb collisions, relaxation times, transport processes. Two-fluid hydrodynamic and MHD descriptions. Plasma confinement by magnetic fields, simple equilibrium and stability analysis. Wave propagation in a magnetic field; application to RF plasma heating. Introduction to kinetic theory; Vlasov, Boltzmann and Fokker-Planck equations; relation of fluid and kinetic descriptions. Electron and ion acoustic plasma waves, Landau damping.","level":"High Graduate","prereqs":"6.013, 8.07, or 22.105; 18.04 or [18.075]","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"6.651J, 8.613J","equivalent":"","semester":['Fall'],"in-charge":"R. Parker, I. Hutchinson, J. Freidberg"},{"type":"Class","id":"22.612","course":"22","label":"Introduction to Plasma Physics II","shortLabel":"Introduction to Plasma Physics II","units":"3-0-9","total-units":12,"description":"Linear waves and instabilities in magnetized plasma; solutions of Vlasov-Maxwell equations in homogeneous and inhomogeneous plasmas; conservation principles for energy and momentum; quasi-linear theory and nonlinear stabilization; solitons and coherent nonlinear phenomena; collisions and discrete particle effects; fluctuations in a stable plasma; Fokker-Planck equation and transport phenomena. A subject description tailored to fit the background and interests of the attending students distributed shortly before and at the beginning of the subject.","level":"High Graduate","prereqs":"6.651J, 8.613J, or 22.611J","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"6.652J, 8.614J","equivalent":"","semester":['Spring'],"in-charge":"Staff"},{"type":"Class","id":"22.921","course":"22","label":"Nuclear Power Plant Dynamics and Control","shortLabel":"Nuclear Power Plant Dynamics and Control","units":"1-0-2","total-units":3,"description":"Introduction to reactor dynamics including subcritical multiplication, critical operation in absence of thermal feedback effects and effects of xenon, fuel and moderator temperature, etc. Derivation of point kinetics and dynamic period equations. Techniques for reactor control including signal validation, supervisory algorithms, model-based trajectory tracking, and rule-based control. Overview of light-water reactor startup. Lectures and demonstrations with use of the MIT Research Reactor.  Open to undergraduates with permission of instructor.","level":"Graduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['IAP'],"in-charge":"J. A. Bernard"},{"type":"Class","id":"22.93","course":"22","label":"Teaching Experience in Nuclear Science & Engineering","shortLabel":"Teaching Experience in Nuclear Science & Engineering","units":"0-0-0","total-units":0,"description":"For qualified graduate students interested in teaching as a career. Classroom, laboratory, or tutorial teaching under the supervision of a faculty member. Students selected by interview. Credits for this subject may not be used toward master's or engineer's degrees. Enrollment limited by the availability of suitable assignments.","level":"High Graduate","prereqs":"Permission of department","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"I. H. Hutchinson"},{"type":"Class","id":"22.94","course":"22","label":"Research in Nuclear Science and Engineering","shortLabel":"Research in Nuclear Science and Engineering","units":"0-0-0","total-units":0,"description":"For Research Assistants in Nuclear Science and Engineering who have not completed the NSE doctoral qualifying exam.  Hours arranged with and approved by the research supervisor.  Units may not be used towards advanced degree requirements.","level":"Graduate","prereqs":"Permission of research supervisor","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"J. A. Coderre"},{"type":"Class","id":"22.96","course":"22","label":"Quantum Mechanics for Nuclear Engineers","shortLabel":"Quantum Mechanics for Nuclear Engineers","units":"1-0-2","total-units":3,"description":"See description under subject 22.096.","level":"Graduate","prereqs":"","grading":"Letter graded","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['IAP'],"in-charge":"S. H. Chen"},{"type":"Class","id":"22.EPE","course":"22","label":"UPOP Summer Practice Experience","shortLabel":"UPOP Summer Practice Experience","units":"0-1-0","total-units":1,"description":"Immerses engineering sophomores in the world of professional engineering experience by providing guided instruction in all aspects of the job acquisition process. Students complete a 10-12 week internship assignment during the summer, which includes maintaining a structured journal of observations and experiences, meeting with UPOP staff members, writing essays, and completing a self-evaluation. May be repeated twice for credit; spring term can be taken only in conjunction with fall term.","level":"Undergraduate","prereqs":"2.EPW or permission of instructor","grading":"P/D/F","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring'],"in-charge":"S. LuperFoy"},{"type":"Class","id":"22.EPR","course":"22","label":"UPOP Reflective Learning Experience","shortLabel":"UPOP Reflective Learning Experience","units":"0-0-3","total-units":3,"description":"Reflective learning experiences for engineering juniors that serve as the culmination of their sophomore year in the UPOP program. Students review their internship experiences through written and oral presentations and receive small-group and individualized coaching to reinforce the cognitive link between all aspects of the UPOP experience and their disciplinary field of study.","level":"Undergraduate","prereqs":"2.EPE or permission of instructor","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"S. LuperFoy"},{"type":"Class","id":"22.EPW","course":"22","label":"UPOP IAP Workshop","shortLabel":"UPOP IAP Workshop","units":"3-0-0","total-units":3,"description":"Introduction to professional development skills for engineering practice. Experiential learning modules prepare sophomores for success in summer internship and beyond. Faculty and senior engineering professionals recruited from industry guide teams through learning activities, which include creative simulations, team competitions, oral presentations, and group problem-solving. Limited enrollment.","level":"Undergraduate","prereqs":"","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['IAP'],"in-charge":"S. LuperFoy"},{"type":"Class","id":"22.NIV","course":"22","label":"Visiting Student Research","shortLabel":"Visiting Student Research","units":"0-0-0","total-units":0,"description":"","level":"Undergraduate","prereqs":"","grading":"Letter graded","repeatable":"Can be repeated for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":""},{"type":"Class","id":"22.THG","course":"22","label":"Graduate Thesis","shortLabel":"Graduate Thesis","units":"0-0-0","total-units":0,"description":"Program of research, leading to the writing of an SM, NE, PhD, or ScD thesis; to be arranged by the student and an appropriate MIT faculty member. Consult department graduate office.","level":"High Graduate","prereqs":"--","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"J. A. Coderre"},{"type":"Class","id":"22.THT","course":"22","label":"Undergraduate Thesis Tutorial","shortLabel":"Undergraduate Thesis Tutorial","units":"1-0-2","total-units":3,"description":"A series of lectures on prospectus and thesis writing. Students select a thesis topic and a thesis advisor who reviews and approves the prospectus for thesis work in the spring term.","level":"Undergraduate","prereqs":"22.09","grading":"P/D/F","repeatable":"Not repeatable for credit","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall'],"in-charge":"Staff"},{"type":"Class","id":"22.THU","course":"22","label":"Undergraduate Thesis","shortLabel":"Undergraduate Thesis","units":"0-0-0","total-units":0,"description":"Program of research, leading to the writing of an SB thesis, to be arranged by the student and appropriate MIT faculty member. See department undergraduate headquarters.","level":"Undergraduate","prereqs":"22.ThT","grading":"Letter graded","repeatable":"Continuing and Repeatable","ci":"Communication Intensive Major","gir":"","joint":"","equivalent":"","semester":['Fall', 'Spring', 'Summer'],"in-charge":"D. Cory"},{"type":"Class","id":"22.UR","course":"22","label":"Undergraduate Research Opportunities Program","shortLabel":"Undergraduate Research Opportunities Program","units":"0-0-0","total-units":0,"description":"","level":"Undergraduate","prereqs":"","grading":"P/D/F","repeatable":"Continuing and Repeatable","ci":"","gir":"","joint":"","equivalent":"","semester":['Fall', 'IAP', 'Spring', 'Summer'],"in-charge":"A.C. Kadak"}]}